{
    "headlines": [
      {
        "title": "Hello",
        "source": "CNN",
        "body": "A stalemate in Washington could destroy a landmark tax deal that was painstakingly hammered out among 140 countries over the better part of a decade. \n\n Some analysts say that the United States’ inability to ratify the deal could lead to a tax war among the richest nations that would hit tech behemoths like Google, Apple, Meta and Amazon particularly hard. \n\n What’s happening: The Organisation for Economic Co-operation and Development (OECD) worked for years to negotiate a deal among its member countries that would close loopholes allowing large multinational companies to avoid paying up to $240 billion each year in tax.\n\n In 2021, the OECD came up with an agreement that all parties signed on to. Called the ”Pillar 1” reform, it would simply require companies to pay taxes in the country they made money in, regardless of whether or not the company was headquartered there. \n\n It took more than a decade of work by the OECD and related parties to get there. \n\n The problem: The Pillar 1 reform was supposed to be ratified by June 30. That didn’t happen. \n\n While the Biden administration broadly supports the plan, Senate Republicans are against it, and a divided Senate has stopped the US ratifying the agreement. (“Under the US Constitution, tax treaties require the advice and consent of the Senate, with a two-thirds majority vote of approval,” according to the Senate Committee on Finance website.) \n\n Former President Donald Trump, meanwhile, has indicated that he wouldn’t support the reforms if he’s elected back into the Oval Office this November. \n\n Other countries aren’t waiting to find out. Canada recently implemented a local tax on the world’s largest tech companies, something the OECD treaty had sought to avoid. New Zealand has also said it will implement its own digital services tax on large multinational companies beginning in 2025. \n\n Manal Corwin, director of the OECD’s Centre for Tax Policy and Administration, says that negotiations are still ongoing. \n\n “Countries are still at the table, precisely because we are making progress,” she wrote in a statement Monday. “As each of these milestones arrives, whether we successfully conclude by a given date or not, we get closer to the finish line,” she said. “It is exactly why the commitment remains high and why we remain optimistic that the (group) can deliver a final agreement.” \n\n What it means: If no global agreement goes into effect, some countries will begin to compete for revenue from large multinationals by lowering taxes in what is sometimes called a “tax war.” \n\n It will also mean that large tech companies will have to contend with inconsistent tax codes around the globe, as national taxes proliferate (see Canada and New Zealand.)\n\n “When companies are feeling secure and can predict where policy is going and what the global financial outlook will be for the foreseeable future, they are much more confident in making investments,” said Megan Funkhouser of the Information Technology Industry Council, a group that represents the tech sector. If taxation and global policy toward digital companies is “uncertain, unpredictable and unstable” she said, companies might not want to “make investments, contribute to economic growth and create and retain jobs.”"
      },
      {
        "title": "Another Headline",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },      {
        "title": "Another Headline",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline",
        "source": "BBC",
        "body": "This is another news story from BBC."
      }

      
    ]
  }
  