{
  "headlines": [
      {
          "title": "India's X alternative Koo to shut down services",
          "source": "BBC",
          "body": "Millions of social media users in India are stranded after homegrown microblogging platform Koo, which had branded itself as an alternative to X, announced it was shutting services.\nThe platform's founders said a shortage of funding along with high costs for technology had led to the decision. \nLaunched in 2020, Koo offered messaging in more than 10 Indian languages.\nIt gained prominence in 2021 after several ministers endorsed it amid a row between the Indian government and X, which was then known as Twitter. \nThe spat began after Prime Minister Narendra Modi's government asked the US-based platform to block a list of accounts it claimed were spreading fake news. The list included journalists, news organisations and opposition politicians.\nX complied initially but then restored the accounts, citing \"insufficient justification\". \nThe face-off continued as the government threatened legal action against the company's employees in India.\nAmid the row, a flurry of supporters, cabinet ministers and officials from Mr Modi's Bharatiya Janata Party (BJP) migrated to Koo overnight. Many of them shared hashtags calling for X to be banned in India.\nBy the end of 2021, the app had touched 20 million downloads in the country. \nHowever, the platform has struggled to get funding in the last few years. \nOn Wednesday, founders Aprameya Radhakrishna and Mayank Bidawatka said that Koo was \"just months away\" from beating X in India in 2022, but a \"prolonged funder winter\" had forced them to tone down their ambitions. \n“We explored partnerships with multiple larger internet companies, conglomerates and media houses but these talks didn’t yield the outcome we wanted,” they wrote on LinkedIn. \n“Most of them didn’t want to deal with user-generated content and the wild nature of a social media company. A couple of them changed priority almost close to signing.”\nIn February, Indian news websites had reported that Koo was in talks to be acquired by news aggregator Dailyhunt. But the talks did not succeed.\nIn April 2023, Koo fired 30% of its 260-member workforce as the company faced severe losses and a lack of funding.\nThe founders said they would have liked to keep the app running - but the cost of technology services for that was high and so, they “had to take this tough decision”.\nBhole Baba, who led the festival where some 120 people died, will co-operate with investigations.\nThe incident that took place during a religious gathering is among the deadliest crushes in India in a decade.\nAt least 121 people, mostly women, were killed in the crush at a religious event in northern India.\nMost of the dead were women - killed as crowds left a packed religious gathering in Uttar Pradesh state.\nFixtures, results and scorecards from India's brief tour of Zimbabwe, featuring five Twenty20 internationals.\nCopyright 2024 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
          "value": -1.42,
          "type": "business"
      },
      {
          "title": "Stock market today: Asian shares are mostly higher after Wall Street hits more records",
          "source": "AP News",
          "body": "A passerby walks past an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Thursday, July 4, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)\nA passerby walks past an electronic stock board showing Japan’s Nikkei 225 index, right, at a securities firm Thursday, July 4, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)\nA passerby walks past an electronic stock board showing Japan’s Nikkei 225 index, center, at a securities firm Thursday, July 4, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)\nThe New York Stock Exchange is seen on Wednesday, July 3, 2024, in New York. Wall Street is leaning toward minuscule gains before the bell ahead of the Fourth of July holiday. (AP Photo/Peter Morgan)\n\n\n\n\n\n\n\n\nBANGKOK (AP) — Shares were mostly higher in Asia on Thursday after Wall Street’s record-breaking rally powered on. \nShares fell in Chinese markets but rose in the rest of the region. U.S. futures were nearly unchanged and oil prices fell. \nOn Wednesday, U.S. stocks kept rising in a holiday-shortened session after weak reports on the economy kept the door open for possible cuts to interest rates. \nU.S. markets will be closed Thursday for the Independence Day holiday.\nInvestors worldwide are keen to see the Federal Reserve cut rates that it has been keeping at two-decade highs to slow growth and tame inflation.\nIn Tokyo, the Nikkei 225 gained 0.6% to 40,815.95, with buying of automakers’ shares and other export oriented stocks kept the benchmark near 35-year highs. \nToyota Motor Corp. was up 1.3% and computer testing equipment maker Advantest Corp. gained 2.4%.\nHong Kong’s Hang Seng recovered from early losses, edging up 0.1% to 17,988.25, and the Shanghai Composite index shed 0.4% to 2,969.45. \nTaiwan’s Taiex jumped 1.2% as chip maker and market heavyweight Taiwan Semiconductor Manufacturing Corp. gained 2.7%. \nIn Australia, the S&P/ASX 200 surged 1% to 7,815.80, while the Kospi in Seoul advanced 0.7% to 2,813.54. \nBangkok’s SET jumped 1%. \nOn Wednesday, the S&P 500 rose 0.5% to set an all-time high for a second straight day and for the 33rd time this year. It closed at 5,537.02. \n\n\nThe Dow Jones Industrial Average dipped 0.1% to 39,308.00, and the Nasdaq composite gained 0.9% to 18,188.30.\nTesla again helped boost the market and rose 6.5% a day after reporting a milder drop in sales for the spring than analysts feared. It was one of the strongest forces pushing upward on the S&P 500, along with Nvidia. The darling of Wall Street’s rush into artificial-intelligence technology climbed 4.6% to bring the chip company’s gain for the year so far to 159%. \nThe action was stronger in the bond market, where Treasury yields slid following a flurry of reports that came in weaker than expected on both the job market and U.S. services companies. The data could keep the Federal Reserve on course to deliver the cuts to interest rates later this year that Wall Street desires.\nOne report said activity for businesses in the real estate, retail trade and other U.S. services industries contracted in June for just the third time in 49 months, weaker than economists’ forecasts. Perhaps more importantly for Wall Street, the report from the Institute Supply Management also said prices were increasing at a slower pace. \nThat followed reports from earlier in the morning showing a slowing job market. \nThe hope on Wall Street is that the economy will soften by just enough to keep a lid on upward pressure on inflation, but not so much that it throws workers out of their jobs and triggers a recession. \nA much more anticipated report will arrive on Friday, when the U.S. government will give its comprehensive update about how many workers employers added to their payrolls during June.\nThe yield on the 10-year Treasury dropped to 4.35% from 4.44% late Tuesday, a notable move for the bond market, and much of the slide came after the report on U.S. services businesses. It’s been generally sinking since April on hopes that inflation is slowing enough to get the Federal Reserve to lower its main interest rate from the highest level in more than two decades.\nIn other dealings, U.S. benchmark crude oil gave up 56 cents to $83.32 per barrel in electronic trading on the New York Mercantile Exchange. \nBrent crude, the international standard, lost 51 cents to $86.83 per barrel. \nThe U.S. dollar fell to 161.50 Japanese yen, reflecting expectations that U.S. interest rate cuts might narrow the gap in rates with Japan, where the benchmark lending rate is near zero. \nThe euro was unchanged at $1.0787.\nAP Business Writer Stan Choe contributed.\nCopyright 2024 The Associated Press. All Rights Reserved.",
          "value": -2.28,
          "type": "business"
      },
      {
          "title": "Walmart must face lawsuit over deceptive pricing, Illinois court rules",
          "source": "Fox Business",
          "body": "Walmart must face a class action lawsuit that ruled that the retailer overcharged customers with 'deceptive and unfair pricing practices.' \n\n Plaintiff Yoram Kahn alleged that the world's largest retailer 'takes advantage of consumers in Illinois and nationwide with deceptive and unfair pricing practices.'\n\n Kahn argued that while the price discrepancies were small, they 'add up to hundreds of millions of dollars each year.' \n\n 'Kahn alleges that Walmart is aware of these discrepancies between shelf prices and register prices and that its unfair and deceptive pricing practices are pervasive and continuous,' he said. \n\n Kahn alleged that he shopped at a Walmart store in Niles, Illinois, on Aug. 2, 2022, and relied on the marked prices but was greeted with a significant markup when he checked out. \n\n 'When Kahn checked out, the actual prices of these six items scanned at ten to fifteen percent markups above the shelf prices,' the court ruled. \n\n 'In total, Kahn paid Walmart $1.89 in overcharges on these six items, nearly seven percent of the pretax total of his bill,'they said. 'Small change for Kahn as an individual, no doubt, but keep in mind the volume of Walmart’s business.' \n\n Reversing a lower court judge on Wednesday, the 7th U.S. Circuit Court of Appeals in Chicago ruled that consumers could try to prove that Walmart used a fraudulent 'bait-and-switch' method that violated the state's consumer protection laws. \n\n The plaintiff alleged that Walmart violated the Illinois Consumer Fraud and Deceptive Business Practices Act, the Illinois Uniform Deceptive Trade Practices Act and other states’ consumer protection statutes. \n\n The court also disagreed with Walmart's argument that providing receipts after purchases negated any unfairness caused by inaccurate shelf prices. \n\n Walmart, based in Bentonville, Arkansas, did not immediately respond to Fox News Digital's request for comment.",
          "value": 9.43,
          "type": "business"
      },
      {
          "title": "What's open and closed on July 4th? Details on stores, restaurants, Walmart, Costco, Target, more",
          "source": "USA TODAY",
          "body": "Banks and post offices will be closed on Thursday, July 4 in observance of Independence Day, however most major restaurant, grocery and retail store chains will remain open on the holiday.\nCompanies such as Walmart, Starbucks, Chick-fil-A and Target, among many others, will keep their doors open on the federal holiday this year. The stock market, however, will also be closed on Thursday.\nThe origins of the Fourth of July date back to when Philadelphians marked the first anniversary of American independence with a \"spontaneous celebration,\" which is described in a letter by John Adams to his daughter, Abigail, according to the Library of Congress.\nHowever, the annual observation of the holiday only became a regular occurrence after the War of 1812, where events such as groundbreaking ceremonies for the Erie Canal and the Baltimore and Ohio Railroad were scheduled to coincide with Fourth of July festivities. Congress passed a law making Independence Day a federal holiday on June 28, 1870.\nHere is what you need to know about what is open and closed on the Fourth of July this year.\nLearn more: Best current CD rates\nWalmart stores will be open from 6 a.m. to 11 p.m. on the Fourth of July, a company spokesperson told USA TODAY. However it is best to reach out to your local Walmart or check the online store directory before heading to the store.\nAccording to Costco's website, warehouses will be closed on Thursday, July 4.\nYes, Target stores will be open on the Fourth of July, the company told USA TODAY. Store hours vary by location, so check with your local store regarding its specific holiday hours.\nThe following restaurants are open on July 4. Hours are displayed for companies that provided them.\nHere's which grocery stores are open on July 4. Hours are listed for the companies that provided them.\nCostco warehouses will be closed on Thursday.\nStores listed below will be open on July 4. Hours are listed for the companies that provided them.\nGabe Hauari is a national trending news reporter at USA TODAY. You can follow him on X @GabeHauari or email him at Gdhauari@gannett.com.",
          "value": -3.85,
          "type": "business"
      },
      {
          "title": "Federal judge temporarily blocks rule banning noncompete contracts ",
          "source": "Washington Post",
          "body": "At stake is a new Federal Trade Commission regulation that prohibits contracts that keep workers from jumping to rival employers.\nA federal judge in Texas temporarily blocked on Wednesday a Federal Trade Commission rule banning noncompete agreements, a new regulation business groups have strenuously opposed.\nIn a 33-page opinion, Judge Ada Brown found that the agency lacked the authority to issue the rule, which makes it illegal for employers to include noncompete agreements in workers’ contracts. Brown’s order, which is limited to the plaintiffs, postpones the effective date of the rule, Sept. 4, until the court reaches a decision on the case’s merits, which she said would take place by Aug. 30. The plaintiffs include a Dallas-based tax consultancy and the U.S. Chamber of Commerce.\nThe FTC rule could affect up to millions of workers outside the scope of the lawsuit once it kicks in, as some studies suggest up to one in five employees are bound by noncompete agreements.\nNoncompete agreements typically restrict workers from switching employers within their industry for specified periods of time. They’re used in a wide range of industries — including technology, hairstyling, medicine and even dance instruction — affecting low- to high-wage earners.\nStories to keep you informed\nA covid summer uptick is underway as FLiRT and LB.1 variants ascend\n51,000-year-old cave painting may be earliest scene depicted through art\nAnts can perform life-saving amputations on their wounded, study says\nMinneapolis cat tour started as joke, now draws hundreds of admirers       \nIs aloe vera the key to perfect skin? Here’s what the science says.\nIn April, the FTC voted 3-2 to ban the agreements, with commissioners in the majority pointing to research that shows such covenants suppress wages, stifle entrepreneurship and gum up labor markets. Critics of the rule, including business groups such as the U.S. Chamber of Commerce, argued that the agreements are an important tool to protect proprietary information and investments in training.\nThe Chamber and other business groups sued to block the rule immediately after it was issued, arguing the FTC lacked the authority to issue a regulation with such sweeping implications for the economy.\nThe Chamber subsequently joined the case brought by Ryan LLC, a global tax-consulting firm headquartered in Dallas, that sued to block the rule in Northern District of Texas on April 23, the day the FTC issued its rule. The Business Roundtable, the Texas Association of Business and the Longview Chamber of Commerce also joined the case after it was initially filed.\n“This ruling is a big win in the Chamber’s fight against government micromanagement of business decisions,” Daryl Joseffer, chief counsel at the Chamber, said in a statement. “The FTC’s blanket ban on noncompetes is an unlawful power grab that defies the agency’s constitutional and statutory authority and sets a dangerous precedent where the government knows better than the markets.”\nThe FTC said it’s reviewing the decision and evaluating its next steps.\n“The FTC stands by our clear authority, supported by statute and precedent, to issue this rule,” Douglas Farrar, an FTC spokesman, said in a statement. “We will keep fighting to free hard-working Americans from unlawful noncompetes, which reduce innovation, inhibit economic growth, trap workers, and undermine Americans’ economic liberty.”\nIn reaching her decision, Brown found that the plaintiffs “are likely to succeed on the merits” of their case, which argues the FTC exceeded its statutory authority in issuing the rule. She also sided with the plaintiffs in finding that the FTC’s issuing of the rule was not reasonable.\n“The Commission’s lack of evidence as to why they chose to impose such a sweeping prohibition — that prohibits entering or enforcing virtually all non-competes — instead of targeting specific, harmful non-competes, renders the [rule] arbitrary and capricious,” Brown wrote.",
          "value": -6.72,
          "type": "business"
      },
      {
          "title": "GM will pay $146M in penalties because 5.9M older vehicles emit excess carbon dioxide",
          "source": "New York Post",
          "body": "General Motors will pay nearly $146 million in penalties to the federal government because 5.9 million of its older vehicles do not comply with emissions and fuel economy standards.\nThe National Highway Traffic Safety Administration said in a statement Wednesday that certain GM vehicles from the 2012 through 2018 model years did not comply with federal fuel economy requirements.\nThe penalty comes after the Environmental Protection Agency said its testing showed the GM pickup trucks and SUVs emit over 10% more carbon dioxide on average than GM’s initial compliance testing claimed.\nThe EPA says the vehicles will remain on the road and cannot be repaired. \nThe GM vehicles on average consume at least 10% more fuel than the window sticker numbers say, but the company won’t be required to reduce the miles per gallon on the stickers, the EPA said.\n“Our investigation has achieved accountability and upholds an important program that’s reducing air pollution and protecting communities across the country,” EPA Administrator Michael Regan said.\nGM said in a statement that it complied with all regulations in pollution and mileage certification of its vehicles. \nThe company said it is not admitting to any wrongdoing nor that it failed to comply with the Clean Air Act.\nThe problem stems from a change in testing procedures that the EPA put in place in 2016, GM spokesman Bill Grotz said.\nOwners don’t have to take any action because there is no defect in the vehicles, Grotz said.\n“We believe this voluntary action is the best course of action to resolve the outstanding issues with the federal government,” he said.\nThe enforcement action involves about 4.6 million full-size pickups and SUVs and about 1.3 million midsize SUVs, the EPA said. \nThe affected models include the Chevy Tahoe, Cadillac Escalade and Chevy Silverado. About 40 variations of GM vehicles are covered.\nGM will be forced to give up credits used to ensure that manufacturers’ greenhouse gas emissions are below the fleet standard for emissions that applies for that model year, the EPA said. \nIn a quarterly filing with the Securities and Exchange Commission, GM said it expects the total cost to resolve the matter will be $490 million.\nBecause GM agreed to address the excess emissions, EPA said it was not necessary to make a formal determination regarding the reasons for the excess pollution.\nBut David Cooke, senior vehicles analyst for the Union of Concerned Scientists, questioned how GM could not know that pollution exceeded initial test by more than 10% because the problem was so widespread on so many different vehicles. \n“You don’t just make a more than 10% rounding error,” he said.\nDan Becker, director of the Safe Climate Transport Campaign for the environmental group Center for Biological Diversity, said the violations by GM “show why automakers can’t be trusted to protect our air and health, and why we need strong pollution rules. Supreme Court, take notice!”\nIn similar pollution cases in the past, automakers have been fined under the Clean Air Act for such violations, and the Justice Department normally gets involved, Cooke said. \n\n\t\t\t\t\tMorning Report and Evening Update: Your source for today's top stories\t\t\t\t\n\n\n\n\t\t\t\t\t\t\tPlease provide a valid email address.\t\t\t\t\t\t\n\n\n\t\t\t\t\tBy clicking above you agree to the \t\t\t\t\tTerms of Use\n\t\t\t\t\t and \t\t\t\t\tPrivacy Policy.\n\t\t\t\t\n\n\t\t\t\t\tNever miss a story.\t\t\t\t\nHyundai and Kia, for instance, faced Justice Department action in a similar case.\nThe Justice Department declined to comment, and GM said the settlement resolves all government claims.\nCooke said it’s possible that GM owners could sue the company because they are getting lower gas mileage than advertised.\nIn 2014, Hyundai and Kia entered into a settlement in which they had to pay a $100 million civil penalty to end a two year investigation into overstated gas mileage on window stickers of 1.2 million vehicles.\nThe affiliated Korean automakers denied allegations that they violated the law. \nHyundai blamed the inflated mileage on honest misinterpretation of the EPA’s complex rules governing testing.\nIn 2015, Volkswagen admitted it intentionally rigged nearly half a million cars to defeat U.S. smog tests.\nThe German company admitted that it intentionally installed software programed to “defeat” emissions testing, enabling cars to drive more powerfully on the road while emitting as much as 40 times the legal pollution limit. \nThe scandal cost Volkswagen more than $30 billion in fines and settlements and saw two U.S. executives sent to prison.",
          "value": 9.12,
          "type": "business"
      },
      {
          "title": "Mod Pizza chain could soon be filing for bankruptcy",
          "source": "New York Post",
          "body": "Popular fast-casual pizza chain Mod Pizza could soon be filing for bankruptcy — following in the footsteps of several other well-known US restaurants, according to a new report. \nThe company, which has locations in 28 states, is preparing a potential bankruptcy filing and could enter court protection as soon as next week, sources told Bloomberg Wednesday.\nHowever the situation is fluid and plans could change, the sources, who asked not to be identified to share the insider knowledge, told the publication. \nThe pizza joint known for its made-on-the-spot, customizable personal pizzas has more than 500 locations across the country since opening its first restaurant in Seattle in 2008. \nMod Pizza earned $700 million in system sales by last year and was once one of the country’s fastest-growing restaurant chains and in 2019, planned to operate 1,000 locations across the US within five years — by the current year, according to Restaurant Business. \nInstead, the chain — which named a new CEO in January, replacing cofounder Scott Svenson — closed 26 underperforming locations in April and more appear to have shut their doors since then, the trade publication reported. \nA representative for Mod Pizza didn’t immediately respond when reached by email. \nThe take-out pizzeria is the latest restaurant chain to struggle financially. \nRed Lobster filed for bankruptcy in May and the beloved Mexican chain Rubio’s filed a bankruptcy petition last month. \nMany more chains have shuttered locations all over the US as they try to stay afloat in the current economy. \nAdvertisement",
          "value": 9.12,
          "type": "business"
      },
      {
          "title": "FDA Finally Outlaws Soda Ingredient Banned Around The World",
          "source": "ScienceAlert",
          "body": "This article has been amended to reflect an update on the FDA decision in July 2024.\nAn ingredient once commonly used in citrus-flavored sodas to keep the tangy taste mixed thoroughly through the beverage has finally been banned for good across the US.\nThe FDA has now revoked the registration of a modified vegetable oil known as BVO in the wake of recent toxicology studies that make it difficult to support its ongoing use.\n\"The proposed action is an example of how the agency monitors emerging evidence and, as needed, conducts scientific research to investigate safety related questions, and takes regulatory action when the science does not support the continued safe use of additives in foods,\" James Jones, FDA deputy commissioner for human foods, explained when announcing the proposal.\nBVO, or brominated vegetable oil, has been used as an emulsifying agent since the 1930s to ensure citrus flavoring agents don't float to the top of sodas. Sticking a dozen bromine atoms to a triglyceride creates a dense oil that floats evenly throughout water when mixed with less dense fats.\nYet that's not BVO's only trick. Animal studies have strongly implied the compound can slowly build up in our fat tissues. With bromine's potential ability to prevent iodine from doing its all-important work inside the thyroid, health authorities around the world have been suspicious of the emulsifier's risks for decades.\nIn fact, BVO is already banned in many countries, including India, Japan, and nations of the European Union, and was outlawed in the state of California in October 2022 with legislation due to take effect in 2027.\nYet the FDA has been slow to convince. In the 1950s, the agency regarded the ingredient as generally recognized as safe (GRAS); an official classification afforded items that have either been appropriately tested or – for ingredients in common use prior to 1958 – don't appear to be harmful.\nThat changed the following decade when questions were raised over its possible toxicity, prompting the FDA to overturn its GRAS classification for BVO and temporarily limit its use to relatively small concentrations of no more than 15 parts per million exclusively in citrus-flavored drinks.\nData on the risks posed by even these small amounts of BVO over time hasn't been easy to collect, relying heavily on long-term studies that re-evaluate health effects in a significantly-sized sample of people. Yet the evidence has been slowly mounting.\nA UK study in the 1970s found bromine was building up in human tissues, with animal studies linking high concentrations of BVO with heart and behavioral problems.\nIt's taken time, and a number of further studies, but on the back of more recent animal studies based on relative concentrations of BVO humans are likely to ingest, the FDA is finally convinced there is sufficient evidence to ban its use altogether.\nMost major soda drink companies are fortunately ahead of the game. PepsiCo and Coca-Cola Co. have been phasing the ingredient out of their products over the past decade.\n\"Over the years many beverage makers reformulated their products to replace BVO with an alternative ingredient, and today, few beverages in the US contain BVO,\" said Jones.\nThe ban could be a sign of more things to come, with Jones announcing the agency is reviewing regulations that authorize the use of certain food additives, with a view to automatically prohibit the approval of any food coloring agents found to cause cancer in humans or animals, making for a more nimble bureaucratic process.\nThe final call on the FDA's reclassification of BVO went through a lengthy review process that has now been completed.\nWith suitable alternatives to BVO already being used to make citrus drinks around the world taste tangy down to the very last drop, the ingredient isn't likely to be missed.\nAn earlier version of this article was published in November 2023. ",
          "value": 0,
          "type": "business"
      },
      {
          "title": "The Verge’s guide to Amazon Prime Day 2024",
          "source": "The Verge",
          "body": "Amazon Prime Day 2024 is nearly here. The annual two-day super sale will start on July 16th and run through July 17th, bringing with it a treasure trove of discounts, promos, and exclusive deals for Amazon Prime subscribers. It may not be the only Prime Day event we see this year — Amazon has recently taken to hosting a second shopping event in the fall — but it will likely remain one of the best opportunities of the year to score discounts on a range of tech outside of Black Friday and Cyber Monday.\nLike in previous years, we’re highlighting the best deals on a variety of Verge-approved gadgets and gizmos, from the latest laptops and OLED TVs to robot vacuums that can leave your hardwood floors as spotless as your living room carpet. We’re also rounding up anti-Prime Day deals from competing retailers, including Walmart and Target, as well as an array of useful tips and tricks for making the most of the 48-hour event.\nThe price cuts are sure to be fleeting, but if you’re quick enough, you may be able to knock a few items off your holiday wish list before the eggnog even begins to arrive.\nYou can beat the Prime Day rush with all-time low prices on streaming devices, TVs, Kindles, Eero routers, and more.\nDo it now to get all the summer deals that Amazon will be offering.\nWith Amazon Prime Day fast approaching, we’re here to let you know which retailers will go the extra mile on your behalf.\nThe two-day sales event will feature sharp discounts on thousands of products, including Verge-recommended tech.\nAmazon Prime Day is nearly here, and if you want the deals to come to you, we’ve put together a few resources to help.\nNon-Prime members, meanwhile, can save on the latest Philips Hue light strip, Nothing earbuds, and plenty of cheap accessories.\nThe Verge is a vox media network\n© 2024 Vox Media, LLC. All Rights Reserved",
          "value": -4.75,
          "type": "business"
      },
      {
          "title": "Why Nano Dimension Stock Soared Today",
          "source": "The Motley Fool",
          "body": "Before the market opened this morning, Nano Dimension published preliminary second-quarter results that came in ahead of Wall Street's expectations. The 3D-printing specialist also announced it is poised to acquire another player in the additive manufacturing space. \n\n Nano Dimension's preliminary Q2 report shows sequential growth\n\n With its preliminary Q2 earnings release, Nano Dimension reported unaudited revenue of $14.8 million for the period. While the figure came in just slightly above the $14.74 million in sales it posted in Q2 2023, it represented an 11% sequential increase from its sales in this year's first quarter. The sequential sales uptick suggests Nano has either landed a new customer or another significant purchase from an existing client, and investors are bullish on the news. \n\n Nano Dimension has secured flexible terms for its new acquisition\n\n In conjunction with its preliminary Q2 release, Nano Dimension also announced it is poised to acquire Desktop Metal in an all-cash transaction deal valued at as much as $5.50 per share -- or $183 million. If the deal were to go through at the valuation level, it would represent a 27.3% premium paid based on Desktop Metal's previous closing price. But it looks like the pending transaction has favorable leeway baked in for Nano Dimension. \n\n As per Nano Dimension's recent announcements, it could wind up paying as little as $4.07 per share, or $135 million, in the event that closing costs are higher than anticipated or the completion of the deal extends into 2025. Nano Dimension would still have to cover additional costs related to the closing of the deal and credit extended to Desktop Metal, but the terms appear to provide beneficial flexibility in relation to expenses and completion timing. \n\n Should you invest $1,000 in Nano Dimension right now? \n\n Before you buy stock in Nano Dimension, consider this: \n\n The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nano Dimension wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. \n\n Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $786,046!*",
          "value": 0,
          "type": "business"
      },
      {
          "title": "US political uncertainty crashes central bank retreat in Portugal",
          "source": "POLITICO",
          "body": "SINTRA, Portugal — When Europe’s most powerful technocrats gathered this week at a secluded mountain resort near Lisbon to discuss their deepest concerns, you'd have expected them to focus on the election in nearby France. \n\n But instead their gaze was fixed on developments across the Atlantic, where uncertainty over the direction of the world’s largest economy has been growing since U.S. President Joe Biden’s poor showing at a debate last week against Republican rival Donald Trump. \n\n “I think everybody in Europe is watching the U.S. elections,” one participant said. “Concern about France would be related to the high cost of borrowing — [whereas] concern about Donald Trump is concern about the fragmentation of the global economy.” \n\n The person, as with every Sintra invitee interviewed for this story, asked to remain anonymous on the grounds that central bankers — and other financial policymakers —  have a tradition of independence that bars them from commenting on national politics. Even as political turmoil intrudes ever more on their turf. \n\n Since Sunday's first round of voting in the French general election, much of the European establishment has been fixating on the prospect of political breakdown in the country. A final election round on July 7 may yet reward the far right with control of parliament for the first time in the country’s postwar history. \n\n But at this year’s ECB Forum on Central Banking — an annual elite gathering near the town of Sintra featuring top central bankers from four continents — the prospect of French financial turmoil drew a collective “meh.” \n\n In private discussions — including over veal rump with rosemary, seabass and creamy salmon — mention of France elicited at most a shrug, with some policymakers even confessing they weren't following the situation that closely. \n\n One official on the ECB’s Governing Council dismissed the threat out of hand, telling POLITICO that the leadership of Marine Le Pen's far-right National Rally (RN) would be moderated by power — just as Italian PM Giorgia Meloni has been so far. \n\n “If something disorderly happens, we would do as necessary,  but [currently] it doesn't look to be of extreme and major concern,” another Governing Council member told POLITICO. Part of the initial worry for policymakers was that an RN majority, under Le Pen protégé Jordan Bardella, would roll out major new spending plans and thwart President Emmanuel Macron’s efforts to bring down France’s deficit. However, turbulence in French bond markets has faded since Bardella watered down some of his spending proposals, with one participant noting the drama was par for the course in an election period. \n\n “The road to fiscal salvation is going to be bumpy — you will [inevitably] go through phases of dramatization, that’s unavoidable,” the person said. \n\n At the same time, multiple ECB officials suggested to POLITICO that Frankfurt would be ready to deploy its crisis-fighting powers — the so-called Transmission Protection Instrument — should things go south. \n\n Washington worries \n\n Instead, those gathered at the opulent Ritz-Carlton Penha Longa resort were fretting about events across the Atlantic, which — unlike affairs in France — they are powerless to influence. \n\n Among their concerns was that a victory by Trump could see the U.S. abandon Ukraine to its fate while burdening Europe — already suffering from chronic low growth — with the cost of defending the would-be EU member in its ongoing war against Russia. \n\n It's still not clear that Trump would turn his back on Kyiv — and that, perhaps, is the worst part. “Trump comes with lots of uncertainty,” said the Governing Council member quoted above. “And you never know if that is going to be good or bad.” \n\n Others worried that Trump’s trade and economic policy, with a fresh dose of tax cuts, would accentuate both the protectionist drift and the fiscal slippage seen in the U.S. over the last four years under Biden. \n\n In a panel discussion Tuesday, Goldman Sachs chief economist Jan Hatzius warned that Trump’s proposed blanket tariff of 10 percent on imported goods — and up to 60 percent on Chinese goods — would ultimately have a bigger impact on Europe, potentially depressing its economic growth by as much as 1 percent, as opposed to 0.5 percent in the U.S. \n\n The U.S. was by far the top destination for European exports last year, taking nearly 20 percent of the total, according to Eurostat. \n\n “The key is trade policy uncertainty,” Hatzius said. “We consistently find that the euro area is more susceptible than the U.S.” \n\n But, as much of the academic discussion at the Sintra gathering made clear, the U.S. election is only one of many variables that might further convulse the global economy. \n\n “People are broadly concerned that the world as we know it is going away,” another attendee said. “At the same time, what cannot last forever cannot last forever.” \n\n Weighing on the gathering was the risk that an international trade war pitting Europe and the U.S. against China will be difficult for Europe to win, especially if the two sides of the Atlantic are not aligned in their approaches. As the participant quoted above told POLITICO, Europe is far more dependent on Chinese exports than is the U.S., and has already suffered economic damage after tentatively joining the U.S.-led tit-for-tat over Chinese-made electric vehicles. \n\n The calculus, the participant said, is that waging a trade war at the behest of the U.S. is a reasonable price to pay to keep the U.S. onside in the proxy war against Russia. But should a Trump administration leave Europe high and dry as it withdraws from Europe to focus on its own economic health, that bargain could be exposed as catastrophically self-defeating.",
          "value": -5.76,
          "type": "business"
      },
      {
          "title": "Driving on the Fourth of July? What you can expect to pay for gas",
          "source": "Fox Business",
          "body": "Sen. Kevin Cramer, R-N.D., breaks down President Biden's energy push on 'Kudlow.'\nDrivers filling up their cars on the Fourth of July will encounter the \"lowest holiday price\" for a gallon of gas in three years, according to a Tuesday projection from GasBuddy.\nAcross the country, they will have to pay $3.49 on average for a gallon of gas on the Fourth of July, which falls on Thursday this year, the company forecasted.\n\"For those hitting the road to celebrate Independence Day, gas prices have seen modest recent fluctuations, but most states are seeing prices near or even well below where they were a year ago,\" GasBuddy Head of Petroleum Analysis Patrick De Haan said.\nA gas station in Falls Church, Virginia, in October 2022. (Reuters/Kevin Lamarque / Reuters Photos)\nThis year’s Fourth of July forecast would represent a one-cent price drop from 2023 and an over $1.30 decline compared to the year before that, per GasBuddy.\nBEST CITIES IN THE US TO CELEBRATE THE 4TH OF JULY\nAs of late Wednesday afternoon, a regular gallon of gas averaged around $3.507 nationwide, according to the company. \n\"While the first half of the summer has been relatively smooth sailing, the road ahead may be bumpy,\" De Haan also said Tuesday. \"Activity in the tropics has increased, and projections remain for a very busy hurricane season. Even after the holiday fireworks are over, we’ll be watching for any potential fireworks at the pump that could be brought on by hurricanes disrupting refineries.\"\nA gas pump fills a vehicle at a Chevron gas station in Houston on Dec. 5, 2022. (Brandon Bell/Getty Images / Getty Images)\nThe Atlantic hurricane season kicked off June 1, with its first hurricane, Beryl, currently moving through the Caribbean, according to the National Hurricane Center.\nCLICK HERE TO READ MORE ON FOX BUSINESS\nWhile this year’s Fourth of July gas prices may not be expected to be as painful as the last couple of years, that isn’t slated to be the case for Thursday’s barbecues.\nWalletHub announced the top cities to celebrate the 4th of July this year. (iStock / iStock)\nThe American Farm Bureau said late last month a 10-person Fourth of July cookout will carry a $77.22 price tag this year. That figure, which equates to $7.12 per person, will mark a 5% year-over-year increase. \nHOW IT STARTED… HOW IT'S GOING: JULY 4 BBQ COSTS FLARE UP UNDER BIDEN\nOf the 12 popular cookout food items the American Farm Bureau looked at, only two — chicken and homemade potato salad — will be cheaper compared to last year, according to its analysis.\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\nWe've added you to our mailing list.\nBy clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\n           \n\n            Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset.\n            Powered and implemented by FactSet Digital Solutions. \n            Legal Statement.\n        \nThis material may not be published, broadcast, rewritten, or redistributed. ©2024 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy",
          "value": 9.43,
          "type": "business"
      },
      {
          "title": "Americans swat away high fuel prices and gear up for record July 4 travels",
          "source": "Al Jazeera",
          "body": "Record 71 million people are expected to travel on upcoming long weekend, a growth trajectory similar to pre-pandemic.\nHigh fuel costs and the threat of a hurricane are not expected to dampen Americans’ desire to hit the road, with vacationers preparing for record travel to kick off Fourth of July holiday festivities.\nMotorist group AAA expects a record of almost 71 million people to travel around the United States Independence Day holiday, growth similar to a pre-pandemic trajectory.\nSome 60 million people will drive with nearly 6 million flying to their destinations, while approximately 4.6 million people will take buses, trains or cruises during the holiday period, according to AAA’s forecast.\n“We’ve never seen numbers like this,” AAA spokesperson Andrew Gross said, “2024’s travel seems to be what 2020 would have been, had it not been for the pandemic.”\nTravel during the summer months in the US will be closely watched from multiple fronts this year, as it could offer central bank officials and policymakers an important measure of consumer sentiment in an election year.\nInflation was unchanged in May even as consumer spending rose, boosting hopes that the US Federal Reserve might be able to control inflation while avoiding a recession.\nPetrol prices have eased over the past few months, with the national average price for a gallon of motor fuel at $3.50 ($0.92 a litre) on Tuesday, a three-cent decline from last year. Domestic airfare is 2 percent cheaper than last year, with an average domestic round trip costing $800, according to AAA booking data.\nDespite recent declines, fuel prices remain well above historical levels. The average price for a gallon of petrol was $2.74 ($0.72 a litre) during the July Fourth week in 2019, and the weekly average price from 2015 through 2019 was less than $2.50 a gallon (0.66 a litre), according to US Energy Information Administration data.\nStill, vacationers’ travel plans are largely unaffected by higher prices this year, according to a survey of more than 1,000 people by auto retail group American Trucks.\nFour-week average US petrol demand hit a one-year high of 9.2 million barrels per day (bpd) last week as retailers stockpiled before the holiday, EIA data showed on Wednesday. Four-week average jet fuel demand was at 1.7 million bpd, identical to a seven-month high hit earlier in June.\n“What we have noticed is that it’s more about the rate of change than the price itself that affects the psyche of consumers,” said John LaForge, head of real asset strategy at Wells Fargo Investment Institute.\nSince the price of petrol has not moved dramatically higher or lower in the past six months, consumer psyche is largely unaffected by it, LaForge said.\nFor now, US vacation travel is unlikely to be affected by Hurricane Beryl, which has brought devastation to some Caribbean Islands since Monday, but is expected to weaken considerably as it reaches Mexico’s Yucatan Peninsula by Thursday night.\nUS fuel inventories are also better stocked than they have been in recent years, providing motorists a buffer from sudden price shocks in case the hurricane disrupts refining operations.\n“Americans are optimistic and wanting to travel, there’s no denying it,” GasBuddy analyst Patrick De Haan said.\n\n\n\n\n\n\n\n\n\nFollow Al Jazeera English:",
          "value": -6.63,
          "type": "business"
      },
      {
          "title": "Delta flight diverts to New York after passengers are served spoiled food",
          "source": "AP News",
          "body": "A Delta Air Lines plane leaves the gate July 12, 2021, at Logan International Airport in Boston. A Delta flight from Detroit to Amsterdam was diverted to New York’s Kennedy Airport, Wednesday, July 3, 2024, after passengers were served spoiled food, airline officials said. (AP Photo/Michael Dwyer, File)\nFILE - A Delta Air Line plane flies arrives at Salt Lake City International Airport, June 30, 2022, in Salt Lake City. A Delta flight from Detroit to Amsterdam was diverted to New York’s Kennedy Airport, Wednesday, July 3, 2024, after passengers were served spoiled food, airline officials said. (AP Photo/Rick Bowmer), File)\n\n\n\n\nNEW YORK (AP) — A Delta flight from Detroit to Amsterdam was diverted to New York’s Kennedy Airport on Wednesday after passengers were served spoiled food, airline officials said.\nThe redeye flight took off from Detroit around 11 p.m. Tuesday and landed in New York at 4 a.m. “after reports that a portion of the Main Cabin in-flight meal service were spoiled,” a Delta spokesperson said in a statement. \nA spokesperson for the Port Authority of New York and New Jersey, which runs the airport, said 14 of the plane’s 277 passengers as well as 10 crew members were treated by medical personnel when the flight landed. None of them required hospitalization.\nIt was not clear how many people in total ate the spoiled food. \nDelta said it would investigate the incident.\n“This is not the service Delta is known for and we sincerely apologize to our customers for the inconvenience and delay in their travels,” the Delta spokesperson said.\nThe Port Authority said passengers were being provided with hotel rooms and that all would be rebooked to continue to their destinations.\nCopyright 2024 The Associated Press. All Rights Reserved.",
          "value": -2.28,
          "type": "business"
      },        {
        "title": "Galaxy Z Flip 6, Fold 6 are world’s first IP48-rated foldables for dust, water resistance",
        "source": "SamMobile",
        "body": "Samsung can't stop the leaks! A week before its next Galaxy Unpacked launch event, Galaxy Z Flip 6 and Galaxy Z Fold 6 specifications have leaked in detail. And this leak reveals some exciting things about the Galaxy Z Fold 6's screen and the Galaxy Z Flip 6's battery and performance.\n\nThere is also something really exciting about the durability of both phones.\n\nLegendary leakster Evan Blass (a.k.a @evleaks) has leaked marketing images of the Galaxy Z Flip 6 and the Galaxy Z Fold 6 via his Substack newsletter. Leaked images reveal that both phones use the Armor Aluminum material for their frame and the Gorilla Glass Victus 2 protection for the cover screen. It was expected that Samsung would use a titanium frame for the Galaxy Z Fold 6, but that doesn't appear to be the case.\n\nMore importantly, the Galaxy Z Flip 6 and the Galaxy Z Fold 6 are IP48 rated for dust and water resistance. While not as good as the IP68 rating for high-end bar-style phones, it is still a major improvement from the IPX8 rating usually seen on foldable phones.\n\nThe Galaxy Z Flip 6 uses the same sized displays—a 3.4-inch cover screen and a 6.7-inch foldable screen—as its predecessor. The 3.4-inch OLED screen keeps the 720 x 748 pixels resolution and runs at 60Hz, while the 6.7-inch Dynamic AMOLED 2x screen has Full HD+ resolution and a 120Hz variable refresh rate.\n\nThe Galaxy Z Fold 6 has a 6.3-inch Dynamic AMOLED 2x screen with HD+ resolution and a 7.6-inch Dynamic AMOLED 2x screen with QXGA+ resolution. Both screens have a 120Hz variable refresh rate and a peak brightness of up to 2,600 nits. That's matching the screens on the Galaxy S24 Ultra.\n\nBoth phones use the Snapdragon 8 Gen 3 For Galaxy processor with 12GB RAM and 256GB/512GB storage. The Galaxy Z Fold 6 might also be available in a 1TB storage variant. Both phones run Android 14-based One UI 6.1.1 software. The Galaxy Z Flip 6 has a vapor chamber system for more efficient cooling, which is the first in a Galaxy Z Flip series phone.\n\nBoth phones also have Galaxy AI, so you can use features like Circle to Search, Interpreter Mode, and Notes Summarization. But we can't spot any new Galaxy AI features that were rumored earlier. The Chat Assist feature seems to have improved and optimized for the Galaxy Z Flip 6's cover screen, making it easier to reply to messages through context-sensitive replies suggested by Galaxy AI.\n\n\n\nThe Galaxy Z Flip 6 has a 50MP primary camera, a 12MP ultrawide camera, and a 10MP selfie camera. It can record 4K 60fps videos using all its cameras.\n\nThe Galaxy Z Fold 6 has a 50MP primary rear camera, a 12MP ultrawide camera, a 10MP telephoto camera (3x optical zoom), a 10MP front-facing camera on the cover screen, and a 4MP front-facing camera on the inner screen. It can record 4K 60fps videos using all its cameras, just like the Galaxy Z Flip 6, but it can also record 8K 30fps videos and 4K 120fps slow-motion videos using the primary camera.\n\nDespite its 4,000mAh battery, an upgrade over the Galaxy Z Flip 5's 3,700mAh battery, the Galaxy Z Flip 6 is thinner than its predecessor. It measures 85.1 × 71.9 × 14.9mm and weighs 187g (same as Z Flip 5).\n\nThe Galaxy Z Fold 6 measures 155.5 x 152.6 x 5.6mm when unfolded and 85.1 x 71.9 x 14.9mm when closed. It weighs 239g, 14g lighter than the Galaxy Z Fold 5. Similar to its predecessor, it has a 4,400mAh battery. The complete specifications of both phones are posted below.\n\nBoth phones have a side-mounted fingerprint reader, stereo speakers, dual-SIM card slot, GPS, 5G (sub-6GHz), Wi-Fi 6E, Bluetooth 5.3, NFC, and a USB 3.2 Gen 1 Type-C port. Only the Galaxy Z Fold 6 has Samsung DeX, though.\n\nThe story continues after our video below.\n\n\n\nSamsung claims that the Galaxy Z Flip 6 lasts up to 20 hours of web browsing on Wi-Fi (19 hours on LTE), 23 hours of video playback, and 68 hours of wireless audio playback. These figures are noticeably better than the Galaxy Z Flip 5.\n\nThe Galaxy Z Fold 6 is claimed to last up to 18 hours while browsing the web, 23 hours during video playback, and 77 hours during wireless audio playback. These figures are only slightly better than the Galaxy Z Fold 6. Charging speeds haven't been revealed in these images. \nYou might also like\nSamsung introduced Galaxy AI with the Galaxy S24. It offers a plethora of AI-powered tools, including the ones to summarize webpages, translate text and audio from one language to another in real-time, and edit photos, which can come in very handy in day-to-day usage. When Samsung introduced Galaxy AI, the company said that people would […]\nSamsung collaborated with popular K-pop music band BTS for a few years to promote its high-end phones. However, the boy band went on a hiatus in 2023, so it looks like Samsung is collaborating with another K-pop band. The company mentioned a collaboration with TXT before its next Galaxy Unpacked event. Samsung to collab with […]\nEarlier today, detailed Galaxy Z Flip 6 specifications were leaked. Now, some more features of the upcoming foldable phone have been leaked, revealing a new feature that uses the cover screen intelligently during language translation. One UI 6.1.1 uses Galaxy Z Flip 6's cover screen intelligently for language translation Thanks to the marketing images of the […]\nWe're exactly one week away from Samsung's big launch event of the year, where the company will introduce a wide range of sequels, new ideas, and even a brand-new device category. There's a lot of hype around Galaxy Unpacked 2024, especially given its location and how the event almost coincides with the Paris 2024 Olympics. […]\nLess than a week remains before Samsung announces the Galaxy Z Flip 6 and the Galaxy Z Fold 6. As is always the case with Samsung's unannounced devices, almost all the features and specs of the upcoming foldables have leaked. However, some newly leaked Galaxy Z Flip 6 images show how Samsung is planning to […]\nSamsung might have a pleasant surprise in store for Galaxy Z Fold 6 and Z Flip 6 buyers, as a new report claims that the company is in a generous mood and plans on giving away one of its best wearables. According to this new nugget of information shared by @rquandt on X, Samsung intends […]\nReviews\nBest picks\nDevices\nSamsung Galaxy F55\nSM-E556B\nSamsung Galaxy M55\nSM-M556B\nSamsung Galaxy M15\nSM-M156B\nSamsung Galaxy C55\nSM-C5560\nSamsung Galaxy A55\nSM-A556E\nSamsung Galaxy A35\nSM-A356E\nSamsung Galaxy S24\nSM-S921B\nSamsung Galaxy S24 Plus\nSM-S926U\nOpinions\nNotebook\nTV\nSocial media\n© 2024 SamMobile\nWe'd like to show you notifications for the latest important news and updates",
        "value": 0,
        "type": "technology"
    },
    {
        "title": "Zenless Zone Zero Tier List - Best Characters Ranked",
        "source": "GameSpot",
        "body": "Zenless Zone Zero boasts 17 characters for its version 1.0 launch period. Make no mistake: it will be extremely expensive to obtain all of them. That's why we believe the vast majority of players will only focus on a select few. As such, it's important to consider the ideal options for your squad. Here are the best characters in our Zenless Zone Zero tier list.\nOur Zenless Zone Zero tier list is divided into four ranks: S-tier, A-tier, B-tier, and C-tier. We also considered several factors, such as:\nNicole is one of the free characters you can get--call her default agent along with Anby and Billy. What makes her one of the best characters in Zenless Zone Zero is that she uses the Ether element, which inflicts corruption and deals extra ether damage. The only other Ether-based user is Zhu Yuan, and she's a 5-star with her own limited-time banner that's available during the second half of the version 1.0 phase.\nHer kit is further bolstered by her Stuffed Sugarcoated Bullet EX special and Ether Grenade ultimate, both of which create gravitational fields that pull in enemies toward the center. If you've played Genshin Impact then think of Nicole's gravitational fields as akin to Venti's windy torrent pulls, albeit with smaller area-of-effect (AoE) coverage. In spite of this, she becomes invaluable since she can group enemies together, allowing teammates to bombard them with devastating abilities.\nThe limited-time banner for the first half of the version 1.0 phase has Ellen up for grabs. You might be enticed to pull for her, and with good reason as she's at the top of our Zenless Zone Zero tier list.\nEllen combines fast and fluid movement, allowing her to avoid blows from hostiles with ease, as well as rapid attack sequences that hit multiple times. This shark-tailed lady even uses the Ice element, which can cause freeze, shatter, and frostbite. Let's just say that freezing your opponents in place is like triggering an extra stun effect.\nWe all know cats are awesome, and cat person Nekomiya certainly proves this fact. Her attack animations are so fast that you'd think everyone else is as slow as turtles. Her combo sequences are a sight to behold, allowing her to zip across the screen to rip apart targets and avoid nasty hits. Likewise, the fact that Physical damage also causes opponents to flinch (i.e. increased daze build-up) turns her into a Stun-type agent in her own right. While she can be hard to control at first (the only downside we've seen), almost all other characters pale in comparison to her overall output.\nAs of the time of this writing, Ben Bigger is the only Defense-type agent in the game. This makes him unique in his own way, though it can also cause hassles when trying to gear him up. There are items only meant for him, but they're unlikely to be equipped by other party members.\nIn spite of this, the burly bear is an invaluable part of any squad that he's part of. His Guardian core passive grants 40% of his DEF as bonus ATK, and it allows for his Cashflow Counter EX special to grant shielding to his allies. Speaking of Ben's EX special, activating it blocks a ton of damage and unleashes a brutal counter, making him an obvious pick when dealing with late-game encounters. Oh, and you can get him for free, too.\nBilly joins you alongside Nicole and Anby very early in the campaign. Similar to Nekomiya, he deals Physical damage as an Attack-type character. The key difference is that he's ranged DPS with a playstyle that's hilariously easy to get used to.\nSpamming the attack button causes Billy to happily fire his dual pistols, hitting foes around him. Yes, this means room-wide coverage and mob-clearing with barely any effort. This is further boosted by his Steady Shot core passive, where he gains +25% damage while in his Crouching Shot stance (i.e. just repeatedly press the attack button), though you need to avoid moving or getting knocked back.\nBoth Billy and Rina are exceptional ranged DPS agents. While Billy can shoot everyone around him, Rina focuses on smaller groups of targets, and she's got ridiculous range to boot.\nThe Electric element inflicts shock, which can cause further damage or interruption if you attack a debilitated foe. Both her Quadruple Meter Gavotte EX special and Code of Conduct chain attack see her Bangboo dolls creating electrical fields with a decent AoE radius, enough to whittle down packs of enemies as she floats around. Meanwhile, her Mini Destruction Partner core passive ensures that penetration (and thus damage dealt) is increased for your squad.\nAlthough Rina and Grace are from different factions, you can ensure that their respective additional perks are activated since they're both Electric-based agents. In Grace's case, her Pre-Driven Needle core passive provides a buff that causes high Electric anomaly build-up, while her Tech Support perk boosts shock damage taken by a target. She's also got grenades that deal further Electric damage. Make no mistake: a Rina and Grace duo is ideal for those who want an Electric-focused team.\nLycaon the wolf man has quick attack combos that deal Physical and Ice damage. His other abilities primarily make use of the Ice element, too, which can inflict the freeze, shatter, and frostbite status. Given that he's a Stun specialist, the multiple hits from his punches and kicks can incapacitate his targets.\nThe downside is that he's not that viable in non-Ice comps. He does, however, excel when in a team with Ellen and Soukaku, a pure-Ice comp that reliably freezes hostiles.\nZhu Yuan is one of the best characters in Zenless Zone Zero, and she becomes available in her own limited-time banner during the second half of version 1.0. Her combo sequence, a flurry of martial arts combined with pistol shots, deals both Physical and Ether damage. Her amazing attack speed is further complemented by the Special Ops Ammunition core passive, which grants bonus damage especially against stunned targets. Likewise, there's the Tactical Coordination additional perk, which provides a massive +30% crit rate after you use her EX special, chain attack, or ultimate.\nThe only reason why we couldn't place her in the S-tier category is because there's currently no other character from the New Eridu Public Security faction. As such, maximizing her potential means that you should always have Nicole in your squad. Well, that, and we recommend Ellen as the 1.0 gacha pull (for those who prefer only one agent from a limited-time banner).\nSoukaku holds the unfortunate distinction of being the worst Ice-based character right now, though this is mostly because Ellen and Lycaon are quite impressive already. The main drawback, outside of being the only HSOS6 member right now, is that her attack animations are significantly slower compared the two aforementioned Ice characters.\nNevertheless, her Rally/Fly the Flag special provides a massive ATK boost, which can be passed to her allies by way of quick assists or chain attacks. Her Group Set Meal additional perk is useful for Ice-focused squads, though Rally the Flag is great for any team comp.\nThere's something strange about Koleda's playstyle: she's a Stun specialist and her blows deal extra daze build-up, but her animations are slower compared to her counterparts. Thankfully, both her Boiling Furnace EX special and Hammerquake ultimate deal tons of Fire damage.\nOn her own, she might disappoint you at first. However, once Ben Bigger is part of your roster, you can make use of their unique combined assists and ultimates. The reason we've dropped her down a couple of notches is that Ben is viable regardless of the team comp, whereas Koleda needs Ben to improve her viability.\nAt this point in our Zenless Zone Zero tier list, you might be wondering if the characters here are terrible. Well, no, they're not. In fact, Soldier 11 is quite decent: easy Fire application via her attacks and specials, a powerful ultimate ability, and increased Fire damage through her additional perk.\nThe problem is that she's currently the only agent from Obol Squad, so you'll miss out on her extra perk unless you bring another Fire-based character with you. That means getting Ben (great), Koleda (great if she's with Ben), or Lucy (so-so). The Ben and Koleda duo primarily focuses on the unique combos of those two, which leaves Soldier 11 at an odd spot.\nLucy has a minion-based playstyle with abilities spawn Guard Boars. These inherit her ATK and impact stats, as well as crit rate and crit damage if her additional perk is active. These critters independently attack your foes even while she's not the active character (i.e. off-field). Sadly, AI pathing is a bit wonky, and the quick movement of your characters leads to situations where the Guard Boars themselves don't even reach opposing mobs. The good news is that she does have abilities where she can just toss and smash them straight into foes.\nNote that her Cheer On! buff affects the ATK of Lucy's allies and Bangboo (the increase is dependent on a percentage of her own ATK). However, we've noticed that the boosted effect is lower and the duration is shorter compared to Soukaku's Fly the Flag.\nIf our Zenless Zone Zero best characters guide was solely for the free-to-play agents, then you can be sure that we'd rank Anby highly. But we have to consider all characters in the version 1.0 phase, causing Anby to drop several spots.\nThe extra daze application from her Fluctuating Voltage core passive requires you to do a Basic Attack: Thunderbolt, special attack, or EX special after the third hit of her regular attack sequence. The special attack and EX special are self-explanatory, but her Thunderbolt is triggered after a delayed button press or by holding down the attack button after you hear a ping sound effect. With combat being a bit too spammy and frenetic, you can end up missing your queue completely.\nWith no shortage of agents that have rapid animations and multiple hits, the very average Anby gets outclassed by other members of your roster.\nTo be clear, Corin has the potential to be one of the best characters in Zenless Zone Zero. This is primarily due to dozens of hits from her chainsaw weapon and her ability to lower a target's Physical resistance. The problem is that this is only activated upon reaching Agent Focus/Cinema rank 2--i.e. Constellation 2, C2, or getting two more duplicates of her.\nBy default, you have to contend with slower sequences, and the fact that she has to remain on the field for prolonged periods to rev up her chainsaw. Worse, other Physical-type agents (i.e. Nekomiya and Billy) are significantly better in comparison right from the get-go.\nWe tried hard to make Anton work during our playthrough, but he just wasn't cutting it. An Electric-type Attack-focused character requires him to stay on the field longer to deal damage while in Burst Mode. The issue is that the Grace-plus-Rina setup has you just alternating between the two (and it's pretty effective already), with barely any time for Anton to showcase his skills. It's certainly disappointing to see the main DPS get outshined by the Support and Anomaly classes.\nRounding out the pack is Piper who, just like Lucy, is also a member of the Sons of Calydon faction. We did test her capabilities in battle, but we found her sorely lacking in several departments. Firstly, her DPS throughput isn't as reliable compared to Nekomiya's or Billy's--you'd have to use her EX special or ultimate to regain a stacking buff. In the same vein, her attack animations are relatively slow, made worse by the notion that she has to stay on the field for longer than necessary. Even Corin at C2 or C4 is a more viable option for a Physical-focused team.\n\nThat does it for our Zenless Zone Zero tier list and best characters guide. We hope that our extensive testing gives you an idea as to which agents are worth it in the long run. While these are our findings, it's still a given that you should try out different team comps that might work well for you. For those who are just starting the campaign in New Eridu, we recommend checking out our beginner's guide and free-to-play agents guide.\n",
        "value": 0,
        "type": "technology"
    },
    {
        "title": "‘Amazing’: SF founder’s underground Gen Z app boots TikTok, Temu off download charts",
        "source": "The San Francisco Standard",
        "body": "\n“I am no longer a one-hit wonder,” tweeted Tiffany Zhong, on the morning of July 3. \nZhong, the 27-year-old founder of noplace (yes, the name is all lowercase), a MySpace-styled social media app for Gen Z, posted a screenshot of the Apple app store, next to a selfie of herself screaming. Noplace ranked number one for free iPhone apps.\n“[It’s] an amazing feeling,” she told The Standard. \n“Take that, Temu,” tweeted Alexis Ohanian, the co-founder of Reddit, in reply to Zhong’s post. “Such a vibe. Congrats.” Noplace’s release knocked the Chinese shopping app into second place, followed by social media giants Threads, TikTok, and Google. (Ohanian co-hosted the “Probably Nothing” podcast with Zhong a few years back).\nladies and gentlemen, after a one letter hiatus, i am no longer a one-hit wonderintroducing noplace — #1 in the app store pic.twitter.com/GDwXgelaWv\nNoplace has been around since April, but was previously an invite-only beta. It’s one of the growing number of startups that are launching new social media platforms, ostensibly to address the loneliness epidemic. 79% of Gen Z (ie, people born roughly between 1995 and 2009) report high levels of isolation, according to  to a Cigna research survey, with 42% of people aged 18-34 reporting they “always feel left out.”\nOf course, turning to another social media app to solve this problem may seem contradictory, seeing that social media usage has been linked to increased rates of depression. But Zhong believes it’s not the platform per se that’s the problem, but the way people interact with it.\nZhong, who splits her time between San Francisco and Tokyo, has been immersed in startupland for some time. In 2017 she released Zebra IQ, a platform for Gen Z people to give brands feedback, and also founded Pineapple Capital, an early-stage investment firm.\nThe noplace app has a distinctly early 2000’s vibe, with the design team heavily leaning into teens and twentysomethings’ Y2K now-stalgia. The MySpace comparisons begin with Zhong: her LinkedIn profile lists her as the founder of “noplace, fka (formerly known as) nospace.”\nThe design is clean, cheeky—the default text in a user’s “about me” section, says “i am cringe, but i am free”—and the intentional use of lowercase i’s give it a playful feel. \nThe sign-up process for noplace was straightforward; I picked a username, selected some interests—I love that the hobbies section had “sleep” as an option—then uploaded a profile picture and tried to connect with some friends. Clearly, I’m not the target audience (I’m peak millennial) because I couldn’t find anyone I already know—but some potential friends were suggested to me.  I could also interact with users en masse in the “everyone” feed, a stream of consciousness that spanned what musicians people loved, their hobbies, and various deep-cut Y2K references. Everyone there seemed to be spiritually, if not literally, 19.\n\nIt was interesting to skim the noplace updates, as they felt so natural. “Has anyone else been sitting in their rooms the entire summer?” asked the user uncooked-pizza. “I’m too broke for anything.”\nInstagram and TikTok algorithms have made me used to seeing posts non-chronologically, and only surfacing the most exciting content, where this was intentionally not designed that way: the goal here is for connection, not claps.\nPre-launch, over half a million people were on the waitlist, and today the download volume exceeded expectations.\n“Our dev is updating the mainframe and getting a glass of milk…he hasn’t eaten anything in the last 18 hours,” wrote Zhong in a noplace post.\n“We have gone too viral to function,” tweeted noplace’s X account. \nGiven the surge in interest, for now,  Zhong’s holding off on partying. “We’ve gone super viral a few times now, and it never ceases to be super fun,” she said. “We celebrate by working hard on keeping the app up and making it better and better.”\nZara Stone can be reached at zstone@sfstandard.com",
        "value": -5.68,
        "type": "technology"
    },
    {
        "title": "ChatGPT app for macOS raises privacy concerns for storing conversations in plain text [U: Fixed]",
        "source": "9to5Mac",
        "body": "OpenAI recently launched an official ChatGPT app for macOS, which is also the first ChatGPT app for any desktop platform. While having an app makes the process of talking to the chatbot more seamless, some users have raised privacy concerns. That’s because the app stores all conversations in plain text, which can expose sensitive user data.\nUpdate: After we published our article, OpenAI released an updated ChatGPT app to encrypt chats stored on the Mac. Make sure you update your ChatGPT app to the latest version. You can also read the original article below.\nAs noted by developer Pedro Vieito in a post on Threads, the official ChatGPT app for Mac doesn’t use the standard macOS sandbox system. By looking at the preference and cache files stored by the app, Vieito noticed that all conversations registered in the app are kept saved in plain text, making it easy for anyone to access this data.\nBut what exactly does all this mean and why isn’t the ChatGPT app sandboxed?\nFor those unfamiliar, “sandboxing” is a security control system that essentially runs an app and all its data in an isolated environment. This way, the app can’t access other parts of the system without permission, just as other apps can’t easily read data from a sandboxed app. \nOn iOS, all third-party apps run under a sandbox. But on the Mac, this system was only implemented with OS X Lion in 2011. Years later, with macOS Mojave, Apple added new layers of security so that apps always ask the user’s permission to access data outside their sandbox. \nHowever, while running an app in sandbox makes everything more secure, this system remains optional on macOS as some more complex apps require full disk access. And there are a lot of macOS apps that aren’t sandboxed. However, when it comes to chat apps handling sensitive data, most of them are sandboxed.\nBut what are the implications for users?\nAnyone can find the conversations from the ChatGPT app by going to Library > Application Support > com.openai.chat. And since the conversations are stored outside a sandbox and in plain text, this also means that the conversations can be accessed by other apps, processes, or even malware running on the Mac – all without the user ever knowing.\n9to5Mac was able to confirm that ChatGPT conversations are stored in plain text. We also built a tool to collect data from the ChatGPT app with just a click, and it works without asking for any permission.\nOf course, OpenAI’s privacy policies make it clear that all your conversations with ChatGPT can be collected by the company to improve its language model. That alone is a good reason never to share sensitive data with ChatGPT. But knowing that this data could end up in anyone’s hands makes everything worse.\nWe’d like to believe that OpenAI just made an oversight by not sandboxing the ChatGPT app. But for now, OpenAI has yet to comment on users’ concerns.\nAnd if you’re really concerned about privacy, a good way to keep your data safe on macOS is to only download apps from the Mac App Store or check whether an app downloaded from an external source runs in sandbox.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:\nFilipe Espósito is a Brazilian tech Journalist who started covering Apple news on iHelp BR with some exclusive scoops — including the reveal of the new Apple Watch Series 5 models in titanium and ceramic. He joined 9to5Mac to share even more tech news around the world.",
        "value": 0,
        "type": "technology"
    },
    {
        "title": "OnePlus might be bringing metal unibody phones back, and it looks weird",
        "source": "Android Authority",
        "body": "Affiliate links on Android Authority may earn us a commission. Learn more.\nPublished onJuly 3, 2024\n\nOnePlus just held a big event where it announced a OnePlus Watch 2 variant and the Ace 3 Pro. Despite that, the firm is gearing up to hold yet another event in about two weeks. It’s believed that the star of this show could end up being the Nord 4 and a new leak may have revealed the design.\nThis week, OnePlus officially announced it will be holding a summer launch event on July 16. The showcase will take place in Milan, Italy at 3:00 PM CEST (9:00 AM ET). In addition to the announcement, the company’s Indian X (formerly Twitter) account also released a teaser where liquid metal comes together to form the word “Nord.”\nSo thanks to the teaser, we know that a Nord phone will be the focus of the event. The liquid metal also seems to be hinting at something as well. Maybe a metal unibody?\nA tipster on X who goes by @saaaanjjjuuu has shared an image of what could be the OnePlus Nord 4. This image shows a device with a glass and metal unibody design. It’s possible that this upcoming event could be for the Nord 4, especially considering that the CE4 and Lite have already been announced.\nAlong with the image, the tipster provided a full list of specs. According to the leak, this handset has a 6.74-inch OLED Tianma U8 Plus display with a 1.5K resolution, 120Hz refresh rate, and 2,150 nits peak brightness. The device reportedly runs on a Snapdragon 7 Plus Gen 3 chip, has a 5,500mAh battery with 100W fast charging, and comes with Android 14 out of the box. As for the cameras, there’s a 16MP front lens, 50MP main camera, and 8MP ultra-wide.\nThe leaker shared similar details in a previous leak, however, they added that the price would be ₹31,999 (~$383 USD). That older leak also included a fake-looking image of the phone, so take it with a grain of salt.",
        "value": 0,
        "type": "technology"
    },
    {
        "title": "Best Buy's July 4th Sale Is Stacked With Awesome Tech And Gaming Deals",
        "source": "GameSpot",
        "body": "\nGameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n\nSave on TVs, gaming PCs, laptops, Apple devices, and more.\nBy \n    Brendan Hesse\n   on July 3, 2024 at 11:39AM PDT\nBest Buy's big 4th of July Sale runs through Sunday, July 7. The event drops the prices on tons of items available online and in stores, including 4K TVs, pre-built PCs, gaming accessories, and more. There are even discounts on collectible figures and Lego Sets if you're looking to fill blank spots on your shelves. Hundreds of items are included in Best Buy's 4th of July Sale, so to make things easier, we've combed through all the deals and rounded up our favorites below.\n Asus ROG Ally \n $400 (was $500) \n \nSelect MacBook Air and MacBook Pro laptops are also on sale for up to $500 off. Numerous hardware configurations are available, including M2 and M3 versions, all in multiple color options, so be sure to check the links below for all the discounted models.\n \n \nSpeaking of Apple devices, the price of iPad Air and Pro models are also slashed during Best Buy's sale. Not only can you save up to $600 on iPad Air 10.9-inch models and 11- and 12.9-inch iPad Pros, but you can also pick up the Apple Pencil 2nd Gen for $80 (was $130). We've listed all the discounted iPad models below. All models are unlocked.\n \nBest Buy sales are always a great time to grab a new TV, and this year's July 4th sale has a great selection from a wide range of brands, including Insignia's super-affordable 50-inch 4K smart TV with Amazon Fire TV integration for $190 (was $300), all the way up to high-end options like Samsung's 55-inch QN90C QLED 4K TV. Check the links below for a few more of the many TVs discounted in the sale.\nBest Buy's July 4th sale includes several pre-made gaming PCs from top brands like Asus, iBuyPower, Lenovo, and more. There are options rocking high-end specs like this Alienware desktop with an Intel Core i9 CPU and Nvidia RTX 4080 Super. If you prefer AMD hardware, this configuration from Lenovo includes a Ryzen 7 CPU and Radeon 7600 GPU. The list below covers all of the pre-made desktops that are discounted during the sale. For a decidedly more compact PC, check out the Asus ROG Ally Windows gaming handheld for $400 (was $500).\nIf you grabbed one of those pre-made desktops or want to upgrade your existing gaming PC setup, you can pick up one of several LG PC monitors while they're on sale at Best Buy this week. You can snag a 24-inch 1080p model with 100Hz refresh rate and FreeSync support for just $80 (was $170). If you prefer G-Sync, the 27-inch and 32-inch LG UltraGear LED monitors with QHD resolution, HDR support, and G-Sync compatibility are both $100 off. All four discounted monitors are linked below.\nFor those looking for a new gaming keyboard, you have several to pick from in Best Buy's sale. Most of the discounts are for Corsair keyboards, including the K60 Pro TKL for $80 (down from $100), and the K70 Max mechanical keyboard for $175 (was $230). Razer's Cynosa V2 membrane gaming keyboard is also on sale for $40 (normally $50). Check out a few more in the list below.\nGaming mice are also on sale in Best Buy's July 4th sale, including great models like Logitech's G502 Plus and G Pro X wireless gaming mice. Plenty of other gaming mice are discounted, and you can check a few of the best deals below.\nA few gaming headsets are available at pretty decent discounts in the sale as well. Once again, Corsair and Logitech have some of the best deals, including the Logitech G Pro X-Black for $120 (was $230) and the Corsair HS80 wired headset for $80 (was $100). And if you prefer speakers over headsets, the G2000 2.0 gaming speakers from Edifier are down to $90 (normally $110) during the sale.\nUnsurprisingly, Best Buy's July 4th discounts include a long list of headphones. Some standout deals include the Sennheiser Momentum 4 wireless over-ear headphones for $250 (was $400), the JBL Tune 235NC noise-canceling true wireless earbuds for $60 (down from $100), and the AirPods Max for $450 (normally $550). We've rounded up a few more of the best deals in the list below, but be sure to check Best Buy's online store to see all the headphone deals in the sale.\nOnly a few gaming chairs are part of Best Buy's sale, but the available models cover a wide price range. Those looking for a budget chair can grab Insignia's PC gaming chair for $130 (down from $180), while the X Rocker Evo Elite 4.1 gaming chair with built-in audio is available for $420 (was $500) for those looking to splurge on a premium model.\nLogitech's Pro webcams are also on sale. You can grab the standard Pro model for $60 (was $100) or the 4K version for $150 (normally $500).\nYou can save on plenty of external hard drives and microSD cards at Best Buy, too. You can grab Nintendo editions of SanDisk's microSDXC cards, which start at $29 for the 256GB version (normally $38). While all of SanDisk's cards work on the Nintendo Switch, the Nintendo editions are golden and feature a decal of the Super Mario Power Star. If you need something bigger, the 1TB SanDisk Extreme Plus microSD card is available for just $130 (was $170). If you need a lot of storage space on your PC, you can save big on an 18TB Western Digital desktop drive.\nA smattering of work laptops are also on sale at Best Buy right now. While they won't be able to do high-end gaming, you can still save hundreds of dollars on some solid laptops from Lenovo, Acer, and HP.\nNaturally, most of Best Buy's deals are for electronics, but a small batch of Lego vehicle sets are also available for lower prices than normal. You can snag deluxe kits like the NASA Space Shuttle Discovery for $160 (was $200) or the Technic Mercedes-AMD Performance Model for $176 (down from $216), but there are also smaller sets like the Lego Burger Truck for $16 (was $20). Check out all the Lego sets on sale below.\nA surprising number of collectible statues, plushes, and action figures are included in Best Buy's discounts this week. For example, you can grab randomized Squishmallow plushes based on popular franchises like Sonic the Hedgehog for $12 per figure or and Disney for just $9 per figure (normally $15). You can also grab Mario Kart Hot Wheels, Pokemon figures, anime statues, Among Us plushes, and way more. We've rounded up a few more of our favorite deals below, but be sure to check out Best Buy's listings to see all the discounted collectibles on offer.\nBest Gaming & Tech Deals This Week\nGot a news tip or want to contact us directly? Email news@gamespot.com\nUse your keyboard!\nLog in to comment\n",
        "value": 0,
        "type": "technology"
    },
    {
        "title": "Surprise! This brand new 65-inch LG OLED TV is $900 off ahead of Prime Day",
        "source": "Tom's Guide",
        "body": "\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\nThe perfect deal for the perfect window into the Olympics \nWith Prime Day just around the corner, there’s a lot to get hyped for when it comes to killer deals, but one exciting option has already landed on one of LG’s brand new OLED TVs — perfect for experiencing the upcoming Paris Olympics the right way. \nGet this 65-inch LG B4 OLED TV for just $1,596 at Amazon. That’s a meteoric $903 slashed off the original asking price of $2,499 on this new addition to LG’s 2024 TV lineup. It's one of the best TV deals you can get right now. The LG B4 sports some serious upgrades despite its budget stature, leveraging LG's new a8 AI processor with a 120Hz refresh rate built on a beautiful WOLED panel. \nLG 65\" B4 4K OLED TV: was $2,499 now $1,596 @ Amazon\nReleased just a few weeks prior, the LG B4 OLED comes in at the tail end of LG's 2024 TV lineup. But don't let that fool you, as the B4 proves to be a stellar option with a 120Hz refresh rate and all the gaming features you could ask for. The B4 leverages LG's new a8 processor for serious upscaling and picture performance, ensuring you get the best seat in the house in all things entertainment.\nPrice check: $1,599 @ Best Buy\nLG 48\" B4 4K OLED TV: was $1,499 now $799 @ Best Buy\nWorking with a smaller budget? Best Buy has the 48-inch B4 on sale for $799. That's $700 off and the least-expensive OLED TV you can buy right now. The 48-inch model is a Best Buy exclusive. \nAs \"House of the Dragon\" season 2 breathes fire into living rooms everywhere, and the forthcoming Paris Olympics draws ever-near, it's the perfect time to net a serious upgrade on your home entertainment setup. Lucky for you, this brand new OLED TV from LG is seeing a major discount ahead of Prime Day and July 4th, making it the ideal window into all of your favorite entertainment needs. \nThe LG B4 OLED is an exciting new offering from LG. It comes equipped with a 120Hz refresh rate, supporting both Nvidia G-Sync and AMD FreeSync to get the best of both worlds in terms of screen tearing technologies. It's an easy contender for one of the best gaming TVs of the year and it's easily the OLED TV I'm most excited for. \nIt takes up after last year's LG B3 OLED, which likewise proved to be an exceptional value in an arena that is largely relegated to extremely premium prices. You won't be finding very many OLED options among the best TVs under $1,000, and it's largely due to the production costs and general popularity of OLED screens. \nThe LG B4 OLED also uses all of the best HDR formats, running the gamut of options which include Dolby Vision, HDR10, and HLG. Unlike several newer Samsung displays, the LG B4 OLED will also come equipped with Dolby Atmos so you won't have to pair it up with one of the best soundbars for crystal clear audio. \nAnd maybe this OLED option is a bit out of your price range? There's a slew of alternative TV deals out there in the midst of July 4th and Prime Day, like this LG QNED TV that's just $649. You could even go with the 48-inch LG B4 OLED, which is just $800 right now, saving you $700 in acquiring the cheapest OLED TV on the market currently.\nUpgrade your life with a daily dose of the biggest tech news, lifestyle hacks and our curated analysis. Be the first to know about cutting-edge gadgets and the hottest deals.\nRyan Epps is a Staff Writer under the TV/AV section at Tom's Guide focusing on TVs and projectors. When not researching PHOLEDs and writing about the next major innovation in the projector space, he's consuming random anime from the 90's, playing Dark Souls 3 again, or reading yet another Haruki Murakami novel. \nLG just launched its newest 2024 OLED TV — and it’s completely wireless\nThis new Sony OLED TV is already $600 off ahead of Prime Day\nSamsung just gave older Galaxy Watches a major upgrade — all the new features\nTom's Guide is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. ",
        "value": 0,
        "type": "technology"
    },
    {
        "title": "Nothing’s first CMF phone could be customizable with dial and kickstand add-ons",
        "source": "The Verge",
        "body": "\nNothing plans to reveal the first smartphone from its affordable CMF subbrand on July 8th, but as part of a continuing series of teasers, it’s revealed the CMF Phone 1’s unique customizability, including a dial that can be used to attach accessories and a rear panel that can be easily swapped.\nThe light-up glyphs on the Nothing Phone 1 and Phone 2 won’t make it to this model, but a short video of a rotating dial on the back looks similar to the aluminum alloy dial on the CMF Buds that allows a lanyard to be attached to the earbuds’ charging case.\nToday’s tease seemingly confirms the phone’s dial will at least function in a similar manner to the dial on the CMF Buds to accommodate accessories and can be unscrewed and swapped with optional attachments, including a lanyard mount and a folding kickstand.\nWill it offer additional functionality? Nothing’s teases have been cryptic, but the dial shown is reminiscent of the smart dial on the CMF Neckband Pro headphones, which is used to control volume, playback, and active noise cancellation. \nPreviously, the CMF account had shared images of the back that revealed easily accessible screws and a tiny screwdriver matching the brand’s aesthetic. The teases strongly hinted the device would have an easily removable rear panel, which seems confirmed today in a post featuring images of the panel itself in black, blue, light green, and orange colorways.\nIt’s not known if other companies are making alternate rear panels, but looking closer, it seems as if the device might handle panels adding either a larger battery — similar to a Mophie Juice Pack or the Motorola phones that supported “Moto Mods” a few years ago — or a wallet for holding credit and ID cards.\nNothing also hasn’t revealed if removing the rear panel will provide easier access to the CMF Phone 1’s internals, including its battery, but the feature may focus more on customizing appearance and functionality than improving repairability.\nIn addition to announcing the CMF Phone 1 on July 8th at 5AM ET, the brand will also debut its CMF Buds Pro 2 and Watch Pro 2 at its “Community Update” event.\n / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly.\nThe Verge is a vox media network\n© 2024 Vox Media, LLC. All Rights Reserved",
        "value": -4.75,
        "type": "technology"
    },
    {
        "title": "Elden Ring Players Are Bullying An Old Boss After Mastering The DLC",
        "source": "Kotaku",
        "body": "A lot of Elden Ring players have been struggling with the game’s recently released Shadow of the Erdtree expansion. The DLC, which takes place in an entirely new region, features a hard-as-nails boss gauntlet and a brand new leveling system that has raised the bar for folks, perhaps even a little too high. However, many are beginning to wrap up the expansion and return to the base game, and a lot of them are making a pit stop to flex on a particular boss.\nSpoilers for Elden Ring’s endgame follow.\nAs you approach the end of Elden Ring’s base game, one of the final mandatory fights is against Sir Gideon Ofnir The All-Knowing, an NPC who’s allied with the player character for the vast majority of the game. In your attempt to rise and become the Elden Lord, you naturally come to blows with Gideon, who typically offers advice back at the Roundtable Hold—a gathering place for other Tarnished—even if he is secretly a rat bitch who wants to keep anyone from taking the throne. In short, he has this beating coming. He doesn’t put up a particularly great fight though.\nEven on a first playthrough, Gideon is kind of a chump. His fight is immediately followed by a much more epic and demanding encounter against Godfrey/Horah Loux, making Gideon a sort of aperitif to whet the palette before the series of really demanding boss fights which round out Elden Ring. Gideon is a lanky, gaunt figure, whose appearance only betrays that he’s a nerd who knows a lot of spells to use against you. However, he’s mostly lacking in constitution and, anecdotally, he’s kind of a joke. I guess that’s why Elden Ring players relish flexing on him with their newfound abilities and weapons after wrapping up Shadow of the Erdtree’s exorbitantly more difficult content.\nThere’s a few clips making the rounds online, like a particularly brutal one where a player absolutely skewers Gideon with the Greatsword of Damnation. They more or less follow the same formula: a player saunters up to Gideon, who launches into his spiel before getting almost instantly obliterated. Some clips are a bit longer than others, but for the most part, veterans returning from the Land of Shadow with new armaments and skills are wiping the floor with him and it is extremely funny.\nFolks are having a lot of fun dunking on Gideon with a variety of new weapons. Some are using the elemental perfumes to completely melt the guy in a single hit, while a random TikTok I came across featured a guy using the new hand-to-hand combat to whoop him. Perhaps the funniest of the clips involves a large hammer getting swung around and eventually beamed at the guy’s head, at which point he disintegrates.\nIt’s been great seeing players on top after a few weeks of hearing all about how tough the DLC is. It seems like they’re now taking that pent-up frustration out on Gideon, and evidently there’s precedent for it. Players have apparently been anticipating killing Gideon with new DLC weapons and skills since they were shown off in Shadow of the Erdtree’s first trailer, but even before then, it was customary to kill the guy in the most humiliating way possible. First players developed overpowered builds, but eventually, modders started to decimate Gideon with everything from a gun to Jujutsu Kaisen’s Gojo Satoru.\nIn summation: eat shit, Gideon.",
        "value": 0,
        "type": "technology"
    },
    {
        "title": "Japan breaks Internet speed record by hitting 402 Tbps, so fast you could download Elden Ring in a millisecond",
        "source": "Tom's Guide",
        "body": "\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\nAnd no, you can't get it at home\nInternet speed freaks, this one's for you: Japanese researchers have officially set a new world record for download speeds by hitting 402 Tbps (Terabits per second), breaking the 321 Tbps record they set last year.\nThat's effectively 402,000,000 Mbps (Megabits per second), which makes the 950 Mbps I get at home from my own ISP (thanks Sonic) look like a rounding error. It's so fast that you could download all 18+ GB of Elden Ring—and heck, your entire Steam library to boot—in less time than it took to read this sentence.\nThis is a big deal because it affords us a glimpse of what kind of speeds are possible with our current technology, as the researchers used widely available fiber optic cables to achieve this new record. \nThey also developed new technologies to do it, including \"the world's first O to U-band transmission system capable of DWDM transmission in a commercially available standard optical fiber achieved with custom designed amplifier technology,\" according to a press release \nThe work was conducted by an international team led by researchers from the Photonic Network Laboratory at the National Institute of Information and Communications Technology (NICT) in Tokyo, Japan. \nTogether they worked out how to better amplify data signals to take full advantage of the transmission capabilities of fiber optic cabling, including \"combining 6 doped-fiber amplifier variants with lumped and distributed Raman-amplification to cover all of the low-loss transmission bands of silica fibers\" to achieve a record-breaking 37.6 THz (Terahertz) of bandwidth across 50 km of fiber optic cabling.\n\nI can't tell you what half of those words mean, but I can tell you that there's no way you're going to see anything close to these speeds at home in the near future. As wonderful as it would be to download big games like Baldur's Gate 3 or Call of Duty in under a second, PCGamer points out that even the best gaming PCs simply don't have the hardware to handle that much data that fast. Even if you could somehow cram all that data through your PC's Ethernet port, there's no drive on Earth that could write it that fast.\nUpgrade your life with a daily dose of the biggest tech news, lifestyle hacks and our curated analysis. Be the first to know about cutting-edge gadgets and the hottest deals.\nNo, what matters here is that researchers have developed a new transmission system that can push data through fiber optic cables faster than ever before. While it's all experimental at this point, the findings from this research could play a key role in helping take Internet speeds to the next level.\nAlex Wawro is a lifelong tech and games enthusiast with more than a decade of experience covering both for outlets like Game Developer, Black Hat, and PC World magazine. A lifelong PC builder, he currently serves as a senior editor at Tom's Guide covering all things computing, from laptops and desktops to keyboards and mice. \nASUS announces new routers with our favorite VPN built-in\nPopular VPN provider launches potential Google Docs killer\nMy favorite 49-inch OLED gaming monitor is $600 off in early Prime Day deal\nTom's Guide is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. ",
        "value": 0,
        "type": "technology"
    },
    {
        "title": "How to Photograph Fireworks Like a Pro",
        "source": "PetaPixel",
        "body": "\nWith the Fourth of July quickly approaching in the United States, photographers are getting ready to capture the magic of fireworks shows. If you want to nail some spectacular shots, you’ll want to pay attention to a few key tips. \nPhotographer Will Chaney put together a series of tips that, while some require a Nikon Z series camera, are valuable for any photographer looking to nail perfect fireworks photos. Chaney says that some specific features in Nikon Z series cameras make this easier, but many camera companies offer similar capabilities to what he describes, and the photo techniques he covers work for any camera, making his tips especially valuable to beginners who are looking to nab great shots.\n\nChaney says that outside of a camera and lens, there is one key piece of equipment that photographers will need to ensure they get sharp images: a tripod. \n“The most important function of a tripod is to provide stable support for your camera, ensuring it does not move during a long exposure. To get great fireworks photos, you’ll have your exposure set higher than two seconds which means your camera cannot move or shake while exposing the image,” Chaney says. “In addition to keeping the camera still, this means you won’t have to hold the camera in your hand.”\nIt’s not just stabilization that makes a tripod a must-have, however. \n“Utilizing a tripod also allows for repeatable shots with a consistent foreground and background across multiple firework photos. Catching multiple fireworks with the same foreground and background means that you’ll be able to utilize the lighten blend mode in Photoshop to stack multiple exposures. Also, if you take enough photos during the display, you can combine all of them to create a timelapse video,” he continues. \n“Finally, a tripod allows you to set up your composition before the show starts. This will give you more time when the show starts to finalize your settings before taking a step back and enjoying the show.”\nTripods aren’t strictly necessary, as any stable platform can serve the purpose. That said, it’s harder to keep a camera perfectly still without one, so they’re certainly worth having. \nChaney says that smart photographers will leverage camera settings to get better results. It almost goes without saying these days, but he highly recommends shooting in RAW> \n\n“RAW files will provide you with the most dynamic range in your photo and a better chance of adjusting any mistakes in post-processing — especially when it comes to white balance. The scene will likely have a large dynamic range due to the foreground and background that will end up darker alongside a very bright firework explosion as the subject. The ability to better post-process the high dynamic range will help to bring out shadows to provide more interest in the photo,” Chaney says.\nChaney also recommends turning a feature off: Nikon calls it Long Exposure Noise Reduction, but most camera makers offer a similarly named function. \n“Built within the features of the Nikon Z series cameras is an option to perform Long Exposure Noise Reduction on any photo that is taken. In many cases, this can be a great option to have turned on. However, if you prefer to do noise reduction as part of your post-processing workflow, you’ll want to leave this setting off so that you can control the amount of noise reduction applied and have the full RAW file to work with on your computer,” Chaney says.\n\n“On top of that, it takes time for the camera to perform long exposure noise reduction between each photo taken. For instance, if you take a two-second exposure, it will take approximately the same amount of time to perform the noise reduction. This increases your interval for shots by two seconds in this case which means you will miss catching a lot of fireworks.”\nWhile this might sound counterintuitive to many new photographers, autofocus is actually detrimental to taking good fireworks photos. \n“Being in focus is key to any aspect of photography, but keeping in focus through a long stretch of photos without having to constantly check focus is also important. Additionally, autofocus can be difficult to achieve with a light source that is changing in brightness. For these reasons, I recommend being in manual focus. This allows you to set the focus point once and leave it set without the risk of autofocus resetting the focus distance,” Chaney says.\n\n“To set your camera to manual focus there are two options. Option one is to flip the focus switch on your lens from autofocus to manual focus. That said, not all camera lenses have a focus mode switch. If you’re in that situation, you’ll need to go to the Photo Shooting Menu and find the Focus Mode setting to select Manual Focus.”\nIf you’re using longer exposures, it’s probably a good idea to use the self-timer mode. \n“If you plan on photographing without an automated or wireless control of the camera’s shutter, you’ll want to make sure you use the self-timer. I recommend at least giving a delay of two to five seconds before your photo is captured after hitting the shutter release button. This will help ensure sharp images by allowing any shaking or vibration your finger imposed on the camera to dampen out. This setting will increase your overall interval between shots, but it’s better to have an interval than to have lots of photos that aren’t usable because the camera shook when you pressed the shutter release,” he explains.\n\nAlternatively, a remote cable release is also a great option (and will serve double duty for interval shooting, which is explained below). \nThis is the section most beginner photographers are probably looking to for advice and to summarize, Chaney recommends slow shutter speeds, low ISO, and a mid-level aperture. \n“The key to great fireworks photos comes down to your photo settings. For fireworks photography, you’re going to need to utilize a long exposure to capture the trails of light while utilizing a low ISO and adjusting your aperture to avoid overexposure,” he explains. \n“When shooting fireworks, exposure is the most important setting and will drive the rest of your settings. If your exposure is too short, the fireworks don’t trail. If you go too long, you may capture too many in one set. I find it better to capture a few at a time and layer different shots in Photoshop,” Chaney continues. “A great starting point is two seconds.”\nChaney says that once you’ve settled on a shutter speed, he thinks ISO is arguably the next most important.\n“Due to the brightness of fireworks, you’ll want to utilize a low ISO to avoid blowing out the images. I recommend setting this at 64 or 100, whichever is the lower option offered on your camera. You may be able to go slightly higher, but remember that it’s important to keep a long exposure.”\nAperture is the next setting to consider, and Chaney says that photographers should not be surprised that even if they’re shooting at a low ISO setting, the brightness of the fireworks will still come out overexposed. \n“If you can’t go any lower on your ISO and are still blowing out your highlights, this will be your trigger to decrease your aperture,” he says.\n“I recommend starting around f/5.6 as this keeps your lens fairly open, but still gives room to adjust even on the open end. Additionally, most lenses will be capable of having room to adjust at this sitting. That said, if you find yourself adjusting this setting, be sure to double check you are still in focus after changing the aperture.”\nFinally, white balance is something to consider although Chaney says if a photo is being captured in RAW, it’s the least important one by far. \n“White balance is by far the least important of the settings to get right, but only if you’ve taken the advice to ensure you’re shooting in RAW. Shooting RAW allows you the most ability to adjust the temperature of the photo in post-processing. Regardless, I recommend setting the temperature to 5000K.”\nWith that in mind, Chaney recommends using a camera’s built-in intervalometer to have the camera automatically capture photos at a given pace. \n“With the opportunity to be at a fireworks show, you’ll want to have the ability to take it in and enjoy the spectacle. That leads me to my last tip that utilizes the built-in interval timer on the camera,” he says.\n\nMany cameras offer a built-in interval timer, or intervalometer, but many modern remote triggers offer the same functionality. Below are Chaney’s recommended settings that he uses in his Nikon Z camera:\n“Setting the interval to three seconds means that the camera will attempt to take a photo every three seconds. You’ll need to adjust this value if using a different exposure other than two seconds. A three-second interval will give roughly a one-second gap between each photo being taken,” he explains.\n“The ‘interval x shots/interval’ setting specifies that 1,200 shots will be attempted, and one photo per interval will be captured. At a three-second interval, this will give time to shoot for up to an hour.”\nMost of all, enjoy the spectacle, and good luck capturing pictures!\nImage credits: Will Chaney\n© 2024 PetaPixel Inc. All rights reserved.",
        "value": 0,
        "type": "technology"
    },
    {
        "title": "Apple’s Weather app gets two new features in iOS 18",
        "source": "9to5Mac",
        "body": "When iOS 18 arrives this fall, it will bring a huge number of changes to the iPhone’s built-in apps. System apps like Messages, Photos, Reminders, Notes, Journal, and Settings are some of the highlights. But the Weather app is getting a tiny bit of love too.\nHere are the two new features coming to Weather in iOS 18.\nLots of the time weather apps on the iPhone ask you to make a choice: would you prefer to see the actual temperature, or the feels like temp? This is common practice in a variety of third-party apps.\nBut in iOS 18, Apple’s Weather app is putting both temperatures front and center—and in a clever way.\nAt the top of the Weather app, where the actual temperature is displayed, you’ll now see the feels like temp underneath it.\nThe actual temperature is displayed in a large font, with the feels like in a smaller font and different color.\nWhat’s especially nice about Apple’s implementation is that the feels like will only be displayed when there’s a notable difference between the two temperatures. \nSo you won’t find yourself in a situation where Weather lists 70 degrees for the actual temp and below says 70 for the feels like too.\nInstead, the feels like temperature will only appear when it’s relevant. For example, as I write this the actual temp is 92 and the feels like is 101—a difference I would definitely want to take note of.\nApple’s design implementation not only prevents repetitive data from being displayed, but it also comes with the benefit of better drawing your attention to the feels like. When the feels like is worth knowing, you’ll see it surfaced in the app for you, and the visual change prompted by its sudden appearance is more likely to get your attention than a static dual-temperature display.\nThe second new feature in Weather involves your Home and Work locations.\nI like this. I check the \"feels Like\" all the time when I'm going to walk.\nApple Maps in iOS has long integrated with the Contacts app to pull in your home and work address info from your contact card. This makes those key addresses easy to route to in Maps.\nNow, in iOS 18, that same info from Contacts is being used in the Weather app. By default, your home and work addresses will be added as new locations to your list of tracked weather spots. It’s a small change, but a nice one.\nThanks to Apple’s efforts at cross-platform app development, these Weather app changes are coming not just to the iPhone in iOS 18, but also to the Mac and iPad. Upon installing macOS Sequoia or iPadOS 18, you’ll benefit from the same feature updates in your Weather app.\nWhat do you think of the Weather app changes? Anything on your wish list that didn’t make it this year? Let us know in the comments.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Mac on YouTube for more Apple news:\nRyan got his start in journalism as an Editor at MacStories, where he worked for four years covering Apple news, writing app reviews, and more. For two years he co-hosted the Adapt podcast on Relay FM, which focused entirely on the iPad. As a result, it should come as no surprise that his favorite Apple device is the iPad Pro.",
        "value": 0,
        "type": "technology"
    },
    {
        "title": "The First Descendant - How To Unlock Bunny For Free",
        "source": "GameSpot",
        "body": "The First Descendant has arrived, and in this immediately popular free-to-play looter shooter, you'll step into the slick suits of several heroes, each of them representing different builds with unique skill sets. Though only three characters are available to choose from when you first jump into the game, your first character unlock thereafter, Bunny, can be obtained for free and without much of a grind--which isn't the case for the other locked characters.\nKnowing how to get Bunny in The First Descendant means completing several steps over the game's first few hours, so in this guide we'll walk you through every step so you can claim the \"speedster\" hero for yourself.\nAfter you've chosen your starter character from the three available--the ice queen Viessa, the tanky Ajax, or the defensive Lepic--you'll be thrown into the game's world. A number of cutscenes will introduce the story and setting, and you'll even meet Bunny, your soon-to-be-unlocked character, who offers a build based on speed and electric powers.\nYou can view her bio, kit, and other details by going into the Descendant menu and viewing the character list. If you click her Research Info, you'll see you need several items to unlock her if you want to do so for free.\nThis screen, and this game as a whole, will throw a lot of new proper nouns at you in the way these Destiny-likes always do. Don't fret; though it can seem daunting to learn it all at first, your path to Bunny is simpler than it seems. It just takes a little while to get to the end.\nEssentially, what you'll want to do to unlock Bunny is stay on the critical path for a while, as the game uses her unlock as an example of the gameplay loop. You'll leave the MMO-like safe zone hub of Albion for Kingston, the first open-world section of the game, where you'll complete several main missions marked with purple icons like that seen in the image above.\nEach of these missions will grant you a key item in Bunny's research requirements. The complete list of required missions and their rewards can be seen below.\nYou'll also need to amass 400,000 gold, but you'll get that much and a bit more just by completing these missions. Once you've completed these missions, you'll be able to research her completely, but before we get to that, be mindful of a few key tips.\n The First Descendant is not meant to be played solo. Some will try, and some of them will even succeed, but this is really a game designed for co-op, so be sure that you are choosing public lobbies when loading into missions--you'll know you are as the game asks you for your preference--or, if you'd rather not play with strangers, bring some friends. \nThe enemy waves in some missions can overwhelm solo players, but by combining your powers with those from other players, this early-game onboarding will be much less stressful.\nThis is an important one, as you can actually miss one of the key items you need to research Bunny's character unlock. After the game's first boss battle, you'll choose from three rewards for your troubles. Be sure you select the one on the right, \"Amorphous Material pattern: Bunny.\"\nSelecting either of the others will mean you don't have a vital component and thus may need to play the boss battle again to get it. \nOnce you've beaten the boss and selected Bunny's Amorphous Material, you'll have one more item to obtain: Bunny Code. For this, you won't find a mission in Kingston like the others before it. You'll actually want to head into your map screen and select the Void Intercept Battle (normal difficulty) at the bottom of the screen.\nThis will open up a menu displaying the several Void Intercept missions currently in the game, though only the Gravewalker will be unlocked for you at this moment. Select it, and once again ensure you play it in co-op. The Gravewalker is extremely tanky, and though its offensive abilities aren't too threatening, it'll take a full group to deplete its HP down to nothing within the time limit. \nOne important tip for this battle with the massive robot is to know its weak points. Before you start the mission, you'll be briefed on where and how the Gravewalker is most vulnerable. It's critical that you and/or your allies target these areas and use the recommended resistances if you have them.\nThe Gravewalker attacks with fire and is weak to piercing ammo, and at this point in the game, you'll have already obtained a number of new guns and mods, so customize your loadout before you head into battle to give yourself the best chance to prevail.\nOnce you've beaten the Gravewalker, you'll have earned the Bunny Code, and by now have eclipsed 400,000 gold, so you'll have the last of what you need to claim Bunny for free.\nHead back to Albion and find Anais. She's set up in the research center in the bottom left on the map screen, as seen above.  \nWhen speaking with Anais, choose to research a new Descendant and select Bunny. The screen will confirm you have everything you need, and it'll tell you that the project will take just one minute of research time.\nBegin the research, then wait 60 seconds.\nCongratulations! You've unlocked Bunny for free, and you've claimed your first post-launch Descendant. As of now, all 14 characters in the game can be earned for free, though after your starter character and Bunny, others won't come as easily. They often demand you complete harder missions, obtain more and rarer items, and wait longer times for each research project to finish. You can also skip the grind and purchase characters in the game's shop, of course.\n\nIf you'd like to swap out your starter character for Bunny right away, you can do so in the Descendant menu. She will drop into the world right away, and she'll even be at the same level as your starter character, which will be level 10 at that point in the game if you've stayed on the guided path thus far. \nWe'll be bringing you more First Descendant guides soon, so stay tuned.\n",
        "value": 0,
        "type": "technology"
    },
    {
        "title": "Google Pixel 9 again leaks in another video, giving us a closer look",
        "source": "Android Central",
        "body": "The leak now showcases even the display in action next to the colorway.\nAfter witnessing a Pink Pixel 9 in a set of images and a hands-on video on Tuesday (July 2), another video surfaced on the web, giving the audience a closer look at the upcoming flagship.\nWhile the previous leaked hands-on video showcased the device from all angles, it didn't show it with its screen turned on. The latest one, shared by a user with the username \"Reparation Mobile 23\" on Facebook (via Android Authority), reveals the screen in action to some extent. \nIt doesn't drastically differ from the current Pixel 8 series, as it still has a conventional punch-hole screen and a flat display. The interface on the inside looks unchanged, too.\nThe device is shown in all possible angles, aside from the screen. At the bottom, the Pixel 9 has a single speaker grille, USB Type-C, and a SIM card slot, while the volume rockers and the home button are on the side pane. \nThe dual cameras are seen inside the camera visor, which is accompanied by an LED flash. The visor sports a matte finish, and the back appears glossy, similar to the previous hands-on video.\nAside from the all-new pink color and aforementioned details, nothing concrete is there to comprehend. The leaked high-quality renders of the Pixel 9 and its siblings have given us a fairly clear picture of what to expect at the Made by Google event. \nRegardless, it is still a major leak, given that the launch is still a month away. The previous leak also indicated that the device is already available in the Algerian market. \nGet the latest news from Android Central, your trusted companion in the world of Android\nAlong with the Pixel 9, the Pixel 9 Pro and an all-new Pixel 9 Pro XL model will likely debut at the Made By Google event on August 13. Next to the Pixel phones, the Pixel Watch 3 and the new generation of Pixel Buds are the other expected devices from Google. With this major hands-on leak, we expect similar significant leaks to pop up as we march toward the Pixel launch event.\nVishnu works as a freelance News Writer for Android Central. For the past four years, he's been writing about consumer technology, primarily involving smartphones, laptops, and every other gizmo connected to the Internet. When he is away from keyboard, you can see him going on a long drive or chilling on a couch binge-watching some crime series.\nGoogle has reportedly finished designing the Pixel 10's custom Tensor G5 SoC\nPixel 9 will reportedly arrive with a new 'Google AI' collection of features\nIs the Motorola Razr 2024 waterproof?\nAndroid Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. ",
        "value": 0,
        "type": "technology"
    },
    {
      "title": "Where and why is mpox disease spreading in the DRC?",
      "source": "Al Jazeera",
      "body": "A new variant of the virus is spreading through sexual contact and is affecting vulnerable populations, experts say.\nThe Democratic Republic of Congo (DRC) is experiencing the biggest outbreak of the viral mpox disease ever recorded, with tens of thousands of people infected as of June. In December 2022, the government declared it an epidemic.\nFormerly called monkeypox, the mpox disease is caused by the monkeypox virus, and is typically zoonotic – that is, it can be transmitted from animals to humans.\nThe virus is endemic to the densely forested regions of Central and West Africa and is related to the virus that caused the now-eradicated smallpox. Mpox can prove fatal in severe cases, with the primary symptoms being an itchy rash all over the body and a fever. Vaccines can limit infection.\nAlthough outbreaks are common in the DRC, health experts said a new strain has been discovered this time in one part of the country.\nHere’s what we know about the outbreak:\nThe epidemic began in May 2022 in the country’s eastern Kwango province. However, it has since spread to 22 of DRC’s 26 provinces, including the capital, Kinshasa.\nTransmission is still concentrated in the east, however, with a high spread recorded in Kamituga, a mining town in the eastern South Kivu province. Doctors have found a new strain of the virus in the town.\nSince 2022, more than 21,000 cases have been reported with more than 1,000 deaths, according to the World Health Organisation (WHO). In 2023, a total of 14,626 cases and 654 deaths were recorded.\nThis year alone, 7,851 cases had been reported by the end of May, with 384 deaths. Many of those infected are children under five (39 percent). Close to two-thirds (62 percent) of those dying from the disease are also children.\nThe country’s Equateur, Sud Ubangi, Sankuru and South Kivu provinces are among those which have been hit the worst.\n\nThere have always been two mpox types, also known as clades.\nClade 2 is less deadly. It is the type that was spread in a 2022 outbreak first recorded in London and that reached 111 countries in Europe, South and North America, Africa, the Middle East, Asia and Oceania. More than 99 percent of people infected in that epidemic survived because that clade of the virus is less deadly. Rich countries affected by the outbreak were also able to stockpile vaccines and anti-virals for treatment.\nThe clade 1 classification, however, is much more severe, and could kill up to one-tenth of people infected. It is clade 1 that has usually cropped up in the DRC, and is causing the current outbreak.\nThis clade of the virus has typically spread through normal physical contact. However, infections are being spread mostly through sexual contact in this outbreak, experts have said.\nThat is particularly true in the hotspot town of Kamituga, which has a large population of sex workers, said Dr Jean Bisimwa Nachega, a professor of medicine at Pittsburgh University.\nKamituga is the same location where the new strain of the Clade 1 classification was discovered in September 2023.\nIt is a “significant development”, Dr Nachega said, referring to the vulnerabilities of sex workers, who, in addition to being economically disadvantaged and lacking access to healthcare, are also more likely than the rest of the population to have compromised immunity from diseases like HIV.\n“Unlike historical animal-to-human transmission, human-to-human sexual transmission, especially among high-risk groups like sex workers, adds a new challenge to controlling the virus,” he said.\nThe WHO says it’s unclear if this variant is more transmissible or if it leads to more severe sickness.\nDoctors speaking to The Associated Press said the new variant is presenting differently. Usually, mpox lesions appear on the face, arms, chest and legs, and are clearly visible on an infected person. In this case, however, the lesions being reported are largely on the genitals, experts said, making it much harder to track and diagnose cases.\nThere were no documented cases of sexual transmission of the clade I virus in past DRC outbreaks, according to WHO. Cases in the country reported since the 1970s, have been understood to be primarily due to ordinary direct contact with infected persons or animals.\n\nThe eastern region of the DRC is also badly affected by continuing conflict and is limited in resources, making it harder for authorities to adequately track, treat and monitor infected people, experts said. There are only two testing laboratories in Kinshasa and Goma, and only 18 percent of reported cases have been tested in labs.\nThe WHO has said there are also insufficient treatment kits in the country, and virtually no vaccines. Tecovirimat, an antiviral that was authorised for smallpox is being tested on more vulnerable patients in the DRC, according to WHO.\nVaccines can help with minimising the spread and were crucial in containing the outbreak in 2022 that affected wealthier countries, such as the United Kingdom and United States. But there are not enough vaccines to cover DRC’s 100 million population. The country’s minister of health has authorised doctors to administer the vaccines that are available in the highest-risk areas. Officials said the DRC is in talks with countries, including Japan, in a bid to procure more vaccines.\nPublic awareness about mpox is also limited, making self-reporting and containment difficult. Some patients have left isolation to buy food or continue their professional activity, experts said.\nThe fact that the disease can now be sexually transmitted brings an added layer of stigma, a problem which dogged healthcare staff during the initial spread of HIV/AIDS, experts pointed out. Experts said there is a risk of “silent transmission” if people don’t come forward themselves.\nThe eastern region of DRC which shares borders with Rwanda, Burundi, Uganda and Tanzania, is also a highly transient place, with people moving in and out regularly, increasing the risk of transmission to other countries. To the south, DRC borders Zambia and Angola, while its western and northern regions share borders with the Republic of Congo, the Central African Republic and South Sudan.\nLike the DRC, many other African countries also have limited testing capacity, treatment and surveillance capabilities, making this an issue of regional and global concern, Dr Nachega said.\n“Infectious diseases do not respect borders. Outbreaks in one region can quickly spread to other parts of the world, as seen with COVID-19. Even though the current mpox outbreak appears to be contained in one part of the DRC, people across the continent should remain vigilant,” he added.\nSo far, 19 cases have been detected in the neighbouring Republic of Congo, believed to have been spread from the DRC – although this has not been confirmed. In April, authorities there declared a public emergency.\nFurther afield, in Cameroon, 23 cases of the clade 2 virus were reported between January and April this year. South Africa has also recorded five clade 2 cases in an outbreak between January and May, although WHO says there may be more non-documented cases.\nThese cases are likely not directly related to the DRC outbreak. There’s frequent travel between South Africa and the DRC for trade but the cases are believed by some experts to be linked to the global clade 2 outbreak from 2022.\n\n\n\n\n\n\n\n\n\nFollow Al Jazeera English:",
      "value": -6.63,
      "type": "health"
  },
  {
      "title": "COVID's Hidden Toll: Full-Body Scans Reveal Long-Term Immune Effects",
      "source": "ScienceAlert",
      "body": "Long COVID is a brutal illness without a known mechanism or cure. Far from being psychosomatic in nature, a new study adds weight to the idea that this misunderstood disease is very much biological.\nThe lingering toll the SARS-CoV-2 virus exacts on the immune system is widespread and hiding in plain sight, argue researchers at the University of California, San Francisco, CellSight Technologies, and Kaiser Permanente South San Francisco Medical Center.\nWhen 24 patients who had recovered from COVID-19 had their whole bodies scanned by a PET (positron emission tomography) imaging test, their insides lit up like Christmas trees.\nA radioactive drug called a tracer revealed abnormal T cell activity in the brain stem, spinal cord, bone marrow, nose, throat, some lymph nodes, heart and lung tissue, and the wall of the gut, compared to whole-body scans from before the pandemic.\nThis widespread effect was apparent in the 18 participants with long COVID symptoms and the six participants who had fully recovered from the acute phase of COVID-19.\nThe activation of immune T cells in some tissues, like the spinal cord and the gut wall, was higher in patients who reported long COVID symptoms compared to those who made a complete recovery. Participants with ongoing respiratory issues also showed increased uptake of the PET tracer in their lungs and pulmonary artery walls.\nThat said, even those who recovered fully from COVID-19 still showed persistent changes to their T cell activity in numerous organs compared to pre- pandemic controls, in some cases two and a half years after they first contracted the virus.\n\"In some individuals, this activity may persist for years following initial COVID-19 onset and be associated with systemic changes in immune activation as well as the presence of [long COVID] symptoms,\" researchers at UCSF conclude.\n\"Together, these observations suggest that even clinically mild infection could have long-term consequences on tissue-based immune homeostasis and potentially result in an active viral reservoir in deeper tissues.\"\nThe findings are only correlative, but they provide compelling evidence that long COVID is tied to the persistence of the SARS-CoV-2 virus in the body and abnormal immune activity.\nLong COVID is currently defined by a host of unexplained symptoms that appear after a SARS-Cov-2 infection, lasting months, or even years, with no other known cause.\nDiagnosis is extremely tricky, as there can be more than 200 symptoms, which often overlap with other illnesses, such as 'brain fog', post-exertional malaise, fatigue, memory loss, or diarrhea.\nStudies show that 'long haulers' can suffer from lingering issues in their heart, brain, lungs, skin, kidneys, liver, spleen, gut, thyroid, and ovaries.\nOne explanation for this widespread effect involves activity of the immune system. Scientists have found biomarkers of inflammation and immune activation are often present in a patient's blood after the acute phase of a viral infection. \nCOVID autopsies also show evidence of the SARS-CoV-2 virus persisting throughout the body, including in the colon, the thorax, muscles, nerves, the reproductive tract, and the eye. In some cases, remnants of the virus showed up in the brain of a deceased patient 230 days after their first initial symptoms.\nSome studies even suggest an infection of the SARS-CoV-2 virus can 'reawaken' other dormant viruses in the body, like the Epstein barr virus, which has been linked to chronic fatigue syndrome/myalgic encephalomyelitis (CFS/ME). \nCFS/ME shares many of the same symptoms as long COVID, and some scientists suspect they may be one and the same. Brain scans have found that long COVID changes to the brain parallel the effects of CFS/ME, and recently, a landmark study confirmed that CFS/ME is \"unambiguously biological\" with multiple organ systems affected.\nToday, long COVID is increasingly recognized as having neurological underpinnings, and the recent discovery of T cell abnormalities in the spinal cord and brain stem suggest that these overactive immune cells are being 'trafficked' to tissues of the central nervous system.\n\"Overall, these observations challenge the paradigm that COVID-19 is a transient acute infection, building on recent observations in blood,\" the team from UCSF concludes.\nThe findings need to be confirmed among larger cohorts, now that this new technique for mapping the immune effects of long COVID in the body shows such great promise.\nThe study was published in Science Translational Medicine.",
      "value": 0,
      "type": "health"
  },
  {
      "title": "Human case of Plague identified in Pueblo County",
      "source": "KKTV",
      "body": "PUEBLO, Colo. (KKTV) - Public Health Officials are investigating a human plague case in Pueblo County.\nThe Pueblo Department of Public Health and Environment and the Colorado Department of Public Health and Environment are investigating a human case of plague based on preliminary test results.\nHealth officials said the plague bacterium can be transmitted by fleas and wild rodents. Plague occurs naturally, and it can affect humans and their pets.  Common ways to attract the plague are through infected flea bites, touching infected animals (prairie dogs, squirrels, rats, and rabbits), and inhaling droplets from the cough of an infected person or animal.\nCommon symptoms of plague include sudden fever and chills, severe headaches, muscle aches, nausea, vomiting, and feeling ill. Health officials said plague can be treated successfully with antibiotics, but an infected person must be treated quickly to avoid serious complications or death.\nCommon forms of plague include bubonic, septicemic, and pneumonic plague, though as of Wednesday at 4 p.m., health officials did not specify which form the case in Pueblo County was.\nHealth officials listed some ways for people to protect themselves and their pets from the plague:\nCopyright 2024 KKTV. All rights reserved.",
      "value": 0,
      "type": "health"
  },
  {
      "title": "Sore throat? As COVID cases surge, FLiRT variants on the rise: COVID-19",
      "source": "cleveland",
      "body": "CDC data from the period between June 16 to June 22 show emergency room visits increased more than 23% from and death due to COVID was up 14.3%.  Getty Images\nCLEVELAND, Ohio — Emergency room visits and deaths due to COVID-19 are on the rise, according to the latest data from the Centers for Disease Control and Prevention.\nAlthough compared to the surges of the past, the number of COVID-19 related deaths and hospitalizations remains low, they are indeed on the rise this summer.\nCDC data from the period between June 16 to June 22 show emergency room visits increased more than 23% from COVID-19 and death due to COVID was up 14.3%.\nGenetic analysis of the circulating virus indicates that the rise in COVID-19 infection is driven primarily by the new FLiRT variants of the virus, specifically KP.3, and KP.2 which make up more than 50% of all current cases.\nChanges in the dominant strains of circulating virus are to be expected said the CDC. FLiRT variants do not appear to cause more serious illness, but sore throats are the most common symptom in people who test positive for FLiRT variants, which could easily be attributable to another cause, or lead some to mistake COVID-19 infection for another type of viral illness.\nOver the last week, the number of new COVID-19 cases in Ohio increased from 1,745 to 2,049, marking the fifth straight week that COVID-19 cases have risen in the state, according to data released by the Ohio Department of Health on Wednesday. And this weekly increase came despite the data being reported a day earlier than normal - with just six days of data - because of the Thursday holiday.\nCases have been climbing since early June, following a period of decline beginning in early January.\nAt least 1,376,150 Ohioans have received the updated one-dose COVID-19 vaccine, an increase of 1,350 people from the prior week, the state reported. This represents 11.8% of the state’s population.\nThe total COVID-19 case count since early 2020 in Ohio has reached 3,756,672.\nThere were 83 Ohioans newly hospitalized in the last week, raising the total since the beginning of the pandemic in 2020 to 151,878. One additional person was admitted into the ICU, raising the total since 2020 to 15,821.\nThe state health department reported an additional eight deaths from COVID-19, raising the total to 44,018. Death reporting sometimes lags by weeks.\nJuly 3 recap\nJune 27 recap\nIf you purchase a product or register for an account through a link on our site, we may receive compensation. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with our Privacy Policy.\nUse of and/or registration on any portion of this site constitutes acceptance of our  User Agreement (updated 4/18/2024),  Privacy Policy and Cookie Statement,  and Your Privacy Choices and Rights  (updated 12/31/2023).\nCookie Settings/Do Not Sell My Personal Information\n© 2024 Advance Local Media LLC. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local.\nCommunity Rules apply to all content you upload or otherwise submit to this site.\nYouTube’s privacy policy is available here and YouTube’s terms of service is available here.\nAd Choices",
      "value": -0.77,
      "type": "health"
  },
  {
      "title": "Feast to fiasco: This man warns about dangerous barbecue tool",
      "source": "Deseret News",
      "body": "The barbecued chicken was probably the best Peter Richards ever tasted — a savory feast prepared by his wife Lindsey that even the kids were scarfing down. He joked with Greta, then 3, that if she didn’t eat the three cutlets she’d snagged, he would.\nShe gave him the third piece and he did exactly that, but as he swallowed it, he had the feeling he hadn’t chewed it enough. Only it felt more painful than that. Maybe it was a bone sliver, he thought, so he Googled how to get that to dislodge.\nEat a slice of bread. Swallow a banana. Nothing helped. Swallowing hurt enough that it kept waking him all night.\nHe told Deseret News the story a year after it happened.\nIn the morning, Richards, who runs an energy consulting firm and lives in Wrightsville, Pennsylvania, dropped the kids at school, then saw his doctor, who couldn’t find a reason for his pain and sent him to the emergency room for scans.\nThe culprit was clearly visible on X-ray: A thin piece of wire was lodged in his throat. It was a bristle from a metal brush used to clean the barbecue grill.\nRichards would soon learn that his journey — including three surgeries in four days and a just-in-case feeding tube — isn’t that uncommon. A study in the journal Otolaryngology-Head and Neck Surgery found that roughly 1,700 people visited an emergency room for just such an injury between 2002 and 2014. It’s believed likely that more bristles are swallowed but pass without causing harm. And sometimes people can retrieve it themselves.\nMost of the injuries are to the mouth or throat. But the rigid metal bristles can actually perforate nearly any part of the digestive tract and cause life-threatening injuries, including bowel obstructions, perforations and infections.\nDr. Meghan Martin, a pediatric emergency medicine doctor at Johns Hopkins All Children’s Hospital in St. Petersburg, Florida, told Today about a case she treated: a little boy who was complaining of excruciating pain in his ear. It took several examinations by different doctors before it was discovered he had a piece of wire from a grill brush lodged so deeply into his tonsil tissue that an exam didn’t show it. That required a scan.\nThe symptoms may not even show up for a few days, well after a meal cooked on the grill is no longer top of mind as a potential source of misery.\nSome experts suggest not using grill brushes; others say at the very least take great care: Clean the grill often so there’s no buildup and check after to be sure that there’s no bristle left behind. The other bit of advice is to be sure that you get rid of a grill brush if it shows any signs of wear.\nAs for Richards, it was in a third surgery using live X-rays as they went that the bristle was successfully removed. The surgeon told him he’d had a similar case where the patient’s esophagus was quite damaged.\nAfter his operations, Richards was on a liquid diet, then graduated to soft foods. He’s now recovered well. But the Richards family doesn’t use a wire brush these days to clean their grill. “Half an onion or potato works amazingly well,” he said. A pumice stone leaves a little powder behind that can be wiped off. Recently, he’s used a bamboo paddle to scrape the grill.\nThey all beat surgery, pain and a hospital bill.\nAs you head into the sunshine, it’s a good idea to keep some other summer risks in mind. Among the most common:",
      "value": 2.55,
      "type": "health"
  },
  {
      "title": "This Medieval Warrior Had His Hand Amputated, Then Replaced It With A Prosthetic Knife",
      "source": "All That's Interesting",
      "body": "Archaeologists have uncovered something pretty incredible in Northern Italy. Found in a Longobard necropolis, the skeleton of this medieval Italian warrior dates back as far as the 6th century. \nAnd long before Captain Hook, this man from the Lombardy region appears to have used a cap, buckle, and leather straps to attach a prosthetic knife to the stump of his amputated hand.\nIleana Micarelli et al.The skeleton with the knife and buckle displayed.\nPublished in the Journal of Anthropological Sciences, the finding means not only did he manage to survive a massive amputation procedure, but he was also able to replace the limb with a bladed weapon.\nObserving the morphological traits of the skeleton’s skull and pelvis, researchers were able to deduce that it was a male between the ages of 40 and 50.\nThe stump of his right arm was positioned across his chest, amputated at the mid-forearm. Researchers determined that the hand had been removed by blunt force trauma. A knife blade and a buckle were discovered with him as well. \n“One possibility is that the limb was amputated for medical reasons; perhaps the forelimb was broken due to an accidental fall or some other means, resulting in an unhealable fracture,” the researchers from Sapienza University in Rome led by archaeologist Ileana Micarelli wrote. Though they added, “Still, given the warrior-specific culture of the Longobard people, a loss due to fighting is also possible.”\nArcheologists have excavated over 160 tombs at the Longobard necropolis, where hundreds of skeletons were buried as well as a headless horse. \nBut the uniqueness of this one skeleton stood out. While all the others had knives at their arms and weapons laid at their sides, the research team identified this man as having a callus and bone spurs, evidence of biomechanical pressure. The find was consistent with the type of pressure typically applied to a prosthetic device.\nJournal of Anthropological SciencesThe teeth exhibited signs of considerable weathering from maintaining his prosthetic hand.\nThey also noted that his teeth were considerably weathered, which suggested he consistently used them to tighten the straps of the device. Or as the researchers wrote, “points to dental use in attaching the prosthesis to the limb.” Upon further examination it appeared that the man’s shoulder had formed a C-shape ridge of bone, indicating he took an unnatural position in order to frequently tighten the prosthesis using his mouth. \nFurther CT scans revealed outer bone loss, often the result where there is a prosthesis present.\nPrior to the development of antibiotics and sterilization techniques, Micarelli and her team said the find is a “remarkable” example of a person surviving the loss of a limb. It demonstrates that medics at the time had the ability to maintain a clean environment and had the knowledge to prevent blood loss. \nThe researchers also say that the case shows an environment which provided intensive care and community-level support. \n“The strength of his relationship with the community is at the heart of the surgical intervention’s success,” said Micarelli. “And in my opinion, social relations are as important as the level of medical technology.”\nNow read about the oldest virus found in a human skeleton. Then read about the most painful medical procedures of the Medieval Period.\n\nPO Box 24091\n\nBrooklyn, NY 11202-4091\n",
      "value": 0,
      "type": "health"
  },
  {
      "title": "\n\t\t\tMosquitoes in northern Anoka County test positive for West Nile virus\t\t",
      "source": "MinnPost",
      "body": "Tim Harlow at the Star Tribune reports the Metropolitan Mosquito Control District has found its first mosquitoes to test positive for West Nile virus this year in samples collected June 17-18 in Oak Grove in northern Anoka County.\nVia Minnesota Public Radio: Minneapolis park officials have temporarily closed four beaches due to high bacteria levels in the water, just ahead of the busy Fourth of July weekend. Beaches at Lake Harriet North and Lake Hiawatha are closed along with North Beach and the 32nd Street Beach on Bde Maka Ska.\nDana Thiede at KARE is reporting an 81-year-old woman in Balsam Lake, Wisconsin, was sentenced to life in prison Tuesday in the murder of a romantic rival but will be considered for parole in 20 years’ time. Mary Jo Bailey was sentenced to a mandatory life term with the possibility of parole for the 1985 shooting of Yvonne Menke.\nKatelyn Vue at Sahan Journal is reporting the developers behind a proposed Muslim-centric community in Lino Lakes — as well as the current owner of the land — are pushing back on city plans to put the project on hold.\nAl Brown at the Minnesota Spokesman-Recorder reports a street in north Minneapolis will be renamed in honor of longtime activist Spike Moss on July 16.\nChris Riemenschneider at the Star Tribune pays tribute to Zuzu’s Petals singer/guitarist Laurie Lindeen, who died unexpectedly Monday of a brain aneurysm at age 62, according to friends.\nMinnPost relies on donations from readers like you. Start a monthly gift today to help keep our in-depth journalism free for all to access. \nRepublish This Story\n\nRepublish our articles for free, online or in print, under a Creative Commons license.\nThis work is licensed under a Creative Commons Attribution-NoDerivatives 4.0 International License.\nby MinnPost staff, MinnPost July 3, 2024\nThis <a target=\"_blank\" href=\"http://www.minnpost.com/glean/2024/07/mosquitoes-in-northern-anoka-county-test-positive-for-west-nile-virus/\">article</a> first appeared on <a target=\"_blank\" href=\"http://www.minnpost.com\">MinnPost</a> and is republished here under a Creative Commons license.<img src=\"http://www.minnpost.com/wp-content/uploads/2023/12/favicon.png\" style=\"width:1em;height:1em;margin-left:10px;\"><img id=\"republication-tracker-tool-source\" src=\"http://www.minnpost.com/?republication-pixel=true&post=2171447&amp;ga4=3376753669\" style=\"width:1px;height:1px;\">\nis a 501(c)(3) nonprofit newsroom\nP.O. Box 18438 | Minneapolis, MN 55418 | 612.455.6950\n\n\t\t\t\t\t\t\tWe've recently sent you an authentication link. Please, check your inbox!\t\t\t\t\t\t\n\n\t\t\t\t\t\t\tSign in with a password below, or sign in using your email.\t\t\t\t\t\t\n\n\t\t\t\t\t\t\tGet a code sent to your email to sign in, or sign in using a password.\t\t\t\t\t\t\n\n\t\t\t\t\t\t\tEnter the code you received via email to sign in, or sign in using a password.\t\t\t\t\t\t\nSubscribe to our newsletters:\n\nSign in with your email\n\n\nLost your password?\n\n\nTry a different email\n\n\nSend another code\n\n\nSign in with a password\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPrivacy Policy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n",
      "value": 0,
      "type": "health"
  },
  {
      "title": "Local dengue fever cases confirmed in Florida Keys, spread by mosquito bites",
      "source": "Fox News",
      "body": "Two cases of locally acquired dengue fever – a mosquito-borne illness – have been confirmed in the Florida Keys, the Florida Department of Health in Monroe County announced earlier this week. \n\n The Monroe Department of Health and the Florida Keys Mosquito Control District (FKMCD) are upping their surveillance and prevention efforts as cases arise, the notice said. \n\n These measures include door-to-door mosquito inspections in the area, enhanced trapping and monitoring, and aerial and truck-mounted larvicide and adulticide treatments. \n\n Dengue fever can cause flu-like symptoms that include severe muscle aches, joint pain, fever and rashes, according to the alert. \n\n Dengue fever is not contagious and can only be spread by an infected mosquito. Symptoms can appear within 14 days of being bitten. \n\n DOH-Monroe reminded residents to take basic precautions against mosquito bites, including wearing bug repellent on skin and clothing, keeping screens on windows, using air conditioning in the home, and keeping doors and windows closed when possible. \n\n FKMCD also released a statement encouraging property owners to prevent mosquitoes from breeding by eliminating standing water. \n\n This can be done by turning over and removing empty pots, buckets, trash cans, recycling bins, pet bowls and children’s toys that collect water. \n\n The group also recommended checking tarps on boats or other equipment, as well as gutters, to make sure they’re clear of debris. \n\n Property owners are also encouraged to flush fresh water through hanging plants and bird baths. \n\n Fox News Digital reached out to the Florida health department for additional comment. \n\n 'Personal protection remains folks' best bet to stop the spread of mosquito-borne diseases, and vector-borne diseases more broadly,' Joe Fauver, PhD, epidemiologist at the University of Nebraska Medical Center, told Fox News Digital. \n\n 'There are currently no vaccines in the United States against mosquito-transmitted viruses, nor are there many treatments.' \n\n Highest on record\n\n Just before the local Floridian outbreak, the U.S. Centers for Disease Control and Prevention (CDC) issued an official health advisory for an increased risk of dengue fever infection. \n\n The agency reported on June 25 that the global incidence of dengue in 2024 is the highest on record. \n\n The World Health Organization (WHO) recorded more than 7.6 million global dengue fever infections in the first four months of 2024. \n\n The CDC advised health care providers to be on the lookout for dengue symptoms and to order appropriate diagnostic tests. \n\n During an appearance on FOX Business’ 'Varney & Co.' on Tuesday, Johns Hopkins School of Medicine professor Dr. Marty Makary said the infection is considered 'dangerous,' but not to the level of 'another pandemic.' \n\n CDC WARNS OF MOSQUITO-DRIVEN VIRUS AS CASES SPIKE\n\n 'It’s endemic in many tropical and warm countries,' he said. \n\n Dengue fever, which has been reported in about 38 U.S. states, can come with a characteristic eye pain and rash, according to the doctor. \n\n Although there are tests available, Makary confirmed there is no known treatment for dengue. \n\n 'It’s a good reminder to try to do what you can to reduce mosquito bites, especially in the southern United States, where this is more common,' he advised. \n\n ‘Invasive’ and ‘aggressive’ mosquitoes\n\n While Florida authorities have identified the yellow fever (Aedes aegypti) mosquito as the culprit in spreading dengue, the European Centre for Disease Prevention and Control (ECDC) previously warned that tiger mosquitoes (Aedes albopictus) can also carry the infection. \n\n Elitza Theel, PhD, director of Mayo Clinic Laboratories in Minnesota, confirmed that tiger mosquitoes are a 'known vector' for dengue fever and can transmit the virus to individuals who have not previously been infected. \n\n 'This mosquito species is concerning for a number of reasons, including that it is considered the most invasive species in the world,' she told Fox News Digital last month. \n\n The mosquito species is moving further and further north globally as temperatures grow warmer, the expert said. \n\n 'Tiger mosquitoes are also rather aggressive, biting both humans and animals at any time of the day, rather than just at dawn or dusk, which is typical of other mosquito species,' Theel warned. \n\n Fauver warned that the tiger mosquito can spread many 'problematic arboviruses (arthropod-borne virueses),' including dengue, Zika and chikungunya. \n\n 'The mosquito is a generalist feeder and will gladly take bloodmeals from humans, potentially exposing them to these arboviruses,' he told Fox News Digital. \n\n 'Aedes albopictus is an invasive species and is currently undergoing rapid range expansion and establishing populations in areas it previously wasn’t, including Europe and the U.S.' \n\n Health officials have claimed that climate change is one of the factors contributing to the spread of these insects.",
      "value": 11.61,
      "type": "health"
  },
  {
      "title": "Patients on Ozempic are developing a rare form of sudden blindness, doctors say",
      "source": "Business Insider",
      "body": "Eye doctors in Boston have started to notice a small but worrisome uptick in cases of a rare type of sudden blindness among patients taking semaglutide.\nThey're raising questions about whether taking Ozempic or Wegovy might be leading to more cases of nonarteritic anterior ischemic optic neuropathy, a rare condition where blood stops flowing to the optic nerve, disturbing the connection between the eye and the brain. The issue typically surfaces suddenly, without pain, and results in people waking up in the morning unable to see out of one eye.\n\n                                Related stories\n                              \nThe new investigation, published Wednesday in JAMA Ophthalmology, found that people taking semaglutide appeared slightly more likely to develop NAION than other patients with obesity or diabetes. (Semaglutide is the active ingredient in two Novo Nordisk drugs: Ozempic for type 2 diabetes and Wegovy for obesity.)\nThe number of patients on semaglutide who developed NAION was tiny: Out of more than 16,000 eye patients in Massachusetts included in this six-year retrospective investigation, only 37 people on semaglutide developed NAION. But that was still more than four times as many eye problems as those experienced by similar patients who were not on the drugs over the same time period. Only nine people with diabetes or obesity who were not on semaglutide developed NAION, the researchers said.\n\"This is information we did not have before and it should be included in discussions between patients and their doctors, especially if patients have other known optic nerve problems like glaucoma, or if there is preexisting significant visual loss from other causes,\" Dr. Joseph Rizzo, the study's lead author, the director of the neuro-ophthalmology service at Mass Eye and Ear, and a professor of ophthalmology at Harvard Medical School, said in a news release.\n\"The use of these drugs has exploded throughout industrialized countries and they have provided very significant benefits in many ways, but future discussions between a patient and their physician should include NAION as a potential risk,\" he added.\nIn a statement sent to Business Insider, the semaglutide maker Novo Nordisk said: \"Patient safety is a top priority for Novo Nordisk, and we take all reports about adverse events from the use of our medicines very seriously.\"\nBut the drugmaker raised concerns about the ways this study was conducted, saying there were too few cases in the trial to draw meaningful conclusions and that this type of backward-looking study could never answer questions about a causal link between semaglutide and NAION.\n\"NAION is not an adverse drug reaction for the marketed formulations of semaglutide,\" the company said.\nPatients with diabetes and high blood pressure have always been at an increased risk of developing eyesight issues. For example, having chronically high blood sugar can distort your eye lenses, contributing to blurry vision. (Novo Nordisk is working on another, separate study, testing whether semaglutide might be useful in treating diabetic retinopathy.) NAION is usually permanent, and there is no treatment for it.\n\n\n                                Read next\n                              \nJump to",
      "value": -4.23,
      "type": "health"
  },
  {
      "title": "\n\t\tI’m a disease doctor — beware these common pool-related illnesses\t",
      "source": "New York Post",
      "body": "Talk about a cesspool.\nAs temperatures rise, the siren sound of the swimming pool amplifies. While chemicals like chlorine and bromine do their darndest to kill off bacteria and viruses, some germs stay afloat.\nEnjoy your Fourth of July festivities, but beware of illnesses that can be contracted from contaminated pool water or breathing in chemicals that have evaporated and turned into gas. \nAs HuffPost reports, diarrhea is the most common culprit for swimming-related sicknesses. \nWhen there’s poo in the pool, millions of germs are released into the water, and people can get sick by swallowing even a tiny amount.\nWorse yet, and more common still, a full-blown fecal incident is not the only way people get sick. Small particles of poop can easily come off people’s bodies when they swim, meaning you won’t see the danger. \nCryptosporidium, norovirus, giardia, shigella and E. coli are common poo-related germs. Depending on the offending pathogen, symptoms can include fever, cramping, nausea, vomiting and diarrhea. \nIf swimming with kiddos or babies, ensure diapers are changed far from the pool to prevent contamination and/or make sure to take frequent bathroom breaks. \nSometimes the chlorine, bromine and pH ratio is not exactly right, allowing germs to spread. Other times, people are exposed to germs in the time it takes for chlorine to eliminate them. \nDr. Clare Rock, an associate professor at the Johns Hopkins University School of Medicine, explained to HuffPost, “This is one of the reasons why, if there is a fecal accident in a pool, there is protocol the lifeguards and pool operators follow before allowing people back into the water.” \nCryptosporidium, also known as crypto, has proven particularly resistant to chlorine. According to the Centers for Disease Control and Prevention, from 2015 to 2019, crypto caused 49% of infectious outbreaks in aquatic places like pools, hot tubs and water parks.\nWhile chlorine or bromine can kill most germs within minutes, crypto can survive in a water source for a week or more. \nThose with compromised immune systems are more vulnerable to severe crypto infection. If you’ve been sick with diarrhea or diagnosed with crypto, the CDC recommends waiting at least two weeks after symptoms cease before swimming.\nSwimmer’s ear is a bacterial infection caused by pool water in the outer ear canal. When water stagnates in the ear, it breaks down its protective wax, providing a prime environment for bacteria to proliferate.\nSymptoms of swimmer’s ear include pain, redness, swelling, itchiness and ear drainage. It’s most common in children, and it’s not contagious. \nRock explained that to prevent and combat swimmer’s ear, “You can use a towel, but also pull the earlobe in different directions to drain out any water … consider using earplugs or a bathing cap to prevent pool water getting into the ear.”\nSkin, eye or throat irritation is a common consequence of dipping into a swimming pool. \nRock explained: “Chlorine in the pool turns into chemical irritants when combined with sweat, urine and dirt. When you smell ‘chlorine’ at the pool, you are probably actually smelling these chemical irritants as they turn into gas in the surrounding air.”\nCalled chloramines, these irritants cause rashes, itching, red eyes, coughing, wheezing and nasal irritation. Improper pH levels in a swimming pool can lead to skin and eye irritation.\nIt is imperative to shower before swimming. A one-minute pre-swim rinse is enough to remove most of the dirt or other substances that use up the chlorine or bromine needed to kill germs. \nExperts agree that everyone should abstain from peeing in the pool, not only because it is rude AF but also because chloramines form when urine, sweat and/or makeup combine with chlorine. These substances also decrease the amount of chlorine that can kill other germs. \nTo gauge the safety of a swimming pool or water park, consider examining records of the health department’s inspection of the venue.\nHuffPost also recommends making sure you can see the drain in the deep end of the pool, that lifeguards are watching swimmers and, in the absence of a lifeguard, that a rescue ring is present.\nThe No. 1 precaution swimmers can take is to avoid swallowing pool water and to stay on dry land if healing from an open wound or cut. If you must swim, use a waterproof bandage and fully cover the wound.\n\n\t\t\t\t\tSubscribe to our weekly Post Care newsletter!\t\t\t\t\n\n\n\n\t\t\t\t\t\t\tPlease provide a valid email address.\t\t\t\t\t\t\n\n\n\t\t\t\t\tBy clicking above you agree to the \t\t\t\t\tTerms of Use\n\t\t\t\t\t and \t\t\t\t\tPrivacy Policy.\n\t\t\t\t\n\n\t\t\t\t\tNever miss a story.\t\t\t\t\nIllness aside, New Yorkers may have trouble finding a safe place to swim this summer.\nAn ongoing lifeguard shortage has threatened access to NYC public pools and beaches.\nFor those with a yard and a little disposable income, The Post recommends a variety of inflatable swimming pools, including the granddaddy of them all, the Inflatable Water Park. \nAdvertisement",
      "value": 9.12,
      "type": "health"
  },
  {
      "title": "Many tattoo ink and permanent makeup products contaminated with bacteria, FDA finds",
      "source": "CBS News",
      "body": "Nearly half of samples taken from permanent makeup ink products and close to a quarter of tattoo ink products were contaminated with bacteria, the Food and Drug Administration found, even in brands that claimed to be \"sterile.\"\nTheir findings, published Tuesday in the Applied and Environmental Microbiology journal, are just the latest round of FDA tests to turn up contamination in body inks sold in the U.S. \nThe FDA has warned for years about the risk of contamination after previous outbreak investigations and studies have turned up pathogens in these kinds of products.\nLast year, the FDA issued guidance to tattoo ink makers urging them to step up precautions across the industry. Since 2003, the agency says tattoo makers have conducted 18 recalls over inks found to be contaminated.\nFor their latest study, scientists at the FDA's National Center for Toxicological Research sampled multiple tattoo and permanent makeup inks purchased from 14 different manufacturers.\nPermanent makeup products from both domestic and international manufacturers were found to be contaminated, including some from France and China.\nFDA's scientists found bacteria in a larger proportion of permanent makeup inks they tested than tattoo inks.\nOf the 49 tattoo ink samples they studied, nine of them were found to have bacterial growth. Out of 35 permanent makeup inks that were tested, nearly half — 17 samples — were contaminated.\nIt is unclear which brands were found to be contaminated or whether the FDA took any action against the companies found to be producing infectious products. A spokesperson for the agency did not immediately respond to a request for comment.\nWhen narrowed to the 49 of either tattoo or permanent makeup products that claimed to be \"sterile\" on their packaging, 16 were found to be contaminated with microorganisms. \n\"There was no clear link between a product label claiming sterility and the actual absence of bacterial contamination,\" Seong-Jae Kim, a microbiologist with the FDA's National Center for Toxicology Research, said in a release. \nIn this study, the scientists looked specifically at bacteria that can grow without needing oxygen. While previous research by Kim's center and others have looked at contamination in inks, the study is the first to look specifically at both aerobic and anaerobic bacteria in these inks.\n\"Our findings reveal that unopened and sealed tattoo inks can harbor anaerobic bacteria, known to thrive in low-oxygen environments like the dermal layer of the skin, alongside aerobic bacteria,\" Kim said.\nThe most frequent anaerobic bacteria they found in permanent makeup inks was Cutibacterium acnes, a common driver of acne as well as implant-associated infections. \nSome also had bacteria like Staphylococcus epidermidis and Staphylococcus saprophyticus, which have been linked to urinary tract infections.\n\"These findings indicated that the actual sterilization process may not be effective to remove all microorganisms, or the label claims may not be accurate,\" the study's authors wrote.\nAlexander Tin is a digital reporter for CBS News based in the Washington, D.C. bureau. He covers the Biden administration's public health agencies, including the federal response to infectious disease outbreaks like COVID-19.\n\n© 2024 CBS Interactive Inc. All Rights Reserved.\n\nCopyright ©2024 CBS Interactive Inc. All rights reserved.",
      "value": -3.00,
      "type": "health"
  },
  {
      "title": "Scientists just grew the 1st-ever 'minibrains' from multiple people's cells",
      "source": "livescience.com",
      "body": "\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\nHybrid brain organoids could be used to test how people respond differently to drugs before clinical trials begin, researchers say. \nFor the first time, scientists have grown 3D brain models using cells from multiple people. \nThe new hybrid creations, which researchers have dubbed \"chimeroids,\" are a variation of brain organoids — tiny 3D models made of tissue that mimic the structure and function of a full-size brain. These models are more accurate to human biology than 2D cellular models or animals like lab mice. Because of this, scientists hope that the models will accelerate drug research and development. \nTypically, brain organoids are grown from cells that are collected from just one donor. This means they can't capture the genetic variability that exists between people, which can impact individuals' brain development and their responses to drugs. \nCreating chimeroids could overcome this hurdle, according to the scientists behind a new study, published June 26 in the journal Nature. Such a \"village in a dish\" could be particularly useful in the early stages of drug testing, they said. \nResearchers have previously grown sheets of brain cells from the stem cells of different people, but this is the first time that 3D models of the brain have been grown this way. \nRelated: Lab-grown 'minibrains' may have just confirmed a leading theory about autism\n\"Chimeroids are an exciting tool that will be widely adopted in the field of neurodevelopment, probably with diverse applications,\" Aparna Bhaduri, an assistant professor of biological chemistry at the University of California, Los Angeles who was not involved in the research, wrote in a commentary of the study. \nGet the world’s most fascinating discoveries delivered straight to your inbox.\nTo make the chimeroids, researchers collected stem cells from five people and then in the lab used growth-inducing chemicals to coax them into growing into brain organoids — each of which had cells from just one person. The scientists then tore the resulting organoids apart and recombined the cells within them to form chimeroids. This ensured that each chimeroid contained an equal number of cells derived from each person. \nAfter three months, the chimeroids were around 0.12 to 0.2 inches (3 to -5 millimeters) in diameter and contained all the same types of cells that are normally found within the cortex — the outermost layer of the brain — of a fetus. \nSeparately, the team exposed the chimeroids to two neurotoxic chemicals: ethanol, which is associated with fetal alcohol spectrum disorders, and the antiepileptic drug valproic acid, which can increase the risk of birth defects. The team found that cells that came from different donors responded differently to these drugs, in terms of how extensively the chemicals hindered their growth, for example. \n—Lab-grown 'minibrains' help reveal why traumatic brain injury raises dementia risk\n—Mini model of human embryonic brain and spinal cord grown in lab\n—Could mini space-grown organs be our 'cancer moonshot'?\nIf scaled up to contain cells from even more people, chimeroids could theoretically help determine how patients will respond to drugs before they are tested in a clinical trial, the team said. They could then be segregated into specific treatment response groups. \n\"I'm excited about what the future holds in terms of using organoids, such as the chimeroids, to develop brand new ways to achieve therapeutic innovation for neurological disease,\" Paola Arlotta, co-senior study author and a professor of stem cell and regenerative biology at Harvard University, told Live Science in an email. \nEver wonder why some people build muscle more easily than others or why freckles come out in the sun? Send us your questions about how the human body works to community@livescience.com with the subject line \"Health Desk Q,\" and you may see your question answered on the website!\nEmily is a health news writer based in London, United Kingdom. She holds a bachelor's degree in biology from Durham University and a master's degree in clinical and therapeutic neuroscience from Oxford University. She has worked in science communication, medical writing and as a local news reporter while undertaking journalism training. In 2018, she was named one of MHP Communications' 30 journalists to watch under 30. (emily.cooke@futurenet.com) \n\nPredator or prey? This 'switch' in the brain toggles when you're hunting or being hunted\nSecret to lifelong memories sticking is molecular 'glue'\nRare, mystery blasts from sun can devastate the ozone layer and spike radiation levels on Earth\nLive Science is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. ",
      "value": -1.86,
      "type": "health"
  },
  {
      "title": "Potent overdose treatment boosts hopes of combating opioid crisis",
      "source": "Financial Times",
      "body": "Scientists have found a way to boost the effectiveness of the most popular opioid overdose treatment, raising hopes of reducing drug-related deaths that claim tens of thousands of lives every year in the US. \n\n An international research team discovered a chemical compound that improves the potency of naloxone more than seven-fold, potentially allowing the antidote to be given in smaller doses. \n\n Opioid addiction and its lethal consequences have become an intense focus of US politicians and health authorities, with more than 70,000 Americans dying annually for the past several years from overdoses involving the drug. A surge in availability of powerful synthetic opioids such as fentanyl has exacerbated the crisis. \n\n Naloxone is widely known under its brand name Narcan. The naloxone booster discovery, published in Nature on Wednesday, is part of a wider effort to use chemical means to tackle the destructive impact of opioids, said Professor Brian Kobilka, leader of the research. \n\n “This approach will hopefully save lives, but will not address the underlying problem of opioid addiction,” said Kobilka, a joint winner of the 2012 Nobel Prize for chemistry. His laboratory is working on developing non-opioid painkillers, which remove the risk of addiction. US biotech Vertex Pharmaceuticals has a similar drug in late-stage trials. \n\n Kobilka and other scientists from the US, Japan and Denmark screened a library of 4.5bn candidate chemical compounds until they found one called “368” that binds to a specific type of opioid receptor site. The 368 compound amplifies the ability of naloxone to block addictive opioids such as fentanyl and morphine, while minimising withdrawal symptoms. \n\n While Kobilka noted that the latest breakthrough was still in the “very early stages in the drug development process”, it raises the prospect of progress in dealing with the opioid addiction scourge in the US, Canada and other countries. \n\n In a commentary also published in Nature, Catherine Cahill, a researcher at Los Angeles-based Jane & Terry Semel Institute for Neuroscience & Human Behavior, said it was an “important advance, opening up fresh avenues of investigation in the search for solutions to the opioid crisis”. \n\n Naloxone, one of two approved overdose reversal agents, is a key tool used by US health authorities for tackling the opioid epidemic. In California, the state government in April struck a deal with a manufacturer of a generic version to boost availability of free doses of the drugs. Naloxone is available for free in pharmacies in many other states, such as New Jersey and Nevada. \n\n Last year Narcan, which is produced by Emergent BioSolutions, was approved by the Food and Drug Administration for over-the-counter sales. For several years, Emergent stymied efforts to produce an over-the-counter version of Narcan to keep profits high. A two-dose box of Narcan is priced at $44.99. \n\n Emergent, which generated nearly $500mn in sales from Narcan last year, said “this early research appears promising and is important in advancing the science of naloxone to address the opioid crisis”. But it noted the researchers used a subcutaneous dose while Narcan is a nasal spray. \n\n Emergent added that it was “committed to expanding access [while] increasing awareness and maintaining affordability” of Narcan. \n\n Michael Litterer, vice-president at RWJBarnabas Health Institute for Prevention and Recovery, part of New Jersey’s biggest healthcare system, said the biggest impact of a boosted version of naloxone would be as an antidote to “the skyrocketing potency of fentanyl”, he said. \n\n “There’s not enough availability of naloxone in general, let alone enough to combat high-potency fentanyl,” he added. \n\n Emergency services sometimes did not “carry enough Naloxone to save people” when users had taken large doses of fentanyl, said Ryan Hansen, associate professor of pharmacy at Washington university in Seattle, “If these products were co-administered, it could save a lot of lives,” he added.",
      "value": -3.86,
      "type": "health"
  },
  {
      "title": "One Ancient Fossil Named Tina May Have Rewritten the Story of Human Evolution",
      "source": "Popular Mechanics",
      "body": "The remarkable evidence shows Neanderthals were more than just survivors.\nGear-obsessed editors choose every product we review. We may earn commission if you buy from a link. Why Trust Us?\nOne of the defining characteristics of the human species is its ability to care for others beyond some sort of Darwinian survival instinct. But that characteristic may not have been exclusive to the last remaining Hominid species on Earth. \nA new discovery by an international team of archeologists examining fossils from the Cova Negra cave near Xàtiva, Spain—an area known to have housed Neanderthals some 273,000 to 146,000 years ago—found evidence of Down’s syndrome in a six-year-old Homo neanderthalensis, nicknamed “Tina.” This could provide an intimate glimpse into the caring nature of another species in the Homo genus. \nThe fossil in question is part of the temporal bone from the side and base of the skull, which also includes parts of the inner ear. This was a fortunate bone to uncover, as the researchers found particular developmental features in the semicircular canals of the inner ear that aid in balance—one canal was unusually wide, another was connected to a vestibular aqueduct (which is not typical), and the cochlea was particularly small. Today, these three traits are only found in individuals with Down’s syndrome. The results of the study were published this week in the journal Scientific Advances. \n“The pathology which this individual suffered resulted in highly disabling symptoms, including, at the very least, complete deafness, severe vertigo attacks and an inability to maintain balance,” Mercedes Conde-Valverde, a paleoanthropologist at the University of Alcalá in Spain, told The Guardian. “Given these symptoms, it is highly unlikely that the mother alone could have provided all the necessary care while also attending to her own needs. Therefore, for Tina to have survived for at least six years, the group must have continuously assisted the mother, either by relieving her in the care of the child, helping with her daily tasks, or both.”\nThis would be the first time such a diagnosis was found among Neanderthals, but it isn’t the first piece of evidence to suggest that Neanderthals lived more than a simply brutish, “survival of the fittest” existence. Past excavations of Shanidar Cave in northern Iraq discovered a Neanderthal male with deformities in both legs, withered arm, and partial blindness who still lived to adulthood (around 20 to 35 years old). Fossils of another human ancestor, Homo heidelbergensis, also displayed the care of individuals that would’ve required special needs or attention. Even chimpanzees displaying Down’s syndrome-like symptoms have lived longer than what was previously believed possible. \nWhile the evidence of Tina experiencing Down’s syndrome is pretty convincing, some scientists say it isn’t enough to determine irrefutable facts about Neanderthal societies. Sarah Turner, a biologist at Concordia University in Montreal, told New Scientist that there is a lot of variation in what is considered a disability, and that someone with Tina’s proposed condition could still have contributed positively to the group.\nThe idea of productivity within the group also arises in-part from our modern perceptions of society. But in a small, close-knit group where social caring is an instinct, very affectionate and sociable individuals—as those with Down’s syndrome are known to be—can be very valuable. \nThere’s no certainty to the idea that Paleolithic societies would have viewed someone with such a disability as a burden. In fact, they could have been seen as a valuable asset. Either way, it certainly seems that Tina’s community stepped up for her.\nDarren lives in Portland, has a cat, and writes/edits about sci-fi and how our world works. You can find his previous stuff at Gizmodo and Paste if you look hard enough. \nAncient Nile Hillside Reveals 33 Egyptian Tombs\nMeteor Shockwave May Have Ruined Woolly Mammoths\nCharred Scroll Explains Plato’s Final Night\nTreasure May Be Hidden Amongst Terracotta Army\nAncient Graffiti Unveils Unknown Greek Temple\nArcheological Find May Become Modern Housing\nOlmec ‘Portal to the Underworld’ Returns to Mexico\nA New Find Ripped Up the Map of Human Migration\nHieroglyphics Unveil Ramses II’s Lost Sarcophagus\nExperts Translate Papyrus About Jesus’ Childhood\nAncient Roman Room Shows Rare Blue Walls\nDinosaur Fan Discovers Teen T. Rex Fossil On Hike\nA Part of Hearst Digital Media\nWe may earn commission from links on this page, but we only recommend products we back.\n©2024 Hearst Magazine Media, Inc. All Rights Reserved.",
      "value": 0,
      "type": "health"
  },
  {
      "title": "Dr. Oz discusses the connection between lifestyle and dementia",
      "source": "nj",
      "body": "Q: I have been told that I have a genetic predisposition to dementia. I’m terrified. Can I do anything to stop what sounds like the inevitable? -- Janice R., Terra Haute, Indiana\nA: You will be glad to hear about the latest findings of a French study that looked at the dementia risk for around 5,200 people who were followed for up to 17 years. The researchers found that it is lifestyle choices much more than genetic predisposition that determines whether you will contend with dementia or not. In their words: “a combination of lifestyle and other modifiable risk factors is associated with a lower risk of dementia, regardless of genetic susceptibility, including among those most at risk of Alzheimer’s disease --carriers of the APOE4 gene and other genetic variants as well.”\nThis comes on the heels of a report that found that up to 40% of dementia cases may be delayed or slowed by 12 modifiable risk factors. They include choosing to enjoy a healthy diet; getting regular exercise; engaging in cognitively stimulating activities; avoiding smoking; and moderating or avoiding alcohol, as well as avoiding or managing depression and taking care of any kidney or cardiometabolic problems.\nThis is where Dr. Mike’s book “The Great Age Reboot’s” 6 Normals + 2 gives you the roadmap to slash your dementia risk and gain years of healthy longevity. The steps are: Regain and maintain healthy blood pressure, LDL cholesterol level and glucose level. Maintain a healthy weight. Practice stress management. Dodge all smoke -- primary, secondary and tertiary. The plus two? Keep your vaccines up to date and get a full body check-up and address any problems. Dr. Mike’s book presents 40 ways to protect your brain that, if all used together, might reduce your risk by 90%! And for more advice on dodging dementia, read Dr. Oz’s blog, “The Impact of Lifestyle on Alzheimer’s Disease” at iHerb.com. Get started today to make your tomorrows as sharp -- and fun -- as possible.\n* * *\nDr. Mike Roizen is the founder of www.longevityplaybook.com, and Dr. Mehmet Oz is global advisor to www.iHerb.com, the world’s leading online health store. Roizen and Oz are chief wellness officer emeritus at Cleveland Clinic and professor emeritus at Columbia University, respectively.\n(c)2024 Michael Roizen, M.D.\nDistributed by King Features Syndicate, Inc.\nIf you purchase a product or register for an account through a link on our site, we may receive compensation. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with our Privacy Policy.\nUse of and/or registration on any portion of this site constitutes acceptance of our  User Agreement (updated 4/18/2024),  Privacy Policy and Cookie Statement,  and Your Privacy Choices and Rights  (updated 12/31/2023).\nCookie Settings/Do Not Sell My Personal Information\n© 2024 Advance Local Media LLC. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local.\nCommunity Rules apply to all content you upload or otherwise submit to this site.\nYouTube’s privacy policy is available here and YouTube’s terms of service is available here.\nAd Choices",
      "value": -1.69,
      "type": "health"
  },
  {
    "title": "Here are your 2024 All-Star starters",
    "source": "MLB.com",
    "body": "David Adler\nThe starters for the 2024 All-Star Game presented by Mastercard have been unveiled. Here's who will be taking the field for the American League and National League in the Midsummer Classic on July 16 (8 p.m. ET on FOX) at Globe Life Field.\nThe results of the fan vote to determine this year's All-Star starters were announced on Wednesday on ESPN. The players elected alongside Yankees slugger Aaron Judge and Phillies star Bryce Harper -- who had already earned automatic bids as each league's leading vote-getter in Phase 1 of voting -- include both the game's biggest superstars, like Shohei Ohtani, and electric first-time All-Stars like Gunnar Henderson.\nTen different teams are represented in this year's All-Star starting lineups, with the Phillies leading the way with three representatives, the Yankees, Orioles, Astros, Guardians, Brewers and Padres sending two each, and the Blue Jays, Dodgers and D-backs sending one. There are eight players who were elected starters by the fans for the first time.\nThe complete 2024 All-Star rosters, including pitchers and position player reserves for both teams, will be revealed on Sunday at 5:30 p.m. ET on ESPN.\nThese are your All-Star Game starters for 2024.\nCatcher: Adley Rutschman, Orioles (1st starter election)\nThe Orioles' superstar duo -- Rutschman and Gunnar Henderson -- will be first-time starters alongside each other in the All-Star Game. Rutschman is an All-Star for a second time after being a reserve on the 2023 AL squad, and he's having his best season yet in 2024. The 26-year-old is batting .291 with 15 home runs and 55 RBIs for the first-place O's.\nRunner-up: Salvador Perez, Royals\nFirst base: Vladimir Guerrero Jr., Blue Jays (3rd starter election)\nVlad Jr. is an All-Star for the fourth year in a row, and a starter for the third time in those four years. The defending Home Run Derby champion will look to put his power on display in the Midsummer Classic, where he's homered once before, in his first All-Star Game in 2021. Guerrero is batting .298 with 13 home runs and an .848 OPS this season.\nRunner-up: Ryan Mountcastle, Orioles\nSecond base: Jose Altuve, Astros (6th starter election)\nAltuve, who's batting .308 with 13 homers and 13 stolen bases, is an All-Star for the ninth time in his career and a starter for the sixth time. He's one of only four active players to be voted in by the fans as a starter at least six times, along with Mike Trout (10), Harper (seven) and Judge (six). All of Altuve's starter elections have come as a second baseman; he's behind only Roberto Alomar (nine), Ryne Sandberg (nine) and Joe Morgan (seven) in that category.\nRunner-up: Marcus Semien, Rangers\nSign up to receive our weekly Ben's Biz newsletter to stay updated on Minor League Baseball business and culture\nShortstop: Gunnar Henderson, Orioles (1st starter election)\nHenderson has a case as the best all-around player in baseball this year, and he was able to beat out his fellow shortstop phenom Bobby Witt Jr. to make his first career All-Star Game in what was arguably the most star-studded race on the ballot. The 23-year-old is batting .288 with 26 home runs, 13 stolen bases and a .983 OPS and has been the catalyst of the O's offense all season.\nRunner-up: Bobby Witt Jr., Royals\nThird base: José Ramírez, Guardians (3rd starter election)\nRamírez is now a six-time All-Star but a starter for the first time since his first two Midsummer Classics in 2017 and '18. The 31-year-old has led the Guardians to the top of the AL Central, with 23 home runs, 15 stolen bases and 76 RBIs, and will start the 2024 All-Star Game alongside teammate Steven Kwan. Cleveland is one of four AL teams with multiple starters, along with the Orioles, Yankees and Astros.\nRunner-up: Jordan Westburg, Orioles\nDesignated hitter: Yordan Alvarez, Astros (1st starter election)\nAlvarez has been one of the most feared sluggers in baseball for several years now, but this will be his first All-Star Game start, after he made the AL squad as a reserve in 2022 and '23. That's what happens when you play in the same league as Shohei Ohtani, who started the last three All-Star Games at DH for the AL before jumping to the NL this year. That opened the door for Alvarez, who's batting .297 with 18 homers and a .910 OPS for the red-hot Astros.\nRunner-up: Ryan O'Hearn, Orioles\nOutfield:\nAaron Judge, Yankees (6th starter election)\nJudge and Soto, the Bronx Bombers' two biggest superstars, will start next to each other in the AL outfield. Judge locked up a starting spot as MLB's overall leading vote-getter in Phase 1, and deservedly so: He's leading the Majors with 32 home runs, 83 RBIs and an 1.158 OPS. Only Trout and Harper have earned more starter elections than Judge among active players.\nJuan Soto, Yankees (1st starter election)\nSoto is an All-Star for the fourth year in a row, but this is somehow the first time he'll be starting. He's also making the All-Star team for a third different team in the last three seasons, having done so with the Padres in 2023 and the Nationals in 2022. Soto and Judge are probably the most dangerous duo in baseball -- the 25-year-old is batting .300 with 20 homers and a .997 OPS this season.\nSteven Kwan, Guardians (1st starter election)\nKwan is a first-time All-Star thanks to a tremendous season so far. He's batting .362, which puts him in position to take the lead in the MLB batting race as soon as he gets the few extra plate appearances he needs to qualify for the league leaderboards. Kwan also boasts a .526 slugging percentage and .945 OPS while striking out at one of the lowest rates in the Majors.\nRunners-up: Anthony Santander, Orioles; Kyle Tucker, Astros\nCatcher: William Contreras, Brewers (1st starter election)\nContreras has earned his second career All-Star selection, and his first as a starter, after he made the team as a reserve behind his brother, Willson, in 2022. The Contreras family has now combined to earn the NL starting catcher job four times since 2018, with the only exceptions being Sean Murphy last year and Buster Posey in 2021. William Contreras has a career-high .292 batting average for the NL Central-leading Brewers this season.\nRunner-up: J.T. Realmuto, Phillies\nFirst base: Bryce Harper, Phillies (7th starter election)\nHarper has become a mainstay in the Midsummer Classic at this point, earning his eighth overall selection and seventh as a starter (with his rookie season, 2012, being the lone time he made the game as a reserve). Harper responded from a slow start to the season in a major way, with a .342 batting average and 1.076 OPS over the course of May and June, both of which ended in NL Player of the Month honors.\nRunner-up: None\nSecond base: Ketel Marte, D-backs (2nd starter election)\nThis is Marte’s second All-Star selection, five years after he was voted as a starter during his breakout 2019 season when he finished fourth in NL MVP voting. While the D-backs have largely disappointed this season, currently sitting in fourth place in the NL West after winning the NL pennant a year ago, that’s been no fault of Marte’s. The 30-year-old ranks first or tied for first among qualified second basemen in home runs (17), slugging percentage (.517) and OPS (.871).\nRunner-up: Luis Arraez, Padres\nShortstop: Trea Turner, Phillies (2nd starter election)\nThe Phillies are the first NL team to have at least three infielders voted as starters since the Cubs did so in 2016 -- and those guys had a decent ending to their season. It remains to be seen if the Phillies will do the same, but what is already known is that Turner has quickly returned to prime form after missing six weeks with a hamstring injury. In 13 games since returning from the IL on June 17, Turner -- who earned his third career All-Star selection -- has a .328 batting average, .923 OPS and three homers.\nRunner-up: Mookie Betts, Dodgers\nThird base: Alec Bohm, Phillies (1st starter election)\nWhile his corner infield partner, Harper, is an All-Star veteran, Bohm is anything but, as this is his first career All-Star selection. The third overall pick in the 2018 MLB Draft has put it all together in a breakout season, with a .297 batting average, .349 OBP and .484 slugging percentage that are all career highs in a season where he played at least 50 games. As such, he’s been a major asset in the Phillies holding MLB’s best record.\nRunner-up: Manny Machado, Padres\nDesignated hitter: Shohei Ohtani, Dodgers (4th starter election)\nNo matter which league he’s in, or which position he’s playing, the only constant of this decade has been that Ohtani finds a way to start in the All-Star Game somewhere. This is Ohtani’s fourth consecutive time being voted as an All-Star starter, which is tied with Aaron Judge for the longest active streak in MLB among pitchers or position players (let alone both). Though Ohtani has not pitched this season due to injury, his NL-leading totals in home runs (27), slugging percentage (.646) and OPS (1.048) were handily enough for him to earn another starting nod.\nRunner-up: Kyle Schwarber, Phillies\nOutfield:\nChristian Yelich, Brewers (2nd starter election)\nYelich has seen some major ups and downs during his tenure with the Brewers. He was the NL MVP in 2018, an All-Star starter in 2019, and then he had two straight seasons with a sub-.740 OPS in 2021-22 before getting back on track. Now, that rebound has resulted in his third career All-Star selection and second as a starter, thanks to his NL-leading .329 batting average in 2024.\nJurickson Profar, Padres (1st starter election)\nWho saw this one coming? Profar was a highly touted prospect who made his MLB debut at age 19 in 2012, but his career was slow to take off from there, largely due to a shoulder injury that cost him all of the 2014 and 2015 seasons. Entering the 2024 season, he was a career .239/.322/.383 hitter with no All-Star selections to his name, having just signed a one-year deal with San Diego where he was expected to largely be a backup. Instead, he’s stunned the baseball world with a .311/.404/.472 batting line, earning his first career Midsummer Classic spot.\nFernando Tatis Jr., Padres (2nd starter election)\nSpeaking of Padres outfielders who have bounced back after missing an entire season, Tatis has earned his first All-Star selection since missing all of 2022 due to suspension and injury, and the second of his career. Tatis was a shortstop when he first was an All-Star in 2021, but this is his first selection as an outfielder, thanks to his .821 OPS along with his arm strength that ranks in the 99th percentile of MLB.\nRunners-up: Teoscar Hernández, Dodgers; Brandon Marsh, Phillies; Nick Castellanos, Phillies",
    "value": 0,
    "type": "entertainment"
},
{
    "title": "Galaxy Z Flip 6, Fold 6 are world’s first IP48-rated foldables for dust, water resistance",
    "source": "SamMobile",
    "body": "© 2024 SamMobile \n  SamMobile has affiliate and sponsored partnerships. If you buy something through one of these links, we may earn a commission.  \nLast updated: July 4th, 2024 at 16:14 UTC+02:00 \nSamsung can't stop the leaks! A week before its next Galaxy Unpacked launch event, Galaxy Z Flip 6 and Galaxy Z Fold 6 specifications have leaked in detail. And this leak reveals some exciting things about the Galaxy Z Fold 6's screen and the Galaxy Z Flip 6's battery and performance.\n\nThere is also something really exciting about the durability of both phones.\n\nLegendary leakster Evan Blass (a.k.a @evleaks) has leaked marketing images of the Galaxy Z Flip 6 and the Galaxy Z Fold 6 via his Substack newsletter. Leaked images reveal that both phones use the Armor Aluminum material for their frame and the Gorilla Glass Victus 2 protection for the cover screen. It was expected that Samsung would use a titanium frame for the Galaxy Z Fold 6, but that doesn't appear to be the case.\n\nMore importantly, the Galaxy Z Flip 6 and the Galaxy Z Fold 6 are IP48 rated for dust and water resistance. While not as good as the IP68 rating for high-end bar-style phones, it is still a major improvement from the IPX8 rating usually seen on foldable phones.\n\nThe Galaxy Z Flip 6 uses the same sized displays—a 3.4-inch cover screen and a 6.7-inch foldable screen—as its predecessor. The 3.4-inch OLED screen keeps the 720 x 748 pixels resolution and runs at 60Hz, while the 6.7-inch Dynamic AMOLED 2x screen has Full HD+ resolution and a 120Hz variable refresh rate.\n\nThe Galaxy Z Fold 6 has a 6.3-inch Dynamic AMOLED 2x screen with HD+ resolution and a 7.6-inch Dynamic AMOLED 2x screen with QXGA+ resolution. Both screens have a 120Hz variable refresh rate and a peak brightness of up to 2,600 nits. That's matching the screens on the Galaxy S24 Ultra.\n\nBoth phones use the Snapdragon 8 Gen 3 For Galaxy processor with 12GB RAM and 256GB/512GB storage. The Galaxy Z Fold 6 might also be available in a 1TB storage variant. Both phones run Android 14-based One UI 6.1.1 software. The Galaxy Z Flip 6 has a vapor chamber system for more efficient cooling, which is the first in a Galaxy Z Flip series phone.\n\nBoth phones also have Galaxy AI, so you can use features like Circle to Search, Interpreter Mode, and Notes Summarization. But we can't spot any new Galaxy AI features that were rumored earlier. The Chat Assist feature seems to have improved and optimized for the Galaxy Z Flip 6's cover screen, making it easier to reply to messages through context-sensitive replies suggested by Galaxy AI.\n\n\n\nThe Galaxy Z Flip 6 has a 50MP primary camera, a 12MP ultrawide camera, and a 10MP selfie camera. It can record 4K 60fps videos using all its cameras.\n\nThe Galaxy Z Fold 6 has a 50MP primary rear camera, a 12MP ultrawide camera, a 10MP telephoto camera (3x optical zoom), a 10MP front-facing camera on the cover screen, and a 4MP front-facing camera on the inner screen. It can record 4K 60fps videos using all its cameras, just like the Galaxy Z Flip 6, but it can also record 8K 30fps videos and 4K 120fps slow-motion videos using the primary camera.\n\nDespite its 4,000mAh battery, an upgrade over the Galaxy Z Flip 5's 3,700mAh battery, the Galaxy Z Flip 6 is thinner than its predecessor. It measures 85.1 × 71.9 × 14.9mm and weighs 187g (same as Z Flip 5).\n\nThe Galaxy Z Fold 6 measures 155.5 x 152.6 x 5.6mm when unfolded and 85.1 x 71.9 x 14.9mm when closed. It weighs 239g, 14g lighter than the Galaxy Z Fold 5. Similar to its predecessor, it has a 4,400mAh battery. The complete specifications of both phones are posted below.\n\nBoth phones have a side-mounted fingerprint reader, stereo speakers, dual-SIM card slot, GPS, 5G (sub-6GHz), Wi-Fi 6E, Bluetooth 5.3, NFC, and a USB 3.2 Gen 1 Type-C port. Only the Galaxy Z Fold 6 has Samsung DeX, though.\n\nThe story continues after our video below.\n\n\n\nSamsung claims that the Galaxy Z Flip 6 lasts up to 20 hours of web browsing on Wi-Fi (19 hours on LTE), 23 hours of video playback, and 68 hours of wireless audio playback. These figures are noticeably better than the Galaxy Z Flip 5.\n\nThe Galaxy Z Fold 6 is claimed to last up to 18 hours while browsing the web, 23 hours during video playback, and 77 hours during wireless audio playback. These figures are only slightly better than the Galaxy Z Fold 6. Charging speeds haven't been revealed in these images. \nYou might also like\nSamsung introduced Galaxy AI with the Galaxy S24. It offers a plethora of AI-powered tools, including the ones to summarize webpages, translate text and audio from one language to another in real-time, and edit photos, which can come in very handy in day-to-day usage. When Samsung introduced Galaxy AI, the company said that people would […]\nSamsung collaborated with popular K-pop music band BTS for a few years to promote its high-end phones. However, the boy band went on a hiatus in 2023, so it looks like Samsung is collaborating with another K-pop band. The company mentioned a collaboration with TXT before its next Galaxy Unpacked event. Samsung to collab with […]\nEarlier today, detailed Galaxy Z Flip 6 specifications were leaked. Now, some more features of the upcoming foldable phone have been leaked, revealing a new feature that uses the cover screen intelligently during language translation. One UI 6.1.1 uses Galaxy Z Flip 6's cover screen intelligently for language translation Thanks to the marketing images of the […]\nWe're exactly one week away from Samsung's big launch event of the year, where the company will introduce a wide range of sequels, new ideas, and even a brand-new device category. There's a lot of hype around Galaxy Unpacked 2024, especially given its location and how the event almost coincides with the Paris 2024 Olympics. […]\nLess than a week remains before Samsung announces the Galaxy Z Flip 6 and the Galaxy Z Fold 6. As is always the case with Samsung's unannounced devices, almost all the features and specs of the upcoming foldables have leaked. However, some newly leaked Galaxy Z Flip 6 images show how Samsung is planning to […]\nSamsung might have a pleasant surprise in store for Galaxy Z Fold 6 and Z Flip 6 buyers, as a new report claims that the company is in a generous mood and plans on giving away one of its best wearables. According to this new nugget of information shared by @rquandt on X, Samsung intends […]\nReviews\nBest picks\nDevices\nSamsung Galaxy F55\nSM-E556B\nSamsung Galaxy M55\nSM-M556B\nSamsung Galaxy M15\nSM-M156B\nSamsung Galaxy C55\nSM-C5560\nSamsung Galaxy A55\nSM-A556E\nSamsung Galaxy A35\nSM-A356E\nSamsung Galaxy S24\nSM-S921B\nSamsung Galaxy S24 Plus\nSM-S926U\nOpinions\nNotebook\nTV\nSocial media\n© 2024 SamMobile\nWe'd like to show you notifications for the latest important news and updates",
    "value": 0,
    "type": "general"
},
{
    "title": "'It's a disaster': Hurricane Beryl batters Jamaica",
    "source": "BBC",
    "body": "Powerful Hurricane Beryl has hit Jamaica with heavy winds and rain, damaging buildings and felling trees on the Caribbean island.\nThe category four storm brought winds of up to 130mph (215km/h) on Jamaica's southern coast.\nSocial media photos show floodwater pouring down streets, with roofs ripped off by the wind.\nThe storm has killed at least seven people so far as it sweeps across the Caribbean. It has now been downgraded to a category three storm, and is due to make landfall in Mexico later on Friday.\n\"It's terrible. Everything's gone. I'm in my house and scared,\" Amoy Wellington, resident of a rural farming community in the southern St Elizabeth parish, was quoted as saying by Reuters news agency.\n\"It's a disaster.\"\nPrime Minister Andrew Holness earlier urged people to \"take this hurricane seriously\". \n\"If you live in a low-lying area, an area historically prone to flooding and landslide, or if you live on the banks of a river or a gully, I implore you to evacuate to a shelter or to safer ground,\" he said.\nThree people died in Grenada, where it first made landfall on Monday, one in St Vincent and the Grenadines, and another three in northern Venezuela, which was hit by strong winds and flooding. \nAbout 90% of homes were destroyed or severely damaged on Union Island, which is part of St Vincent and the Grenadines.\nParts of Jamaica earlier experienced disruption to power and electricity supplies, with the Jamaica Public Service Company (JPS) saying it was forced to pause restoration of power lines in some locations for the safety of their workers. \nIn a news briefing, the NHC's director, Dr Michael Brennan, said Jamaica would experience \"devastating hurricane force winds\".\nRainfall in some parts of the country could hit 12in (30cm), potentially leading to flooding and mudslides, the director explained, while life-threatening storm surges as high as 9ft (2.7m) above tide level are also expected.\n\"Everybody in Jamaica needs to be in their safe place and be prepared to stay there for at least the next 12 hours,\" Dr Brennan warned.\nThe BBC's Nick Davis said Jamaicans had been rushing to supermarkets earlier in the week to get \"as much as they could as quickly as they could\".\nJamaica's Information Minister Dana Morris Dixon said the island had 900 shelters to house people who needed to leave their homes.\nIn Venezuela, Hurricane Beryl brought heavy rains which caused a river to overflow in the northern state of Sucre. Three people died and several are still missing.\nA government delegation was hit by a falling tree while inspecting damage.\nPresident Nicolás Maduro said Vice-President Delcy Rodríguez was among those injured. He said she was \"very bruised but conscious\".\nIn Mexico, where Hurricane Beryl is expected in the coming days, residents in Cancún have rushed to supermarkets to stock up on supplies. Some have encountered empty shelves.\nThe NHC said that Hurricane Beryl had formed much earlier in the hurricane season than usual.\nMeteorologists have also remarked on how quickly Beryl developed.\nThe storm strengthened from a tropical depression into a major hurricane in 42 hours, hurricane expert Sam Lillo told the Associated Press news agency.\nIn Texas, officials warned residents to prepare for the possibility of Beryl's arrival this weekend. \nOn Tuesday, Governor Greg Abbott told resident's near the state's Atlantic coast to \"keep an eye on the gulf\" and \"have an emergency plan to take care of yourself and your loved ones\".\nThe US National Oceanic and Atmospheric Administration has warned that the North Atlantic could get as many as seven major hurricanes this year - up from an average of three in a season.\nBeryl is the earliest category five Atlantic hurricane on record, fuelled by exceptional sea warmth.\nThousands in the region, home to tourist hotspots Tulum and Cancún, are being evacuated.\nTwo community relief efforts have been launched in Ladbroke Grove and Westbourne Park.\nBarbados, St Vincent and Grenada are recovering as the storm heads to Jamaica\nJeremie Tronet tells the BBC about the devastating destruction of the storm on the island where he has lived for 15 years.\n\nCopyright 2024 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
    "value": -1.42,
    "type": "general"
},
{
    "title": "Jeffries seeks to stem House defections, for now, as Democrats panic over Biden",
    "source": "Washington Post",
    "body": "Only two sitting House Democrats had called on President Biden to exit the presidential race as of Wednesday night.\nAs of early Wednesday morning, President Biden had called just one congressional leader personally in the wake of his faltering debate performance: Hakeem Jeffries.\nThat the president chose Jeffries is perhaps not surprising. The New York Democrat may be the only thing standing between Biden and a flood of panicked House Democrats — few of whom have so far gone on the record — demanding the president exit the race, hopefully saving their chances of regaining the slender House majority in the process.\nOn Wednesday evening, Jeffries led a tightly controlled conference call of House Democratic leaders as concern over Biden ricocheted on and off Capitol Hill. According to four people who either participated on the call or were briefed on it, the leader mainly listened, as some panicked participants worried about Biden’s electability and said the president should step aside. Some argued, however, according to one person on the call, that it would be too “messy” to replace him. Jeffries acknowledged being concerned about Biden’s situation but held his fire, according to one person familiar with the call.\nSo far, the would-be House speaker has succeeded in stemming a tide of defectors calling for Biden’s exit after a debate last week in which the president noticeably stumbled at times, spoke in a thin voice, mumbled words and occasionally looked confused. It was a performance that drew immediate worries among Democrats concerned about his age and perceived fragility among voters.\n“There was a real effort of the leadership team to keep unity, if not unanimity,” said a lawmaker on the Wednesday evening call attended by members of House Democratic elected leadership.\nJeffries asked his leadership team to keep talking with each other, their colleagues and their constituents and to stay in touch.\nAmid the mounting storm, Jeffries has remained careful and steady.\n“As he has for every big decision, once again, Leader Jeffries is in ‘listening mode,’ taking the time to hear members about the impact in their districts and carefully assessing the path forward,” said Rep. Ann Kuster (D-N.H.), the head of the moderate New Democrat Coalition. “Patience is a virtue. Democratic unity is top of mind for our leadership.”\nJeffries has not asked lawmakers to defend the president, according to multiple members who have spoken directly with him. But he has asked them to give Biden the grace to make his own decision about whether to remain in the presidential race. Jeffries has reminded Democrats not to act irrationally, and to allow this week to play out before making any statements. He prefers hashing things out as a group when Democrats return to Washington next week.\nThe story of how Jeffries is handling perhaps the biggest political crisis of his House leadership — he’s only been in the job a little over a year and a half — is based on interviews with roughly a dozen House Democratic lawmakers and over a dozen aides, who spoke on the condition of anonymity to talk extensively about ongoing private conversations within the caucus regarding their party’s president.\nThe rapidly moving news has once again thrust Jeffries into the middle of a defining moment. But unlike helping Republicans fund the government, averting a debt crisis or sending critical aid to foreign allies, Jeffries is navigating uncharted and very choppy waters four months out from Election Day.\nAs of Wednesday afternoon, Biden’s aides are insisting he won’t step aside. Biden press secretary Karine Jean-Pierre told reporters that the president was “absolutely not” dropping out of the race.\nAnd it seems like Jeffries, at least for now, would prefer that his members not ask Biden to.\nOnly two House Democrats — Reps. Lloyd Doggett (Tex.) and Raúl Grijalva (Ariz.) — had publicly called for Biden’s exit, though several others have tread a middle ground in saying Biden can’t beat Trump in November.\nIt’s a delicate position for Jeffries, who is expected to be speaker if Democrats retake the House majority — caught between a Democratic president and his own fretting, angry members.\n“Hakeem is a big part of the Democratic unity we’ve shown for the past two years. So when he’s ready to provide guidance on this question, I am certain that many members will be glad to receive it and will probably find it very persuasive,” said Rep. Jared Huffman (D-Calif.), who was not on Wednesday night’s call.\nOver the past few days, House Democrats said they felt “gaslit” by the White House and Biden campaign’s weak reassurances that everything remains fine, and some fear the relationship between House Democrats and the president is “irreparable.”\nWorried House Democrats are circulating draft letters that call on Biden to step aside. Democrats are informally brainstorming how to run their races without Biden at the top of the ticket in a flurry of group texts. Above all, most remain focused on their No. 1 goal: a House Democratic majority, which requires reminding voters on the campaign trail what a Democratic House was able to accomplish under a Democratic administration.\nWhen donors ask Jeffries what to do, he directs them to channel their concerns into House races. He has tried to reassure all Democrats who have reached out to him in calls or texts that the House can serve as a backstop to a potential Republican Senate and White House, though people familiar with his thinking stress he does not mean to infer that Biden will lose the election.\nJeffries and other leaders are aware that a wave of private frustrations could soon spill into public view. Two centrist Democrats — Reps. Jared Golden (D-Maine) and Marie Gluesenkamp Perez (D-Wash.) — have predicted Biden will lose to Trump. After officials insisted Biden would stay in the race, Rep. Seth Moulton (D-Mass.), a liberal, expressed late Wednesday his “grave concerns” about Biden’s “ability to defeat Donald Trump.”\n“Winning will require prosecuting the case in the media, in town halls, and at campaign stops all over the country. President Biden needs to demonstrate that he can do that,” Moulton said. “When your current strategy isn’t working, it’s rarely the right decision to double down. President Biden is not going to get younger.”\nJeffries has managed to contain the defections thus far, often reminding colleagues in numerous communications that they cannot undo something once it’s been said publicly.\nIn typical Jeffries style, he has spent the week gathering input from across the caucus so he could accurately reflect the mood in calls with White House Chief of Staff Jeff Zients and other officials.\nDespite the chaos, Jeffries has largely been able to keep members united and optimistic about their chances of winning back the House majority. Democrats need to clinch four seats to do so, and members acknowledge that Jeffries is eager to become speaker.\nJeffries’s listening style and frequent communication with members is what many believe has led colleagues to be deferential to his guidance. In a Tuesday evening call with the most vulnerable Democrats up for reelection — known as the “frontliners” — Jeffries heard from frustrated members who raised their concerns over Biden and his ability to stay in the race.\nOne member who spoke with Jeffries on Wednesday noted that while many Democrats are circulating letters or discussing going public, they did not want to get ahead of their leader’s public statements and feel confident he “shares the concerns we all have.”\nBeyond expressing caution, members say that Jeffries has not been explicit in either defending or championing Biden.\n“I didn’t get any indication that he was someone who was trying to silence anyone,” Golden said, who was one of the first Democrats to hear from Jeffries behind closed doors after the debate Friday and has not heard from anyone in leadership since declaring Biden would lose to Trump in an op-ed.\nJeffries hasn’t disagreed with members that Vice President Harris would be the best option to lead the ticket if Biden chooses to step aside, said two people familiar with this thinking who spoke on the condition of anonymity to detail private conversations. But he is not openly contemplating that scenario.\nIn the days after the debate, Jeffries in public remarks acknowledged the reality of Biden’s disappointing debate performance. But he did not break with the president.\nAt a New York fundraiser that raised $3 million for House Democrats, Jeffries asked former president Barack Obama how voters should view Biden’s performance — which he called a “setback” making way for an opportunity for a “comeback.” Obama replied that politics was a “team sport” and that winning back the House majority should be “sufficient motivation” for donors to support the Democratic ticket.\nDuring a speech in Hartford, Conn., over the weekend before roughly 1,000 attendees, Jeffries reiterated his position, adding that Trump was an existential threat to democracy. He praised Biden for being “a good man, a family man, an honorable man” who is up against “a con man.”\n“The Democratic Party stands on the side of freedom,” Jeffries said in a keynote speech. “The Democratic Party will always stand on the side of truth, which is why it’s an all-hands-on-deck moment to win in November. Because the stakes are too high for us to do anything, other than pour our heart and our soul into victory on Nov. 5, all across the board.”\nDemocratic strategists working to flip the House have advised candidates to continue talking about the issues and counseled them to navigate the Biden situation however they think is necessary in their district.\nRep. Nanette Barragán (D-Calif.) praised Jeffries’s leadership style in an interview, calling him a “listener” who governs “with a sense of keeping us all united — and to do it very calmly.” She added that he was among the best messengers in the Democratic caucus.\nBut another Democratic lawmaker groused that there was a lack of effort to gather House Democrats as panic-stricken members privately express grave concerns about Biden’s ability to stay the course.\n“We haven’t had a single caucus meeting or call since the debate,” the lawmaker said.\nIt’s for that reason many Democrats know next week’s caucus meeting Tuesday morning will be a momentous test of Jeffries’s ability to wrangle emotional lawmakers privately airing their opinions together for the first time.\nSome House Democrats are upset with the Biden campaign’s argument that they should back the president because the election’s stakes are so high, considering that argument condescending. Many lived through the Trump administration and understand the stakes after surviving the Jan. 6, 2021, insurrection in the Capitol while Biden and his top officials were not in office. The Supreme Court’s decision to grant immunity to a president’s official acts has further reinforced fear of Trump winning the election.\nOne Democratic frontliner who spoke with the Biden campaign over the weekend said they were shocked to hear officials still defending Biden’s performance as a “bad night” and insisting the president is “ready to serve.” This frontliner complained that campaign aides failed to provide a clear road map demonstrating how the president would show Americans he is capable of the job. Another frontliner said that campaign officials reached out on Friday, largely to ensure they wouldn’t speak out against the president, which they did not find reassuring.\nWhat uniformly had irked Democrats was Biden’s lack of communication with Jeffries. That all changed Wednesday evening — but a handful of Democrats considered it too little too late.\n“It’s untenable for him to be the nominee if half of his own party in Congress is saying he should go,” a senior congressional aide said.\nJosh Dawsey and Liz Goodwin contributed to this report.",
    "value": -6.72,
    "type": "general"
},
{
    "title": "What's open and closed on July 4th? Details on stores, restaurants, Walmart, Costco, Target, more",
    "source": "USA TODAY",
    "body": "Banks and post offices will be closed on Thursday, July 4 in observance of Independence Day, however most major restaurant, grocery and retail store chains will remain open on the holiday.\nCompanies such as Walmart, Starbucks, Chick-fil-A and Target, among many others, will keep their doors open on the federal holiday this year. The stock market, however, will also be closed on Thursday.\nThe origins of the Fourth of July date back to when Philadelphians marked the first anniversary of American independence with a \"spontaneous celebration,\" which is described in a letter by John Adams to his daughter, Abigail, according to the Library of Congress.\nHowever, the annual observation of the holiday only became a regular occurrence after the War of 1812, where events such as groundbreaking ceremonies for the Erie Canal and the Baltimore and Ohio Railroad were scheduled to coincide with Fourth of July festivities. Congress passed a law making Independence Day a federal holiday on June 28, 1870.\nHere is what you need to know about what is open and closed on the Fourth of July this year.\nLearn more: Best current CD rates\nWalmart stores will be open from 6 a.m. to 11 p.m. on the Fourth of July, a company spokesperson told USA TODAY. However it is best to reach out to your local Walmart or check the online store directory before heading to the store.\nAccording to Costco's website, warehouses will be closed on Thursday, July 4.\nYes, Target stores will be open on the Fourth of July, the company told USA TODAY. Store hours vary by location, so check with your local store regarding its specific holiday hours.\nThe following restaurants are open on July 4. Hours are displayed for companies that provided them.\nHere's which grocery stores are open on July 4. Hours are listed for the companies that provided them.\nCostco warehouses will be closed on Thursday.\nStores listed below will be open on July 4. Hours are listed for the companies that provided them.\nGabe Hauari is a national trending news reporter at USA TODAY. You can follow him on X @GabeHauari or email him at Gdhauari@gannett.com.",
    "value": -3.85,
    "type": "general"
},
{
    "title": "Where's Macron? French president disappears amid election crisis",
    "source": "POLITICO",
    "body": "The leader underestimated how much the public were turned off by his personality, one party official told POLITICO.\t\t\t\nPARIS — The last time Emmanuel Macron was spotted in public, he was sporting a dark aviator’s jacket, Top Gun sunglasses and a black baseball cap.\nHis incognito rock star look, as he voted in the coastal town of Le Touquet Sunday, attracted plenty of attention on social media and rolling news channels.\nBut despite that moment of swagger, the truth is that Macron has taken a step back from public view lately. Apart from planned international commitments, he hasn’t been seen out and about for almost two weeks.\nLast Sunday, instead of Macron appearing on television to comfort his wounded troops after a stunning defeat in the first round of the parliamentary election, the Elysée Palace issued a brief statement from the president calling for unity.\nFor the first time, Macron’s centrist alliance, already bruised and battered after a defeat in June’s European election, has been waging a desperate battle without its leader.\nAnd the reality is his allies don’t want him on the campaign trail: Macron’s face is even being removed from campaign literature.\n“He was told to stop [campaigning] … And it’s not really that he heard our message, it’s more that he was forced to hear it,” said a Renaissance party official, who was granted anonymity to discuss a sensitive issue.\n“[The president] underestimated how much the public were turned off by his personality,” the official added. \nIn recent weeks, several party heavyweights have lobbied for Macron to stay away from the campaign, in what one key ally called a necessary “de-Macronization.” One minister even admitted on public television that Macron’s image was “worn out.”\nFor the loquacious, daring 46-year-old president, who is forever grabbing the limelight, coming up with new ideas, disrupting the status quo, the new reality is not a comfortable one.\nBut like a Napoleon forced into exile, Macron has returned to the drawing board and is preparing his next battle: ruling France after what is expected to be a resounding defeat on Sunday. The French president may have to enter into a “cohabitation” government with Marine Le Pen’s National Rally party, which is expected to command the largest group in parliament.\nOver the past days, Macron has been busy shoring up his influence, appointing several top officials in France and pushing for allies to get key jobs in Brussels, drawing accusations from Le Pen that he was organizing “an administrative coup d’état.”\nOn Wednesday, the government’s spokesperson announced new appointments in the police and security forces after the weekly Cabinet meeting. Dozens of top military officials have also been appointed in the army, the navy and the air force.\nMore appointments were expected, but faced with a growing outcry over the administrative reshuffle, the president was forced to scale back his plan. One person familiar with talks at the Elysée ironically called it “a minor backtracking,” according to Playbook Paris.\nEnsconced in the Elysée Palace, the president is also gaming next-day scenarios, which includes a sweeping victory for the far right, a hung parliament with the National Rally as its largest group, and a coalition excluding the far right, according to several officials.\nSeveral Macron allies have floated the possibility of building a loose coalition, similar to what parties in Spain or Germany are able to do.\n“Maybe it’s an opportunity to reinvent the way we govern,” said French PM Gabriel Attal on radio, adding that “a plural National Assembly” could emerge from the election, with “with several political groups from the right, the left and the center that could work together, one project at a time.”\nBut such an alliance depends on Sunday’s results and would only be possible if Macron agreed to work with the far left, or if the Socialists, the Greens and the Communists agreed to break with their coalition partner the France Unbowed. Both prospects appear very remote.\nBut how long will Macron stay away from the cameras? Not long it seems.\nOn Sunday evening, once the scale of the National Rally’s victory is known, the president will have to pivot to choosing a new prime minister, which could take weeks if there’s no clear majority in parliament.\n“He will again take the lead as the guarantor of France’s institutions,” said the same party official quoted above. If the far right wins a very large majority, Macron would be under pressure to nominate the National Rally’s leader Jordan Bardella as prime minister. If not, the president could get involved in lengthy coalition talks with his current rivals on the left and the right.\nBut it’s hard to see how the relationships with Macron’s liberal allies will be mended and his image improved with the general public. His popularity rating has plummeted in recent weeks, according to several polls.\nFor more polling data from across Europe visit  POLITICO Poll of Polls.\nOn the campaign trail, Attal, one of the few popular figures in government, smiles with gritted teeth when punters tell him they don’t like his boss. With French politics in turmoil, Macron has been described as “crazy,” “an agent of chaos” and blamed for overseeing a “fiasco.”\nNo amount of Top Gun mojo is going to change that in the short term.\nPauline de Saint-Remy and Laura Kayali contributed reporting. \nEarly projections show National Rally on course for victory in the vote for a new parliament as Emmanuel Macron’s election gamble backfires. \nMilitary and foreign policy have long been seen as the “reserved domain” of the president — but the far right is challenging that assumption.  \nGrowing grievances over a rural-urban divide help Marine Le Pen’s National Rally make inroads. \nFrench political circles are openly discussing the possibility of a very Italian option: an emergency government of experts. ",
    "value": -5.76,
    "type": "general"
},
{
    "title": "Christina Applegate Says She Wants to Do ‘Shots With Cher’ With ‘Days I Have Left’",
    "source": "Rolling Stone",
    "body": "In the summer  of 2021, Christina Applegate revealed that she had been diagnosed with multiple sclerosis. Since then, she has been candid about her experience and raising awareness about the autoimmune disease, and on Tuesday, the actress shared some things she’d like to do “with the days I have left in life.”\n\n\tIn a post shared to X, Applegate wrote, “There are things I want to do with the days I have left in life,” adding, “I want to work with Shirley MacLaine And do shots with cher! And yes my days are so big. Just saying.”\nThere are things I want to do with the days I have left in life. I want to work with Shirley MacLaine   And do shots with cher! And yes my days are so big. Just saying.\n\n\tApplegate has previously voiced her admiration for MacLaine — the multiple award-winning actress behind Terms of Endearment, Coco Chanel, Steel Magnolias, and more recently, featuring in Downton Abbey and Only Murders in the Building. “I wish I could work with Shirley MacLaine That’s all. Woke up and that dream I have had for my whole life, washed over me,” the Dead to Me actress wrote on social media in June. “And I wept for a minute. And I’m sure I will again. Oh and Shirley, I don’t have your number anymore so…….”\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\tTrending\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tNeil Gaiman Denies Sexual Assault Allegations Made by Two Women\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe Men Who Filmed 'Hawk Tuah' Think They Should Be Famous, Too\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tKendrick Lamar's Victory Lap Continues With 'Not Like Us' Video\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tGod Bless America, Willie Nelson's Back Onstage for 4th of July Concert\t\t\n\t\n\n\n\n\n\n\n\n\n\tThe beloved actress received a standing ovation at the Emmy Awards in January, where she presented the award for Best Supporting Actress in a Comedy. In a moment of levity, Applegate joked: “You’re totally shaming me, with a disability, by standing up — it’s fine!” \n\n\n\n\tThis year, she launched the podcast, MeSsy, with co-host Jamie-Lynn Sigler (who revealed in 2016 that she was diagnosed with MS when she was 20) to discuss their shared struggles with MS and help others in the process.\nWe want to hear it. Send us a tip using our anonymous form.\nRolling Stone is a part of Penske Media Corporation. © 2024 Rolling Stone, LLC. All rights reserved.",
    "value": -13.57,
    "type": "general"
},
{
    "title": "Anyone who fell did not get up: Survivors recall chaos and confusion at deadly crush in India ",
    "source": "CNN",
    "body": "Witnesses have recounted scenes of chaos and confusion after a religious festival in northern India ended in tragedy when scores of people were killed in a crowd crush.\n    \n\n            At least 121 people died – almost all of them women – and 35 others were injured when overcrowding at a sermon in Mughal Garhi village in Uttar Pradesh led to the deadly crush on Tuesday. Police said they were investigating the organizers, saying a quarter of a million people arrived at the venue – more than three times the number expected – and just a few dozen police officers had been deployed.\n    \n\n            The crush happened as female devotees rushed toward the stage to touch the feet of Bhole Baba, the self-styled godman, or guru, who led the event, according to Uttar Pradesh’s chief minister. Other officials said devotees were trying to collect ground that his car had passed over as he left the ceremony.\n    \n\n            Speaking to CNN from a local hospital, security guard Subhash Lal said his mother had died in the crush and blamed “carelessness” for the tragedy.\n    \n\n            “My mother’s dead body is here (at this hospital)… The most pain you can feel is for a mother, everyone knows that,” he said.\n    \n\n            “If there was no carelessness then people would not have died like this, whether it’s the administration or organizers, it’s carelessness.”\n    \n\n            The mother of a victim who gave her name as Kamala told Reuters: “My daughter was alright when she arrived at the hospital. In fact, my daughter served water to other victims, helped them and called my brother informing us that she had made it to the hospital safely. But by the time my brother reached the hospital, my daughter was dead.”\n    \n\n            Describing the chaos at the gathering, a survivor named Rekha told Reuters the crush occurred after the preaching had ended, saying: “Anyone who fell did not get up, was trampled by the crowd and died.”\n    \n\n            Chedilal, a 65-year-old man whose 30-year-old daughter was killed in the crush, said: “We were together. I saw many dead bodies lying there so I ran to where the buses were parked.\n    \n\n            “I looked for her everywhere but I could not find her anywhere, it became night. Where could I go? What could I do?\n    \n\n            “I was told to go to the district hospital and here I found her body.”\n    \n\n            Tuesday’s incident, the latest in a string of similar tragedies, has highlighted glaring gaps in the country’s safety measures at such events as police investigate allegations of negligence and remain on the hunt for Bhole Baba, also known as Suraj Pal.\n    \n\n            Some 250,000 people were at the event, despite authorities giving permission for a gathering of 80,000, a police report seen by CNN shows.\n    \n\n            The report also alleged that event organizers gave no assistance to the injured and attempted to cover up the incident by hiding clothes and shoes that people had lost in the crush in a nearby field.\n    \n\n            Police have accused the event’s organizers of culpable homicide not amounting to murder, wrongfully restraining a person, causing disappearance of evidence or providing false information, the report said.\n    \n\n            CNN has attempted to contact the organizers for a response.\n    \n\n            Uttar Pradesh has launched a special investigative team to probe the deadly crush, the state’s chief minister announced on Wednesday.\n    \n\n            A judicial inquiry will also be carried out under the state’s high court, Chief Minister Yogi Adityanath said.\n    \n\n            Adityanath suggested the organizers were to blame, telling reporters “the administration assumes that at such a function, internally, the security of devotees would be managed by the organizers.”\n    \n\n            “For security, the administration deploys its force as well, but in the outer ring. Inside it is the organizers managing everything,” he said.\n    \n\n            In a statement he shared via his lawyer, Bhole Baba offered condolences to the families of those killed as he blamed the fatal crush on “anti-social elements.”\n    \n\n            Questions have been raised over gaps in the safety protocols in place at Tuesday’s event, prompting authorities to launch a high-level investigation and lawyers to file a public interest litigation in Allahabad High Court, demanding an inquiry into the deaths.\n    \n\n            Crowd crushes at religious gatherings in India, the world’s most populous country of 1.4 billion, are not uncommon owing to the lack of strict crowd control measures.\n    \n\n            In January 2005, more than 265 Hindu devotees were killed and hundreds more injured at a temple in the western state of Maharashtra – one of the deadliest such incidents in the country’s recent history. Three years later, about 145 Hindu pilgrims died on a mountaintop temple in northern India after rumors of a landslide triggered a crowd crush, Reuters reported.\n    \n\n            The public interest litigation also pointed to two other events in 2011 and 2013, where more than 100 people were trampled to death at two separate Hindu religious events.\n    \n\n            “The administration must learn and must adapt the preventative measures after witnessing of earlier incidents… but they have no regard for the life of the general public,” the court document said.\n    \n\n            Opposition politicians have also raised concerns over Tuesday’s incident.\n    \n\n            “It’s very unfortunate,” said Renuka Chowdhury, a lawmaker from India’s largest opposition party, the Indian National Congress.\n    \n\n            “Incidents like this shouldn’t happen again,” she told Indian news agency ANI. “We should examine our conscience, and see where we can control, guide and monitor the crowd.”\n    \n© 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.",
    "value": -6.60,
    "type": "general"
},
{
    "title": "WH reporters admit being 'turned off' from exposing Biden's mental decline because of 'right-wing media' hype",
    "source": "Fox News",
    "body": "Some members of the White House press corps who have regular exposure to President Biden are now admitting they were 'turned off' from exposing his mental decline before last week's debate in part because of the attention it has got from 'right-wing media.' \n\n Since Biden's shocking debate performance, the legacy media has faced intense backlash from critics accusing them of participating in a cover-up on behalf of the president. \n\n CNN reported Tuesday that reporters working from 1600 Pennsylvania Ave. are now expressing regret for not pursuing the political bombshell more seriously.\n\n However, some are admitting they didn't want to feed into the 'right-wing talking point' about 81-year-old Biden. \n\n 'Biden’s age was also a right-wing talking point for years, something the White House was quick to point out to reporters, which may have inadvertently turned off any serious investigation,' CNN reported. \n\n The report accused 'right-wing media figures' of sharing 'deceptively edited clips' of Biden, citing the one from the G7 Summit where Biden stepped away from other world leaders to give a thumbs up to parachutists off-camera, prompting Italian Prime Minister Giorgia Meloni to corral him back to the group for a photo-op, rejecting allegations he was 'wandering off.' \n\n 'The right-wing media was calling him senile from day one, and that wasn’t true,' one unnamed reporter told CNN. \n\n 'Then whenever you report on the age you were in some ways solidifying, giving credence to some people that were actually of bad faith.'\n\n 'By merely existing and calling a spade a spade, Conservative media ‘turned off’ legacy reporters from seriously investigating Biden's mental acuity,' Washington Free Beacon reporter Andrew Kerr reacted. \n\n 'How pathetic and lame. I thought journalism was about ‘following the facts,’' Fox News contributor Katie Pavlich knocked the White House reporters. \n\n 'The entire media had no interest in investigating Biden’s obvious senility because their political opposition was accurately describing him as senile They’re just straight up admitting that they have no interest in stories that hurt their political party,' Outkick writer Ian Miller said. \n\n Biden's shocking debate performance has become a political earthquake with wide swaths of the liberal media calling for him to withdraw from the presidential race. Both Biden and the White House have repeatedly insisted he is staying in the contest. The White House also denied reports Wednesday that Biden told a key ally he was considering stepping aside. Top Democrats have also rallied behind the president. ",
    "value": 11.61,
    "type": "general"
},
{
    "title": "Israeli strike kills senior Hezbollah commander in Lebanon",
    "source": "AP News",
    "body": "Hezbollah has said one of its senior commanders was killed in an Israeli air strike in southern Lebanon, with the Iran-backed armed group retaliating with a barrage of rockets against Israel.\nMohammed Nimah Nasser is the latest senior member of Hezbollah to be targeted by Israel during almost nine months of cross-border violence which have raised fears of an all-out war.\nHezbollah said it had launched 100 rockets and missiles at Israeli military positions “as part of the response to the assassination”. The Israeli military said a number of projectiles which fell in open areas sparked fires, but no injuries were reported.\nThe military said Nasser commanded Hezbollah’s Aziz Unit, which is responsible for launching rockets from south-western Lebanon, and accused him of directing a “large number of terror attacks”.\nIt also described him as “the counterpart” of Taleb Sami Abdullah, the commander of another unit whose killing last month prompted Hezbollah to launch more than 200 rockets and missiles into northern Israel in a single day.\nSince then, there has been a flurry of diplomatic efforts to de-escalate tensions, with the UN and US warning of the potentially catastrophic consequences of a war that could also draw in Iran and other allied groups.\nThere have been almost daily exchanges of fire across the Israel-Lebanon border since the day after the start of the war between Israel and Hamas in Gaza on 7 October.\nHezbollah has said it is acting in support of the Palestinian group that is also backed by Iran. Both groups are proscribed as terrorist organisations by Israel, the UK and other countries.\nIn recent weeks, Israeli officials have repeatedly warned that they will use military force to restore security along the northern border if diplomacy fails.\n“We are striking Hezbollah very hard every day and we will also reach a state of full readiness to take any action required in Lebanon, or to reach an arrangement from a position of strength,” Defence Minister Yoav Gallant said on Wednesday. “We prefer an arrangement, but if reality forces us we will know how to fight.”\nHezbollah, heavily armed and long seen as a significantly superior foe to Hamas, has said it does not want a full-out war with Israel and that it will observe in Lebanon any ceasefire in Gaza. \n“Israel can decide what it wants: limited war, total war, partial war,” the group's deputy leader, Naim Qassem, said in an interview with the Associated Press on Tuesday. “But it should expect that our response and our resistance will not be within a ceiling and rules of engagement set by Israel.”\nSo far, more than 400 people have been reported killed in Lebanon, the vast majority of them Hezbollah fighters, and 25 people in Israel, mostly soldiers.\nTens of thousands from communities on both sides of the border have also been displaced.\nHezbollah launched the barrage in response to Israel's killing of one of its senior commanders.\nPalestinians and the UN criticise the move, which comes at a time of fraught tensions in the region. \nAn Israeli soldier is killed and another wounded in what police call a \"suspected terror attack\".\nPalestinians continue to stream out of eastern Khan Younis in response to Israeli evacuation orders.\nPatients have left a hospital and tent camps as Israel appears poised to launch another assault on the city.\nCopyright 2024 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
    "value": -2.28,
    "type": "general"
},
{
    "title": "\n\t\tOrange County man convicted of hate crime murder in killing of gay ex-classmate Blaze Bernstein\t",
    "source": "NBC Los Angeles",
    "body": "An Orange County man was convicted of first-degree murder and a hate crime Wednesday in the stabbing death of a gay former high school classmate in 2018.\nJurors found Samuel Woodward, 26, guilty in the stabbing death of 19-year-old Blaze Bernstein, whose body was left in a shallow grave at Borrego park in Lake Forest. The victim had been repeatedly stabbed in the face and neck.\n📺 Los Angeles news 24/7: Watch NBC4 free wherever you are\nThere were audible cheers in the courtroom when the hate crime decision was announced. The judge asked for quiet before the clerk continued reading the jury's verdict. \nBernstein's mother said she is relieved following the hate crime murder conviction. Jeanne Pepper Berstein spoke Wednesday outside the Santa Ana courtroom where Woodward was convicted. She thanked people for their support and said the family will need time to process the outcome of the murder trial.\n\"This is a great relief that justice was served and this despicable human who murdered our son will no longer be a threat to the public,\" she said, adding that the family will now \"live our lives knowing that this murderer will no longer be able to hurt any other people.\"\nThere were no indications of any visible reaction from Woodward when the verdict was read. He sat facing forward, his face obscured by his long, hair.\nThe verdict was reached one day of deliberations. Sentencing was scheduled for Oct. 25. He faces up to life in prison without the possibility of parole \nThe hate-crime enhancement alleged Woodward killed Bernstein because of the victim's sexual orientation, not because he was Jewish, though jurors were also given evidence of the defendant's association with a neo-Nazi group known as the Atomwaffen Division to consider a pattern of bigotry. \n\nWoodward and Bernstein attended the Orange County School of the Arts together for four years. Bernstein graduated after six years at the school and went on to become a pre-med student at the University of Pennsylvania.\nThe prosecution alleged during the trial that Woodward targeted gay men online and reached out to them before abruptly cutting off communication.\nWoodward had admitted during the trial that he had matched with Bernstein on a dating app, and the two met up when Bernstein was home during his winter break while attending the University of Pennsylvania. Woodward testified while he and Bernstein were laying in the park together that Bernstein started to touch him in a sexual manner.\nHe said he was in “mortal terror” after seeing the light on Bernstein's cell phone. He was afraid Bernstein was recording and sending photos out to others. Woodward then testified that he stabbed Bernstein and felt an anger like he’d never felt in his whole life. \nWoodward said he dug a shallow grave with his hands and left Bernstein's body in the park. \nBernstein did not arrived for a dentist appointment the next day. When he couldn't be reached, his parents began to search for their son and contacted authorities.\nHis body was found Jan. 9, 2018. The location had been searched earlier, but a rainstorm revealed his remains, prosecutors said.\nWoodward spent five days testifying during the trial, often taking a long time to respond to yes or no questions. \nWoodward’s defense attorney said Woodward did not hate Bernstein and did not plan to kill him when the two met up, instead saying Woodward was conflicted by his own sexuality and acted in a fit of rage. Woodward's attorney, Ken Morrison of the Orange County Public Defender's Office, told reporters after the verdict that he \"made a very strong record of appellate issues, which included denial of the right of jurors to consider critical evidence to a fair trial, and while these issues remain on appeal I will have no further comment.\"\nThe defense also argued Woodward's long undiagnosed issues with autism left him vulnerable to recruitment by the white supremacist groups that target individuals like the defendant, who sought \"acceptance and validation.” Woodward also had an \"obsession'' with gay men and gay porn sites, his defense attorney said.\nThe trial has involved numerous witnesses including relatives, friends and authorities. \nThe defense portrayed Woodward as a young man struggling through life with autism, which they said led to social awkwardness and loneliness. He joined the extremist group Atomwaffen Division for a sense of belonging, the attorney argued, but that he soon became disillusioned with the group.\nMorrison said Woodward admired how Bernstein was comfortable with his sexual orientation.\n\"Blaze Bernstein was in a lot of ways intimidating because he had qualities (Woodward) thought he lacked,\" Morrison said. \"Sam was questioning all these things, looking for strong men, something he aspired to be.\"\nBernstein's parents checked their son's social media in a desperate search for clues and called Woodward, who lied about what happened to their son, prosecutors said. Woodward also searched for information about DNA and cut his hair to change his appearance, prosecutors added.\n\"The abundance of evidence here is overwhelming,\" Senior Deputy District Attorney Jennifer Walker said, adding that Bernstein kept his promise not to share the details of their conversations with others.\n\"Blaze Bernstein is not here to defend himself against these allegations,\" Walker said.",
    "value": -5.84,
    "type": "general"
},
{
    "title": "Despicable Me 4 Lights $27M Wednesday,A CinemaScore; $120M 5-Day Opening Still In Reach; ‘Inside Out 2’ Crossing Half Billion U.S. Today – Box Office Update",
    "source": "Deadline",
    "body": "\n\t\t\t\t\tBy Anthony D'Alessandro \nEditorial Director/Box Office Editor\n\nJULY 4TH AM UPDATE: Illumination/Universal’s Despicable Me 4 came in a little lighter than spotted but strong enough at $27M at 4,030 theaters. While 5-day forecasts are always hard to project this far off, everything becomes clear by Friday. Even at this level, the fourth chapter of Gru/sixth Minions title could still see a $70M 3-day and $120M 5-day. Interest in this bunch hasn’t waned yet for audiences who gave it an A CinemaScore, the same grade as chapters 1 and 2, and a notch above Despicable Me 3’s A-. Overall it’s the fifth A for the Minions/Despicable Me franchise. \n\n\tSocial Media analytics corp RelishMix reports a very strong social media universe for DM4 across TikTok, Facebook, X, YouTube and Instagram with 641.5M, 26% ahead of family animated comps but behind the 1.6 billion of pre-Covid’s Despicable Me 3 in 2017 as well as post-pandemic’s Minions: The Rise of Gru‘s 668.4M. Over half of the cast on DM4 are activated on social including Sofia Vergara at 58.6M, Joey King at 37.8M, Maranda Cosgrove at 30.3M and Stephen Colbert at 29.5M.\n\n\t\n\n\n\n\n\n\n\n\n\n\nRELATED: The Highest-Grossing Animated Films Of All Time At The Box Office: Photo Gallery\n\n\n\t“Convo on DM4 runs positive, with the long-running franchise having built up an expectation with fans both young and old alike,” RelishMix says. “Some are excited with the promise of the new Mega Minions, a group of superhero hybrid minions that are new to this installment. One person comments, ‘Despicable Me 4 with some touch of Fantastic 4.’ Others enjoy the breeziness of these movies, not asking much of their audience and divorced from reality in almost every way, especially in the current political epoch with Disney coming under fire for representing the opposite of that creative lifestyle. Another commenter says, ‘This thing will make a billion. One of the rare films I can trust not lecturing me about how to live my life.'”\n\nRelated: The Movies That Have Made More Than $1 Billion At The Box Office: Photo Gallery\n\n\tThe fourth Despicable Me finds Gru, Lucy, Margo, Edith and Agnes welcoming a new member to the family, Gru Jr., who is intent on aggravating his father. Gru also squares off with a new enemy in Maxime Le Mal and his girlfriend Valentina, and the family is forced to go on the run.\n\nDM4 easily won Wednesday ahead of Inside Out 2, which did $7.3M at 4,440 theaters, -35% from Tuesday for a $496.6M cume. Look for the Pixar sequel to cross the half-billion mark today stateside in its 21st day. That’s the fastest that any animated movie has ever hit that threshold, besting Pixar’s previous 24-day run to $500M with 2018’s Incredibles 2. Current outlook for IO2 is $31.7M fourth weekend, -45%, $46.3M 5-day and a total by Sunday of $535.6M. \n\n\t\n\n\n\n\n\n\n\n\n\n\n\tParamount’s A Quiet Place: Day One was third Wednesday at 3,708 locations with $4.3M, -33% from Tuesday and a running total of $68.4M. Expected 3-day is $22.3M (-57%) for the Lupita Nyong’o movie and $31.6M 5-day for a running cume by Sunday of $95.7M. \n\nRELATED: The 20 Best Summer Movies Streaming On Max, Prime Video, Disney+ And More\n\n\tSony’s Bad Boys: Ride or Die at 2,825 grossed $1.2M, -17% from Tuesday for a running total of $169.1M. 3-day looks like $6M, 5-day like $8.7M. Total by Sunday is $176.6M.\n\n\tNew Line’s Kevin Costner title Horizon: An American Saga – Chapter 1 at 3,334 sites made $1.1M yesterday, for what looks like a $5.4M 3-day and $7.8M 5-day for a running total of $21.6M by Sunday. If this movie cost $50M (out of the franchise’s total $100M before P&A), it’s not even going to make that at the domestic box office in the end. \n\n\tBecause it’s the Fourth of July, don’t expect ticket sales to go into overdrive as many are sidelined with holiday activities. DM4 is expected to ease by around 20% if not less today, while Inside Out 2 should remain even with Wednesday. \n\nWEDNESDAY PM: Surprise, surprise: Minions are the lords of Independence Day.\n\n\tIllumination/Universal’s Despicable Me 4 is looking at $28 million Wednesday, sans Tuesday previews (they weren’t held), which is high enough to get the movie to an estimated $120 million over its first five days through Sunday. That’s where tracking was spotting it, and it’s an amount that underscores the continued upward nature of the current box office as event films crowd the schedule in the wake of the double Hollywood strikes. The Friday-Sunday take for Despicable Me 4 stands at $70M.  \n\n\tRotten Tomatoes critics aren’t fond of Despicable Me 4 at 53% Rotten, which is lower than Minions. Luckily for Illumination and Universal, those opinions did not prevent audiences from turning this franchise into a multibillion-dollar phenomenon. Proof? The audience RT score for the fourthquel from director Chris Renaud and Patrick Delage is 89%.\n\nDespicable Me 4 also is going in 52 offshore markets this weekend, including in Mexico, Spain and Brazil. The pic has some $25M already in the bank from the international box office, and the total global running total is expected to be around $200M by Sunday. \n\n\tThe Despicable Me and Minions universe counts a running series total of $4.67 billion worldwide. The highest-grossing title in the franchise is 2015’s Minions with $1.1 billion. \nSubscribe to Deadline Breaking News Alerts and keep your inbox happy.\nSignup for Breaking News Alerts & Newsletters\n\n\t\t\tBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\t\t\nGet our latest storiesin the feed of your favorite networks\nWe want to hear from you! Send us a tip using our annonymous form.\nSign up for our breaking news alerts\n\n\t\tBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\t\nDeadline is a part of Penske Media Corporation. © 2024 Deadline Hollywood, LLC. All Rights Reserved.\n\n\t\tBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\t",
    "value": -4.20,
    "type": "general"
}
  ]
}