{
    "headlines": [
      {
        "title": "A global tax war is looming. It could hit Big Tech hard",
        "source": "CNN",
        "body": "A stalemate in Washington could destroy a landmark tax deal that was painstakingly hammered out among 140 countries over the better part of a decade. \n\n Some analysts say that the United States’ inability to ratify the deal could lead to a tax war among the richest nations that would hit tech behemoths like Google, Apple, Meta and Amazon particularly hard. \n\n What’s happening: The Organisation for Economic Co-operation and Development (OECD) worked for years to negotiate a deal among its member countries that would close loopholes allowing large multinational companies to avoid paying up to $240 billion each year in tax.\n\n In 2021, the OECD came up with an agreement that all parties signed on to. Called the ”Pillar 1” reform, it would simply require companies to pay taxes in the country they made money in, regardless of whether or not the company was headquartered there. \n\n It took more than a decade of work by the OECD and related parties to get there. \n\n The problem: The Pillar 1 reform was supposed to be ratified by June 30. That didn’t happen. \n\n While the Biden administration broadly supports the plan, Senate Republicans are against it, and a divided Senate has stopped the US ratifying the agreement. (“Under the US Constitution, tax treaties require the advice and consent of the Senate, with a two-thirds majority vote of approval,” according to the Senate Committee on Finance website.) \n\n Former President Donald Trump, meanwhile, has indicated that he wouldn’t support the reforms if he’s elected back into the Oval Office this November. \n\n Other countries aren’t waiting to find out. Canada recently implemented a local tax on the world’s largest tech companies, something the OECD treaty had sought to avoid. New Zealand has also said it will implement its own digital services tax on large multinational companies beginning in 2025. \n\n Manal Corwin, director of the OECD’s Centre for Tax Policy and Administration, says that negotiations are still ongoing. \n\n “Countries are still at the table, precisely because we are making progress,” she wrote in a statement Monday. “As each of these milestones arrives, whether we successfully conclude by a given date or not, we get closer to the finish line,” she said. “It is exactly why the commitment remains high and why we remain optimistic that the (group) can deliver a final agreement.” \n\n What it means: If no global agreement goes into effect, some countries will begin to compete for revenue from large multinationals by lowering taxes in what is sometimes called a “tax war.” \n\n It will also mean that large tech companies will have to contend with inconsistent tax codes around the globe, as national taxes proliferate (see Canada and New Zealand.)\n\n “When companies are feeling secure and can predict where policy is going and what the global financial outlook will be for the foreseeable future, they are much more confident in making investments,” said Megan Funkhouser of the Information Technology Industry Council, a group that represents the tech sector. If taxation and global policy toward digital companies is “uncertain, unpredictable and unstable” she said, companies might not want to “make investments, contribute to economic growth and create and retain jobs.”",
        "value": -6.60,
        "type": "business"
      
      },
      {
        "title": "Federal judge temporarily blocks rule banning noncompete contracts",
        "source": "The Washington Post",
        "body": "A federal judge in Texas temporarily blocked on Wednesday a Federal Trade Commission rule banning noncompete agreements, a new regulation business groups have strenuously opposed. \n\nIn a 33-page opinion, Judge Ada Brown found that the agency lacked the authority to issue the rule, which makes it illegal for employers to include noncompete agreements in workers’ contracts. Brown’s order, which is limited to the plaintiffs, postpones the effective date of the rule, Sept. 4, until the court reaches a decision on the case’s merits, which she said would take place by Aug. 30. The plaintiffs include a Dallas-based tax consultancy and the U.S. Chamber of Commerce.\n\nThe FTC rule could affect up to millions of workers outside the scope of the lawsuit once it kicks in, as some studies suggest up to one in five employees are bound by noncompete agreements.\n\nNoncompete agreements typically restrict workers from switching employers within their industry for specified periods of time. They’re used in a wide range of industries — including technology, hairstyling, medicine and even dance instruction — affecting low- to high-wage earners. \n\nIn April, the FTC voted 3-2 to ban the agreements, with commissioners in the majority pointing to research that shows such covenants suppress wages, stifle entrepreneurship and gum up labor markets. Critics of the rule, including business groups such as the U.S. Chamber of Commerce, argued that the agreements are an important tool to protect proprietary information and investments in training. \n\nThe Chamber and other business groups sued to block the rule immediately after it was issued, arguing the FTC lacked the authority to issue a regulation with such sweeping implications for the economy.\n\n The Chamber subsequently joined the case brought by Ryan LLC, a global tax-consulting firm headquartered in Dallas, that sued to block the rule in Northern District of Texas on April 23, the day the FTC issued its rule. The Business Roundtable, the Texas Association of Business and the Longview Chamber of Commerce also joined the case after it was initially filed. \n\n “This ruling is a big win in the Chamber’s fight against government micromanagement of business decisions,” Daryl Joseffer, chief counsel at the Chamber, said in a statement. “The FTC’s blanket ban on noncompetes is an unlawful power grab that defies the agency’s constitutional and statutory authority and sets a dangerous precedent where the government knows better than the markets.” \n\nThe FTC said it’s reviewing the decision and evaluating its next steps. \n\n “The FTC stands by our clear authority, supported by statute and precedent, to issue this rule,” Douglas Farrar, an FTC spokesman, said in a statement. “We will keep fighting to free hard-working Americans from unlawful noncompetes, which reduce innovation, inhibit economic growth, trap workers, and undermine Americans’ economic liberty.” \n\nIn reaching her decision, Brown found that the plaintiffs “are likely to succeed on the merits” of their case, which argues the FTC exceeded its statutory authority in issuing the rule. She also sided with the plaintiffs in finding that the FTC’s issuing of the rule was not reasonable. \n\n “The Commission’s lack of evidence as to why they chose to impose such a sweeping prohibition — that prohibits entering or enforcing virtually all non-competes — instead of targeting specific, harmful non-competes, renders the arbitrary and capricious,” Brown wrote.",
        "value": -6.72,
        "type": "business"
      },
      {
        "title": "GM will pay $146M in penalties because 5.9M older vehicles emit excess carbon dioxide",
        "source": "The NewYork Post",
        "body": "General Motors will pay nearly $146 million in penalties to the federal government because 5.9 million of its older vehicles do not comply with emissions and fuel economy standards. \n\n The National Highway Traffic Safety Administration said in a statement Wednesday that certain GM vehicles from the 2012 through 2018 model years did not comply with federal fuel economy requirements.\n\n The penalty comes after the Environmental Protection Agency said its testing showed the GM pickup trucks and SUVs emit over 10% more carbon dioxide on average than GM’s initial compliance testing claimed.\n\n The EPA says the vehicles will remain on the road and cannot be repaired.\n\n The GM vehicles on average consume at least 10% more fuel than the window sticker numbers say, but the company won’t be required to reduce the miles per gallon on the stickers, the EPA said.\n\n “Our investigation has achieved accountability and upholds an important program that’s reducing air pollution and protecting communities across the country,” EPA Administrator Michael Regan said. \n\n GM said in a statement that it complied with all regulations in pollution and mileage certification of its vehicles. \n\n The company said it is not admitting to any wrongdoing nor that it failed to comply with the Clean Air Act. \n\n The problem stems from a change in testing procedures that the EPA put in place in 2016, GM spokesman Bill Grotz said. \n\n Owners don’t have to take any action because there is no defect in the vehicles, Grotz said. \n\n “We believe this voluntary action is the best course of action to resolve the outstanding issues with the federal government,” he said. \n\n The enforcement action involves about 4.6 million full-size pickups and SUVs and about 1.3 million midsize SUVs, the EPA said. \n\n The affected models include the Chevy Tahoe, Cadillac Escalade and Chevy Silverado. About 40 variations of GM vehicles are covered. \n\n GM will be forced to give up credits used to ensure that manufacturers’ greenhouse gas emissions are below the fleet standard for emissions that applies for that model year, the EPA said. \n\n In a quarterly filing with the Securities and Exchange Commission, GM said it expects the total cost to resolve the matter will be $490 million. \n\n Because GM agreed to address the excess emissions, EPA said it was not necessary to make a formal determination regarding the reasons for the excess pollution. \n\n But David Cooke, senior vehicles analyst for the Union of Concerned Scientists, questioned how GM could not know that pollution exceeded initial test by more than 10% because the problem was so widespread on so many different vehicles. \n\n “You don’t just make a more than 10% rounding error,” he said. \n\n Dan Becker, director of the Safe Climate Transport Campaign for the environmental group Center for Biological Diversity, said the violations by GM “show why automakers can’t be trusted to protect our air and health, and why we need strong pollution rules. Supreme Court, take notice!” \n\n In similar pollution cases in the past, automakers have been fined under the Clean Air Act for such violations, and the Justice Department normally gets involved, Cooke said.",
        "value": 9.12,
        "type": "business"
      },
      {
        "title": "Mod Pizza chain could soon be filing for bankruptcy",
        "source": "The NewYork Post",
        "body": "Popular fast-casual pizza chain Mod Pizza could soon be filing for bankruptcy — following in the footsteps of several other well-known US restaurants, according to a new report. \n\nThe company, which has locations in 28 states, is preparing a potential bankruptcy filing and could enter court protection as soon as next week, sources told Bloomberg Wednesday. \n\n However the situation is fluid and plans could change, the sources, who asked not to be identified to share the insider knowledge, told the publication. \n\n The pizza joint known for its made-on-the-spot, customizable personal pizzas has more than 500 locations across the country since opening its first restaurant in Seattle in 2008. \n\n Mod Pizza earned $700 million in system sales by last year and was once one of the country’s fastest-growing restaurant chains and in 2019, planned to operate 1,000 locations across the US within five years — by the current year, according to Restaurant Business. \n\n Instead, the chain — which named a new CEO in January, replacing cofounder Scott Svenson — closed 26 underperforming locations in April and more appear to have shut their doors since then, the trade publication reported. \n\n A representative for Mod Pizza didn’t immediately respond when reached by email. \n\n The take-out pizzeria is the latest restaurant chain to struggle financially. \n\n Red Lobster filed for bankruptcy in May and the beloved Mexican chain Rubio’s filed a bankruptcy petition last month. \n\n Many more chains have shuttered locations all over the US as they try to stay afloat in the current economy.",
        "value": 9.12,
        "type": "business"
      },
      {
        "title": "Another Headline 4",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },      {
        "title": "Another Headline 5",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 6",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 7",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 8",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 9",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 10",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 11",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 12",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 13",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 14",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 15",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 16",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 17",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 18",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 19",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 20",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 21",
        "source": "BBC",
        "body": "This is another news story from BBC."
      },
      {
        "title": "Another Headline 22",
        "source": "BBC",
        "body": "This is another news story from BBC."
      }

      
    ]
  }
  